[
        {
            "word": "Access Control",
            "def": "Access Control \n Access Control ensures that resources are only granted to those users who are entitled to them."
        },
        {
            "word": "Access Control List (ACL)",
            "def": "Access Control List (ACL) \n A mechanism that implements access control for a system resource by listing the identities of the system entities that are permitted to access the resource."
        },
        {
            "word": "Access Control Service",
            "def": "Access Control Service \n A security service that provides protection of system resources against unauthorized access. The two basic mechanisms for implementing this service are ACLs and tickets."
        },
        {
            "word": "Access Management Access",
            "def": "Access Management Access \n Management is the maintenance of access information which consists of four tasks: account administration, maintenance, monitoring, and revocation."
        },
        {
            "word": "Access Matrix",
            "def": "Access Matrix \n An Access Matrix uses rows to represent subjects and columns to represent objects with privileges listed in each cell."
        },
        {
            "word": "Account Harvesting",
            "def": "Account Harvesting \n Account Harvesting is the process of collecting all the legitimate account names on a system."
        },
        {
            "word": "ACK Piggybacking",
            "def": "ACK Piggybacking \n ACK piggybacking is the practice of sending an ACK inside another packet going to the same destination."
        },
        {
            "word": "Active Content",
            "def": "Active Content \n Program code embedded in the contents of a web page. When the page is accessed by a web browser, the embedded code is automatically downloaded and executed on the user's workstation. Ex. Java, ActiveX (MS)"
        },
        {
            "word": "Activity Monitors",
            "def": "Activity Monitors \n Activity monitors aim to prevent virus infection by monitoring for malicious activity on a system, and blocking that activity when possible."
        },
        {
            "word": "Address Resolution Protocol (ARP)",
            "def": "Address Resolution Protocol (ARP) \n Address Resolution Protocol (ARP) is a protocol for mapping an Internet Protocol address to a physical machine address that is recognized in the local network. A table, usually called the ARP cache, is used to maintain a correlation between each MAC address and its corresponding IP address. ARP provides the protocol rules for making this correlation and providing address conversion in both directions."
        },
        {
            "word": "Advanced Encryption Standard (AES)",
            "def": "Advanced Encryption Standard (AES) \n An encryption standard being developed by NIST. Intended to specify an unclassified, publicly-disclosed, symmetric encryption algorithm."
        },
        {
            "word": "Algorithm",
            "def": "Algorithm \n A finite set of step-by-step instructions for a problem-solving or computation procedure, especially one that can be implemented by a computer."
        },
        {
            "word": "Applet",
            "def": "Applet \n Java programs; an application program that uses the client's web browser to provide a user interface."
        },
        {
            "word": "ARPANET",
            "def": "ARPANET \n Advanced Research Projects Agency Network, a pioneer packet-switched network that was built in the early 1970s under contract to the US Government, led to the development of today's Internet, and was decommissioned in June 1990."
        },
        {
            "word": "Asymmetric Cryptography",
            "def": "Asymmetric Cryptography \n Public-key cryptography; A modern branch of cryptography in which the algorithms employ a pair of keys (a public key and a private key) and use a different component of the pair for different steps of the algorithm."
        },
        {
            "word": "Asymmetric Warfare",
            "def": "Asymmetric Warfare \n Asymmetric warfare is the fact that a small investment, properly leveraged, can yield incredible results."
        },
        {
            "word": "Auditing",
            "def": "Auditing \n Auditing is the information gathering and analysis of assets to ensure such things as policy compliance and security from vulnerabilities."
        },
        {
            "word": "Authentication",
            "def": "Authentication \n Authentication is the process of confirming the correctness of the claimed identity."
        },
        {
            "word": "Authenticity",
            "def": "Authenticity \n Authenticity is the validity and conformance of the original information."
        },
        {
            "word": "Authorization",
            "def": "Authorization \n Authorization is the approval, permission, or empowerment for someone or something to do something."
        },
        {
            "word": "Autonomous System",
            "def": "Autonomous System \n One network or series of networks that are all under one administrative control. An autonomous system is also sometimes referred to as a routing domain. An autonomous system is assigned a globally unique number, sometimes called an Autonomous System Number (ASN)."
        },
        {
            "word": "Availability",
            "def": "Availability \n Availability is the need to ensure that the business purpose of the system can be met and that it is accessible to those who need to use it."
        },
        {
            "word": "Backdoor",
            "def": "Backdoor \n A backdoor is a tool installed after a compromise to give an attacker easier access to the compromised system around any security mechanisms that are in place."
        },
        {
            "word": "Bandwidth",
            "def": "Bandwidth \n Commonly used to mean the capacity of a communication channel to pass data through the channel in a given amount of time. Usually expressed in bits per second."
        },
        {
            "word": "Banner",
            "def": "Banner \n A banner is the information that is displayed to a remote user trying to connect to a service. This may include version information, system information, or a warning about authorized use."
        },
        {
            "word": "Basic Authentication",
            "def": "Basic Authentication \n Basic Authentication is the simplest web-based authentication scheme that works by sending the username and password with each request."
        },
        {
            "word": "Bastion Host",
            "def": "Bastion Host \n A bastion host has been hardened in anticipation of vulnerabilities that have not been discovered yet."
        },
        {
            "word": "BIND",
            "def": "BIND \n BIND stands for Berkeley Internet Name Domain and is an implementation of DNS. DNS is used for domain name to IP address resolution."
        },
        {
            "word": "Biometrics",
            "def": "Biometrics \n Biometrics use physical characteristics of the users to determine access."
        },
        {
            "word": "Bit",
            "def": "Bit \n The smallest unit of information storage; a contraction of the term \"binary digit;\" one of two symbolsN\"0\" (zero) and \"1\" (one) - that are used to represent binary numbers."
        },
        {
            "word": "Block Cipher",
            "def": "Block Cipher \n A block cipher encrypts one block of data at a time."
        },
        {
            "word": "Boot Record Infector",
            "def": "Boot Record Infector \n A boot record infector is a piece of malware that inserts malicious code into the boot sector of a disk."
        },
        {
            "word": "Border Gateway Protocol (BGP)",
            "def": "Border Gateway Protocol (BGP) \n An inter-autonomous system routing protocol. BGP is used to exchange routing information for the Internet and is the protocol used between Internet service providers (ISP)."
        },
        {
            "word": "Botnet",
            "def": "Botnet \n A botnet is a large number of compromised computers that are used to create and send spam or viruses or flood a network with messages as a denial of service attack."
        },
        {
            "word": "Bridge",
            "def": "Bridge \n A product that connects a local area network (LAN) to another local area network that uses the same protocol (for example, Ethernet or token ring)."
        },
        {
            "word": "British Standard 7799",
            "def": "British Standard 7799 \n A standard code of practice and provides guidance on how to secure an information system. It includes the management framework, objectives, and control requirements for information security management systems."
        },
        {
            "word": "Broadcast",
            "def": "Broadcast \n To simultaneously send the same message to multiple recipients. One host to all hosts on network."
        },
        {
            "word": "Broadcast Address",
            "def": "Broadcast Address \n An address used to broadcast a datagram to all hosts on a given network using UDP or ICMP protocol."
        },
        {
            "word": "Browser",
            "def": "Browser \n A client computer program that can retrieve and display information from servers on the World Wide Web."
        },
        {
            "word": "Brute Force",
            "def": "Brute Force \n A cryptanalysis technique or other kind of attack method involving an exhaustive procedure that tries all possibilities, one-by-one."
        },
        {
            "word": "Buffer Overflow",
            "def": "Buffer Overflow \n A buffer overflow occurs when a program or process tries to store more data in a buffer (temporary data storage area) than it was intended to hold. Since buffers are created to contain a finite amount of data, the extra information - which has to go somewhere - can overflow into adjacent buffers, corrupting or overwriting the valid data held in them."
        },
        {
            "word": "Business Continuity Plan (BCP)",
            "def": "Business Continuity Plan (BCP) \n A Business Continuity Plan is the plan for emergency response, backup operations, and post-disaster recovery steps that will ensure the availability of critical resources and facilitate the continuity of operations in an emergency situation."
        },
        {
            "word": "Business Impact Analysis (BIA)",
            "def": "Business Impact Analysis (BIA) \n A Business Impact Analysis determines what levels of impact to a system are tolerable."
        },
        {
            "word": "Byte",
            "def": "Byte \n A fundamental unit of computer storage; the smallest addressable unit in a computer's architecture. Usually holds one character of information and usually means eight bits."
        },
        {
            "word": "Cache",
            "def": "Cache \n Pronounced cash, a special high-speed storage mechanism. It can be either a reserved section of main memory or an independent high-speed storage device. Two types of caching are commonly used in personal computers: memory caching and disk caching."
        },
        {
            "word": "Cache Cramming",
            "def": "Cache Cramming \n Cache Cramming is the technique of tricking a browser to run cached Java code from the local disk, instead of the internet zone, so it runs with less restrictive permissions."
        },
        {
            "word": "Cache Poisoning",
            "def": "Cache Poisoning \n Malicious or misleading data from a remote name server is saved [cached] by another name server. Typically used with DNS cache poisoning attacks."
        },
        {
            "word": "Call Admission Control (CAC)",
            "def": "Call Admission Control (CAC) \n The inspection and control all inbound and outbound voice network activity by a voice firewall based on user-defined policies."
        },
        {
            "word": "Cell",
            "def": "Cell \n A cell is a unit of data transmitted over an ATM network."
        },
        {
            "word": "Certificate-Based Authentication",
            "def": "Certificate-Based Authentication \n Certificate-Based Authentication is the use of SSL and certificates to authenticate and encrypt HTTP traffic."
        },
        {
            "word": "CGI",
            "def": "CGI \n Common Gateway Interface. This mechanism is used by HTTP servers (web servers) to pass parameters to executable scripts in order to generate responses dynamically."
        },
        {
            "word": "Chain of Custody",
            "def": "Chain of Custody \n Chain of Custody is the important application of the Federal rules of evidence and its handling."
        },
        {
            "word": "Challenge-Handshake Authentication Protocol (CHAP)",
            "def": "Challenge-Handshake Authentication Protocol (CHAP) \n The Challenge-Handshake Authentication Protocol uses a challenge/response authentication mechanism where the response varies every challenge to prevent replay attacks."
        },
        {
            "word": "Checksum",
            "def": "Checksum \n A value that is computed by a function that is dependent on the contents of a data object and is stored or transmitted together with the object, for the purpose of detecting changes in the data."
        },
        {
            "word": "Cipher",
            "def": "Cipher \n A cryptographic algorithm for encryption and decryption."
        },
        {
            "word": "Ciphertext",
            "def": "Ciphertext \n Ciphertext is the encrypted form of the message being sent."
        },
        {
            "word": "Circuit Switched Network",
            "def": "Circuit Switched Network \n A circuit switched network is where a single continuous physical circuit connected two endpoints where the route was immutable once set up."
        },
        {
            "word": "Client",
            "def": "Client \n A system entity that requests and uses a service provided by another system entity, called a \"server.\" In some cases, the server may itself be a client of some other server."
        },
        {
            "word": "Cold/Warm/Hot Disaster Recovery Site",
            "def": "Cold/Warm/Hot Disaster Recovery Site \n * Hot site. It contains fully redundant hardware and software, with telecommunications, telephone and utility connectivity to continue all primary site operations. Failover occurs within minutes or hours, following a disaster. Daily data synchronization usually occurs between the primary and hot site, resulting in minimum or no data loss. Offsite data backup tapes might be obtained and delivered to the hot site to help restore operations. Backup tapes should be regularly tested to detect data corruption, malicious code and environmental damage. A hot site is the most expensive option. * Warm site. It contains partially redundant hardware and software, with telecommunications, telephone and utility connectivity to continue some, but not all primary site operations. Failover occurs within hours or days, following a disaster. Daily or weekly data synchronization usually occurs between the primary and warm site, resulting in minimum data loss. Offsite data backup tapes must be obtained and delivered to the warm site to restore operations. A warm site is the second most expensive option. * Cold site. Hardware is ordered, shipped and installed, and software is loaded. Basic telecommunications, telephone and utility connectivity might need turning on to continue some, but not all primary site operations. Relocation occurs within weeks or longer, depending on hardware arrival time, following a disaster. No data synchronization occurs between the primary and cold site, and could result in significant data loss. Offsite data backup tapes must be obtained and delivered to the cold site to restore operations. A cold site is the least expensive option."
        },
        {
            "word": "Collision",
            "def": "Collision \n A collision occurs when multiple systems transmit simultaneously on the same wire."
        },
        {
            "word": "Competitive Intelligence",
            "def": "Competitive Intelligence \n Competitive Intelligence is espionage using legal, or at least not obviously illegal, means."
        },
        {
            "word": "Computer Emergency Response Team (CERT)",
            "def": "Computer Emergency Response Team (CERT) \n An organization that studies computer and network INFOSEC in order to provide incident response services to victims of attacks, publish alerts concerning vulnerabilities and threats, and offer other information to help improve computer and network security."
        },
        {
            "word": "Computer Network",
            "def": "Computer Network \n A collection of host computers together with the sub-network or inter-network through which they can exchange data."
        },
        {
            "word": "Confidentiality",
            "def": "Confidentiality \n Confidentiality is the need to ensure that information is disclosed only to those who are authorized to view it."
        },
        {
            "word": "Configuration Management",
            "def": "Configuration Management \n Establish a known baseline condition and manage it."
        },
        {
            "word": "Cookie",
            "def": "Cookie \n Data exchanged between an HTTP server and a browser (a client of the server) to store state information on the client side and retrieve it later for server use. An HTTP server, when sending data to a client, may send along a cookie, which the client retains after the HTTP connection closes. A server can use this mechanism to maintain persistent client-side state information for HTTP-based applications, retrieving the state information in later connections."
        },
        {
            "word": "Corruption",
            "def": "Corruption \n A threat action that undesirably alters system operation by adversely modifying system functions or data."
        },
        {
            "word": "Cost Benefit Analysis",
            "def": "Cost Benefit Analysis \n A cost benefit analysis compares the cost of implementing countermeasures with the value of the reduced risk."
        },
        {
            "word": "Countermeasure",
            "def": "Countermeasure \n Reactive methods used to prevent an exploit from successfully occurring once a threat has been detected. Intrusion Prevention Systems (IPS) commonly employ countermeasures to prevent intruders form gaining further access to a computer network. Other counter measures are patches, access control lists and malware filters."
        },
        {
            "word": "Covert Channels",
            "def": "Covert Channels \n Covert Channels are the means by which information can be communicated between two parties in a covert fashion using normal system operations. For example by changing the amount of hard drive space that is available on a file server can be used to communicate information."
        },
        {
            "word": "Crimeware",
            "def": "Crimeware \n A type of malware used by cyber criminals. The malware is designed to enable the cyber criminal to make money off of the infected system (such as harvesting key strokes, using the infected systems to launch Denial of Service Attacks, etc.)."
        },
        {
            "word": "Cron",
            "def": "Cron \n Cron is a Unix application that runs jobs for users and administrators at scheduled times of the day."
        },
        {
            "word": "Crossover Cable",
            "def": "Crossover Cable \n A crossover cable reverses the pairs of cables at the other end and can be used to connect devices directly together."
        },
        {
            "word": "Cryptanalysis",
            "def": "Cryptanalysis \n The mathematical science that deals with analysis of a cryptographic system in order to gain knowledge needed to break or circumvent the protection that the system is designed to provide. In other words, convert the cipher text to plaintext without knowing the key."
        },
        {
            "word": "Cryptographic Algorithm or Hash",
            "def": "Cryptographic Algorithm or Hash \n An algorithm that employs the science of cryptography, including encryption algorithms, cryptographic hash algorithms, digital signature algorithms, and key agreement algorithms."
        },
        {
            "word": "Cut-Through",
            "def": "Cut-Through \n Cut-Through is a method of switching where only the header of a packet is read before it is forwarded to its destination."
        },
        {
            "word": "Cyclic Redundancy Check (CRC)",
            "def": "Cyclic Redundancy Check (CRC) \n Sometimes called \"cyclic redundancy code.\" A type of checksum algorithm that is not a cryptographic hash but is used to implement data integrity service where accidental changes to data are expected."
        },
        {
            "word": "Daemon",
            "def": "Daemon \n A program which is often started at the time the system boots and runs continuously without intervention from any of the users on the system. The daemon program forwards the requests to other programs (or processes) as appropriate. The term daemon is a Unix term, though many other operating systems provide support for daemons, though they're sometimes called other names. Windows, for example, refers to daemons and System Agents and services."
        },
        {
            "word": "Data Aggregation",
            "def": "Data Aggregation \n Data Aggregation is the ability to get a more complete picture of the information by analyzing several different types of records at once."
        },
        {
            "word": "Data Custodian",
            "def": "Data Custodian \n A Data Custodian is the entity currently using or manipulating the data, and therefore, temporarily taking responsibility for the data."
        },
        {
            "word": "Data Encryption Standard (DES)",
            "def": "Data Encryption Standard (DES) \n A widely-used method of data encryption using a private (secret) key. There are 72,000,000,000,000,000 (72 quadrillion) or more possible encryption keys that can be used. For each given message, the key is chosen at random from among this enormous number of keys. Like other private key cryptographic methods, both the sender and the receiver must know and use the same private key."
        },
        {
            "word": "Data Mining",
            "def": "Data Mining \n Data Mining is a technique used to analyze existing information, usually with the intention of pursuing new avenues to pursue business."
        },
        {
            "word": "Data Owner",
            "def": "Data Owner \n A Data Owner is the entity having responsibility and authority for the data."
        },
        {
            "word": "Data Warehousing",
            "def": "Data Warehousing \n Data Warehousing is the consolidation of several previously independent databases into one location."
        },
        {
            "word": "Datagram",
            "def": "Datagram \n Request for Comment 1594 says, \"a self-contained, independent entity of data carrying sufficient information to be routed from the source to the destination computer without reliance on earlier exchanges between this source and destination computer and the transporting network.\" The term has been generally replaced by the term packet. Datagrams or packets are the message units that the Internet Protocol deals with and that the Internet transports. A datagram or packet needs to be self-contained without reliance on earlier exchanges because there is no connection of fixed duration between the two communicating points as there is, for example, in most voice telephone conversations. (This kind of protocol is referred to as connectionless.)"
        },
        {
            "word": "Day Zero",
            "def": "Day Zero \n The \"Day Zero\" or \"Zero Day\" is the day a new vulnerability is made known. In some cases, a \"zero day\" exploit is referred to an exploit for which no patch is available yet. (\"day one\"-> day at which the patch is made available)."
        },
        {
            "word": "Decapsulation",
            "def": "Decapsulation \n Decapsulation is the process of stripping off one layer's headers and passing the rest of the packet up to the next higher layer on the protocol stack."
        },
        {
            "word": "Decryption",
            "def": "Decryption \n Decryption is the process of transforming an encrypted message into its original plaintext."
        },
        {
            "word": "Defacement",
            "def": "Defacement \n Defacement is the method of modifying the content of a website in such a way that it becomes \"vandalized\" or embarrassing to the website owner."
        },
        {
            "word": "Defense In-Depth",
            "def": "Defense In-Depth \n Defense In-Depth is the approach of using multiple layers of security to guard against failure of a single security component."
        },
        {
            "word": "Demilitarized Zone (DMZ)",
            "def": "Demilitarized Zone (DMZ) \n In computer security, in general a demilitarized zone (DMZ) or perimeter network is a network area (a subnetwork) that sits between an organization's internal network and an external network, usually the Internet. DMZ's help to enable the layered security model in that they provide subnetwork segmentation based on security requirements or policy. DMZ's provide either a transit mechanism from a secure source to an insecure destination or from an insecure source to a more secure destination. In some cases, a screened subnet which is used for servers accessible from the outside is referred to as a DMZ."
        },
        {
            "word": "Denial of Service",
            "def": "Denial of Service \n The prevention of authorized access to a system resource or the delaying of system operations and functions."
        },
        {
            "word": "Dictionary Attack",
            "def": "Dictionary Attack \n An attack that tries all of the phrases or words in a dictionary, trying to crack a password or key. A dictionary attack uses a predefined list of words compared to a brute force attack that tries all possible combinations."
        },
        {
            "word": "Diffie-Hellman",
            "def": "Diffie-Hellman \n A key agreement algorithm published in 1976 by Whitfield Diffie and Martin Hellman. Diffie-Hellman does key establishment, not encryption. However, the key that it produces may be used for encryption, for further key management operations, or for any other cryptography."
        },
        {
            "word": "Digest Authentication",
            "def": "Digest Authentication \n Digest Authentication allows a web client to compute MD5 hashes of the password to prove it has the password."
        },
        {
            "word": "Digital Certificate",
            "def": "Digital Certificate \n A digital certificate is an electronic \"credit card\" that establishes your credentials when doing business or other transactions on the Web. It is issued by a certification authority. It contains your name, a serial number, expiration dates, a copy of the certificate holder's public key (used for encrypting messages and digital signatures), and the digital signature of the certificate-issuing authority so that a recipient can verify that the certificate is real."
        },
        {
            "word": "Digital Envelope",
            "def": "Digital Envelope \n A digital envelope is an encrypted message with the encrypted session key."
        },
        {
            "word": "Digital Signature",
            "def": "Digital Signature \n A digital signature is a hash of a message that uniquely identifies the sender of the message and proves the message hasn't changed since transmission."
        },
        {
            "word": "Digital Signature Algorithm (DSA)",
            "def": "Digital Signature Algorithm (DSA) \n An asymmetric cryptographic algorithm that produces a digital signature in the form of a pair of large numbers. The signature is computed using rules and parameters such that the identity of the signer and the integrity of the signed data can be verified."
        },
        {
            "word": "Digital Signature Standard (DSS)",
            "def": "Digital Signature Standard (DSS) \n The US Government standard that specifies the Digital Signature Algorithm (DSA), which involves asymmetric cryptography."
        },
        {
            "word": "Disassembly",
            "def": "Disassembly \n The process of taking a binary program and deriving the source code from it."
        },
        {
            "word": "Disaster Recovery Plan (DRP)",
            "def": "Disaster Recovery Plan (DRP) \n A Disaster Recovery Plan is the process of recovery of IT systems in the event of a disruption or disaster."
        },
        {
            "word": "Discretionary Access Control (DAC)",
            "def": "Discretionary Access Control (DAC) \n Discretionary Access Control consists of something the user can manage, such as a document password."
        },
        {
            "word": "Disruption",
            "def": "Disruption \n A circumstance or event that interrupts or prevents the correct operation of system services and functions."
        },
        {
            "word": "Distance Vector",
            "def": "Distance Vector \n Distance vectors measure the cost of routes to determine the best route to all known networks."
        },
        {
            "word": "Distributed Scans",
            "def": "Distributed Scans \n Distributed Scans are scans that use multiple source addresses to gather information."
        },
        {
            "word": "Domain",
            "def": "Domain \n A sphere of knowledge, or a collection of facts about some program entities or a number of network points or addresses, identified by a name. On the Internet, a domain consists of a set of network addresses. In the Internet's domain name system, a domain is a name with which name server records are associated that describe sub-domains or host. In Windows NT and Windows 2000, a domain is a set of network resources (applications, printers, and so forth) for a group of users. The user need only to log in to the domain to gain access to the resources, which may be located on a number of different servers in the network."
        },
        {
            "word": "Domain Hijacking",
            "def": "Domain Hijacking \n Domain hijacking is an attack by which an attacker takes over a domain by first blocking access to the domain's DNS server and then putting his own server up in its place."
        },
        {
            "word": "Domain Name",
            "def": "Domain Name \n A domain name locates an organization or other entity on the Internet. For example, the domain name \"www.sans.org\" locates an Internet address for \"sans.org\" at Internet point 199.0.0.2 and a particular host server named \"www\". The \"org\" part of the domain name reflects the purpose of the organization or entity (in this example, \"organization\") and is called the top-level domain name. The \"sans\" part of the domain name defines the organization or entity and together with the top-level is called the second-level domain name."
        },
        {
            "word": "Domain Name System (DNS)",
            "def": "Domain Name System (DNS) \n The domain name system (DNS) is the way that Internet domain names are located and translated into Internet Protocol addresses. A domain name is a meaningful and easy-to-remember \"handle\" for an Internet address."
        },
        {
            "word": "Due Care",
            "def": "Due Care \n Due care ensures that a minimal level of protection is in place in accordance with the best practice in the industry."
        },
        {
            "word": "Due Diligence",
            "def": "Due Diligence \n Due diligence is the requirement that organizations must develop and deploy a protection plan to prevent fraud, abuse, and additional deploy a means to detect them if they occur."
        },
        {
            "word": "DumpSec",
            "def": "DumpSec \n DumpSec is a security tool that dumps a variety of information about a system's users, file system, registry, permissions, password policy, and services."
        },
        {
            "word": "Dumpster Diving",
            "def": "Dumpster Diving \n Dumpster Diving is obtaining passwords and corporate directories by searching through discarded media."
        },
        {
            "word": "Dynamic Link Library",
            "def": "Dynamic Link Library \n A collection of small programs, any of which can be called when needed by a larger program that is running in the computer. The small program that lets the larger program communicate with a specific device such as a printer or scanner is often packaged as a DLL program (usually referred to as a DLL file)."
        },
        {
            "word": "Dynamic Routing Protocol",
            "def": "Dynamic Routing Protocol \n Allows network devices to learn routes. Ex. RIP, EIGRP Dynamic routing occurs when routers talk to adjacent routers, informing each other of what networks each router is currently connected to. The routers must communicate using a routing protocol, of which there are many to choose from. The process on the router that is running the routing protocol, communicating with its neighbor routers, is usually called a routing daemon. The routing daemon updates the kernel's routing table with information it receives from neighbor routers."
        },
        {
            "word": "Eavesdropping",
            "def": "Eavesdropping \n Eavesdropping is simply listening to a private conversation which may reveal information which can provide access to a facility or network."
        },
        {
            "word": "Echo Reply",
            "def": "Echo Reply \n An echo reply is the response a machine that has received an echo request sends over ICMP."
        },
        {
            "word": "Echo Request",
            "def": "Echo Request \n An echo request is an ICMP message sent to a machine to determine if it is online and how long traffic takes to get to it."
        },
        {
            "word": "Egress Filtering",
            "def": "Egress Filtering \n Filtering outbound traffic."
        },
        {
            "word": "Emanations Analysis",
            "def": "Emanations Analysis \n Gaining direct knowledge of communicated data by monitoring and resolving a signal that is emitted by a system and that contains the data but is not intended to communicate the data."
        },
        {
            "word": "Encapsulation",
            "def": "Encapsulation \n The inclusion of one data structure within another structure so that the first data structure is hidden for the time being."
        },
        {
            "word": "Encryption",
            "def": "Encryption \n Cryptographic transformation of data (called \"plaintext\") into a form (called \"cipher text\") that conceals the data's original meaning to prevent it from being known or used."
        },
        {
            "word": "Ephemeral Port",
            "def": "Ephemeral Port \n Also called a transient port or a temporary port. Usually is on the client side. It is set up when a client application wants to connect to a server and is destroyed when the client application terminates. It has a number chosen at random that is greater than 1023."
        },
        {
            "word": "Escrow Passwords",
            "def": "Escrow Passwords \n Escrow Passwords are passwords that are written down and stored in a secure location (like a safe) that are used by emergency personnel when privileged personnel are unavailable."
        },
        {
            "word": "Ethernet",
            "def": "Ethernet \n The most widely-installed LAN technology. Specified in a standard, IEEE 802.3, an Ethernet LAN typically uses coaxial cable or special grades of twisted pair wires. Devices are connected to the cable and compete for access using a CSMA/CD protocol."
        },
        {
            "word": "Event",
            "def": "Event \n An event is an observable occurrence in a system or network."
        },
        {
            "word": "Exponential Backoff Algorithm",
            "def": "Exponential Backoff Algorithm \n An exponential backoff algorithm is used to adjust TCP timeout values on the fly so that network devices don't continue to timeout sending data over saturated links."
        },
        {
            "word": "Exposure",
            "def": "Exposure \n A threat action whereby sensitive data is directly released to an unauthorized entity."
        },
        {
            "word": "Extended ACLs (Cisco)",
            "def": "Extended ACLs (Cisco) \n Extended ACLs are a more powerful form of Standard ACLs on Cisco routers. They can make filtering decisions based on IP addresses (source or destination), Ports (source or destination), protocols, and whether a session is established."
        },
        {
            "word": "Extensible Authentication Protocol (EAP)",
            "def": "Extensible Authentication Protocol (EAP) \n A framework that supports multiple, optional authentication mechanisms for PPP, including clear-text passwords, challenge-response, and arbitrary dialog sequences."
        },
        {
            "word": "Exterior Gateway Protocol (EGP)",
            "def": "Exterior Gateway Protocol (EGP) \n A protocol which distributes routing information to the routers which connect autonomous systems."
        },
        {
            "word": "False Rejects",
            "def": "False Rejects \n False Rejects are when an authentication system fails to recognize a valid user."
        },
        {
            "word": "Fast File System",
            "def": "Fast File System \n The first major revision to the Unix file system, providing faster read access and faster (delayed, asynchronous) write access through a disk cache and better file system layout on disk. It uses inodes (pointers) and data blocks."
        },
        {
            "word": "Fast Flux",
            "def": "Fast Flux \n Protection method used by botnets consisting of a continuous and fast change of the DNS records for a domain name through different IP addresses."
        },
        {
            "word": "Fault Line Attacks",
            "def": "Fault Line Attacks \n Fault Line Attacks use weaknesses between interfaces of systems to exploit gaps in coverage."
        },
        {
            "word": "File Transfer Protocol (FTP)",
            "def": "File Transfer Protocol (FTP) \n A TCP/IP protocol specifying the transfer of text or binary files across the network."
        },
        {
            "word": "Filter",
            "def": "Filter \n A filter is used to specify which packets will or will not be used. It can be used in sniffers to determine which packets get displayed, or by firewalls to determine which packets get blocked."
        },
        {
            "word": "Filtering Router",
            "def": "Filtering Router \n An inter-network router that selectively prevents the passage of data packets according to a security policy. A filtering router may be used as a firewall or part of a firewall. A router usually receives a packet from a network and decides where to forward it on a second network. A filtering router does the same, but first decides whether the packet should be forwarded at all, according to some security policy. The policy is implemented by rules (packet filters) loaded into the router."
        },
        {
            "word": "Finger",
            "def": "Finger \n A protocol to lookup user information on a given host. A Unix program that takes an e-mail address as input and returns information about the user who owns that e-mail address. On some systems, finger only reports whether the user is currently logged on. Other systems return additional information, such as the user's full name, address, and telephone number. Of course, the user must first enter this information into the system. Many e-mail programs now have a finger utility built into them."
        },
        {
            "word": "Fingerprinting",
            "def": "Fingerprinting \n Sending strange packets to a system in order to gauge how it responds to determine the operating system."
        },
        {
            "word": "Firewall",
            "def": "Firewall \n A logical or physical discontinuity in a network to prevent unauthorized access to data or resources."
        },
        {
            "word": "Flooding",
            "def": "Flooding \n An attack that attempts to cause a failure in (especially, in the security of) a computer system or other data processing entity by providing more input than the entity can process properly."
        },
        {
            "word": "Forest",
            "def": "Forest \n A forest is a set of Active Directory domains that replicate their databases with each other."
        },
        {
            "word": "Fork Bomb",
            "def": "Fork Bomb \n A Fork Bomb works by using the fork() call to create a new process which is a copy of the original. By doing this repeatedly, all available processes on the machine can be taken up."
        },
        {
            "word": "Form-Based Authentication",
            "def": "Form-Based Authentication \n Form-Based Authentication uses forms on a webpage to ask a user to input username and password information."
        },
        {
            "word": "Forward Lookup",
            "def": "Forward Lookup \n Forward lookup uses an Internet domain name to find an IP address"
        },
        {
            "word": "Forward Proxy",
            "def": "Forward Proxy \n Forward Proxies are designed to be the server through which all requests are made."
        },
        {
            "word": "Fragment Offset",
            "def": "Fragment Offset \n The fragment offset field tells the sender where a particular fragment falls in relation to other fragments in the original larger packet."
        },
        {
            "word": "Fragment Overlap Attack",
            "def": "Fragment Overlap Attack \n A TCP/IP Fragmentation Attack that is possible because IP allows packets to be broken down into fragments for more efficient transport across various media. The TCP packet (and its header) are carried in the IP packet. In this attack the second fragment contains incorrect offset. When packet is reconstructed, the port number will be overwritten."
        },
        {
            "word": "Fragmentation",
            "def": "Fragmentation \n The process of storing a data file in several \"chunks\" or fragments rather than in a single contiguous sequence of bits in one place on the storage medium."
        },
        {
            "word": "Frames",
            "def": "Frames \n Data that is transmitted between network points as a unit complete with addressing and necessary protocol control information. A frame is usually transmitted serial bit by bit and contains a header field and a trailer field that \"frame\" the data. (Some control frames contain no data.)"
        },
        {
            "word": "Full Duplex",
            "def": "Full Duplex \n A type of duplex communications channel which carries data in both directions at once. Refers to the transmission of data in two directions simultaneously. Communications in which both sender and receiver can send at the same time."
        },
        {
            "word": "Fully-Qualified Domain Name",
            "def": "Fully-Qualified Domain Name \n A Fully-Qualified Domain Name is a server name with a hostname followed by the full domain name."
        },
        {
            "word": "Fuzzing",
            "def": "Fuzzing \n The use of special regression testing tools to generate out-of-spec input for an application in order to find security vulnerabilities. Also see \"regression testing\"."
        },
        {
            "word": "Gateway",
            "def": "Gateway \n A network point that acts as an entrance to another network."
        },
        {
            "word": "gethostbyaddr",
            "def": "gethostbyaddr \n The gethostbyaddr DNS query is when the address of a machine is known and the name is needed."
        },
        {
            "word": "gethostbyname",
            "def": "gethostbyname \n The gethostbyname DNS quest is when the name of a machine is known and the address is needed."
        },
        {
            "word": "GNU",
            "def": "GNU \n GNU is a Unix-like operating system that comes with source code that can be copied, modified, and redistributed. The GNU project was started in 1983 by Richard Stallman and others, who formed the Free Software Foundation."
        },
        {
            "word": "Gnutella",
            "def": "Gnutella \n An Internet file sharing utility. Gnutella acts as a server for sharing files while simultaneously acting as a client that searches for and downloads files from other users."
        },
        {
            "word": "Hardening",
            "def": "Hardening \n Hardening is the process of identifying and fixing vulnerabilities on a system."
        },
        {
            "word": "Hash Function",
            "def": "Hash Function \n An algorithm that computes a value based on a data object thereby mapping the data object to a smaller data object."
        },
        {
            "word": "Hash Functions",
            "def": "Hash Functions \n (cryptographic) hash functions are used to generate a one way \"check sum\" for a larger text, which is not trivially reversed. The result of this hash function can be used to validate if a larger file has been altered, without having to compare the larger files to each other. Frequently used hash functions are MD5 and SHA1."
        },
        {
            "word": "Header",
            "def": "Header \n A header is the extra information in a packet that is needed for the protocol stack to process the packet."
        },
        {
            "word": "Hijack Attack",
            "def": "Hijack Attack \n A form of active wiretapping in which the attacker seizes control of a previously established communication association."
        },
        {
            "word": "Honey Client",
            "def": "Honey Client \n see Honeymonkey."
        },
        {
            "word": "Honey pot",
            "def": "Honey pot \n Programs that simulate one or more network services that you designate on your computer's ports. An attacker assumes you're running vulnerable services that can be used to break into the machine. A honey pot can be used to log access attempts to those ports including the attacker's keystrokes. This could give you advanced warning of a more concerted attack."
        },
        {
            "word": "Honeymonkey",
            "def": "Honeymonkey \n Automated system simulating a user browsing websites. The system is typically configured to detect web sites which exploit vulnerabilities in the browser. Also known as Honey Client."
        },
        {
            "word": "Hops",
            "def": "Hops \n A hop is each exchange with a gateway a packet takes on its way to the destination."
        },
        {
            "word": "Host",
            "def": "Host \n Any computer that has full two-way access to other computers on the Internet. Or a computer with a web server that serves the pages for one or more Web sites."
        },
        {
            "word": "Host-Based ID",
            "def": "Host-Based ID \n Host-based intrusion detection systems use information from the operating system audit records to watch all operations occurring on the host that the intrusion detection software has been installed upon. These operations are then compared with a pre-defined security policy. This analysis of the audit trail imposes potentially significant overhead requirements on the system because of the increased amount of processing power which must be utilized by the intrusion detection system. Depending on the size of the audit trail and the processing ability of the system, the review of audit data could result in the loss of a real-time analysis capability."
        },
        {
            "word": "HTTP Proxy",
            "def": "HTTP Proxy \n An HTTP Proxy is a server that acts as a middleman in the communication between HTTP clients and servers."
        },
        {
            "word": "HTTPS",
            "def": "HTTPS \n When used in the first part of a URL (the part that precedes the colon and specifies an access scheme or protocol), this term specifies the use of HTTP enhanced by a security mechanism, which is usually SSL."
        },
        {
            "word": "Hub",
            "def": "Hub \n A hub is a network device that operates by repeating data that it receives on one port to all the other ports. As a result, data transmitted by one host is retransmitted to all other hosts on the hub."
        },
        {
            "word": "Hybrid Attack",
            "def": "Hybrid Attack \n A Hybrid Attack builds on the dictionary attack method by adding numerals and symbols to dictionary words."
        },
        {
            "word": "Hybrid Encryption",
            "def": "Hybrid Encryption \n An application of cryptography that combines two or more encryption algorithms, particularly a combination of symmetric and asymmetric encryption."
        },
        {
            "word": "Hyperlink",
            "def": "Hyperlink \n In hypertext or hypermedia, an information object (such as a word, a phrase, or an image; usually highlighted by color or underscoring) that points (indicates how to connect) to related information that is located elsewhere and can be retrieved by activating the link."
        },
        {
            "word": "Hypertext Markup Language (HTML)",
            "def": "Hypertext Markup Language (HTML) \n The set of markup symbols or codes inserted in a file intended for display on a World Wide Web browser page."
        },
        {
            "word": "Hypertext Transfer Protocol (HTTP)",
            "def": "Hypertext Transfer Protocol (HTTP) \n The protocol in the Internet Protocol (IP) family used to transport hypertext documents across an internet."
        },
        {
            "word": "Identity",
            "def": "Identity \n Identity is whom someone or what something is, for example, the name by which something is known."
        },
        {
            "word": "Incident",
            "def": "Incident \n An incident as an adverse network event in an information system or network or the threat of the occurrence of such an event."
        },
        {
            "word": "Incident Handling",
            "def": "Incident Handling \n Incident Handling is an action plan for dealing with intrusions, cyber-theft, denial of service, fire, floods, and other security-related events. It is comprised of a six step process: Preparation, Identification, Containment, Eradication, Recovery, and Lessons Learned."
        },
        {
            "word": "Incremental Backups",
            "def": "Incremental Backups \n Incremental backups only backup the files that have been modified since the last backup. If dump levels are used, incremental backups only backup files changed since last backup of a lower dump level."
        },
        {
            "word": "Inetd (xinetd)",
            "def": "Inetd (xinetd) \n Inetd (or Internet Daemon) is an application that controls smaller internet services like telnet, ftp, and POP."
        },
        {
            "word": "Inference Attack",
            "def": "Inference Attack \n Inference Attacks rely on the user to make logical connections between seemingly unrelated pieces of information."
        },
        {
            "word": "Information Warfare",
            "def": "Information Warfare \n Information Warfare is the competition between offensive and defensive players over information resources."
        },
        {
            "word": "Ingress Filtering",
            "def": "Ingress Filtering \n Ingress Filtering is filtering inbound traffic."
        },
        {
            "word": "Input Validation Attacks",
            "def": "Input Validation Attacks \n Input Validations Attacks are where an attacker intentionally sends unusual input in the hopes of confusing an application."
        },
        {
            "word": "Integrity",
            "def": "Integrity \n Integrity is the need to ensure that information has not been changed accidentally or deliberately, and that it is accurate and complete."
        },
        {
            "word": "Integrity Star Property",
            "def": "Integrity Star Property \n In Integrity Star Property a user cannot read data of a lower integrity level then their own."
        },
        {
            "word": "Internet",
            "def": "Internet \n A term to describe connecting multiple separate networks together."
        },
        {
            "word": "Internet Control Message Protocol (ICMP)",
            "def": "Internet Control Message Protocol (ICMP) \n An Internet Standard protocol that is used to report error conditions during IP datagram processing and to exchange other information concerning the state of the IP network."
        },
        {
            "word": "Internet Engineering Task Force (IETF)",
            "def": "Internet Engineering Task Force (IETF) \n The body that defines standard Internet operating protocols such as TCP/IP. The IETF is supervised by the Internet Society Internet Architecture Board (IAB). IETF members are drawn from the Internet Society's individual and organization membership."
        },
        {
            "word": "Internet Message Access Protocol (IMAP)",
            "def": "Internet Message Access Protocol (IMAP) \n A protocol that defines how a client should fetch mail from and return mail to a mail server. IMAP is intended as a replacement for or extension to the Post Office Protocol (POP). It is defined in RFC 1203 (v3) and RFC 2060 (v4)."
        },
        {
            "word": "Internet Protocol (IP)",
            "def": "Internet Protocol (IP) \n The method or protocol by which data is sent from one computer to another on the Internet."
        },
        {
            "word": "Internet Protocol Security (IPsec)",
            "def": "Internet Protocol Security (IPsec) \n A developing standard for security at the network or packet processing layer of network communication."
        },
        {
            "word": "Internet Standard",
            "def": "Internet Standard \n A specification, approved by the IESG and published as an RFC, that is stable and well-understood, is technically competent, has multiple, independent, and interoperable implementations with substantial operational experience, enjoys significant public support, and is recognizably useful in some or all parts of the Internet."
        },
        {
            "word": "Interrupt",
            "def": "Interrupt \n An Interrupt is a signal that informs the OS that something has occurred."
        },
        {
            "word": "Intranet",
            "def": "Intranet \n A computer network, especially one based on Internet technology, that an organization uses for its own internal, and usually private, purposes and that is closed to outsiders."
        },
        {
            "word": "Intrusion Detection",
            "def": "Intrusion Detection \n A security management system for computers and networks. An IDS gathers and analyzes information from various areas within a computer or a network to identify possible security breaches, which include both intrusions (attacks from outside the organization) and misuse (attacks from within the organization)."
        },
        {
            "word": "IP Address",
            "def": "IP Address \n A computer's inter-network address that is assigned for use by the Internet Protocol and other protocols. An IP version 4 address is written as a series of four 8-bit numbers separated by periods."
        },
        {
            "word": "IP Flood",
            "def": "IP Flood \n A denial of service attack that sends a host more echo request (\"ping\") packets than the protocol implementation can handle."
        },
        {
            "word": "IP Forwarding",
            "def": "IP Forwarding \n IP forwarding is an Operating System option that allows a host to act as a router. A system that has more than 1 network interface card must have IP forwarding turned on in order for the system to be able to act as a router."
        },
        {
            "word": "IP Spoofing",
            "def": "IP Spoofing \n The technique of supplying a false IP address."
        },
        {
            "word": "ISO",
            "def": "ISO \n International Organization for Standardization, a voluntary, non-treaty, non-government organization, established in 1947, with voting members that are designated standards bodies of participating nations and non-voting observer organizations."
        },
        {
            "word": "Issue-Specific Policy",
            "def": "Issue-Specific Policy \n An Issue-Specific Policy is intended to address specific needs within an organization, such as a password policy."
        },
        {
            "word": "ITU-T",
            "def": "ITU-T \n International Telecommunications Union, Telecommunication Standardization Sector (formerly \"CCITT\"), a United Nations treaty organization that is composed mainly of postal, telephone, and telegraph authorities of the member countries and that publishes standards called \"Recommendations.\""
        },
        {
            "word": "Jitter",
            "def": "Jitter \n Jitter or Noise is the modification of fields in a database while preserving the aggregate characteristics of that make the database useful in the first place."
        },
        {
            "word": "Jump Bag",
            "def": "Jump Bag \n A Jump Bag is a container that has all the items necessary to respond to an incident inside to help mitigate the effects of delayed reactions."
        },
        {
            "word": "Kerberos",
            "def": "Kerberos \n A system developed at the Massachusetts Institute of Technology that depends on passwords and symmetric cryptography (DES) to implement ticket-based, peer entity authentication service and access control service distributed in a client-server network environment."
        },
        {
            "word": "Kernel",
            "def": "Kernel \n The essential center of a computer operating system, the core that provides basic services for all other parts of the operating system. A synonym is nucleus. A kernel can be contrasted with a shell, the outermost part of an operating system that interacts with user commands. Kernel and shell are terms used more frequently in Unix and some other operating systems than in IBM mainframe systems."
        },
        {
            "word": "Lattice Techniques",
            "def": "Lattice Techniques \n Lattice Techniques use security designations to determine access to information."
        },
        {
            "word": "Layer 2 Forwarding Protocol (L2F)",
            "def": "Layer 2 Forwarding Protocol (L2F) \n An Internet protocol (originally developed by Cisco Corporation) that uses tunneling of PPP over IP to create a virtual extension of a dial-up link across a network, initiated by the dial-up server and transparent to the dial-up user."
        },
        {
            "word": "Layer 2 Tunneling Protocol (L2TP)",
            "def": "Layer 2 Tunneling Protocol (L2TP) \n An extension of the Point-to-Point Tunneling Protocol used by an Internet service provider to enable the operation of a virtual private network over the Internet."
        },
        {
            "word": "Least Privilege",
            "def": "Least Privilege \n Least Privilege is the principle of allowing users or applications the least amount of permissions necessary to perform their intended function."
        },
        {
            "word": "Legion",
            "def": "Legion \n Software to detect unprotected shares."
        },
        {
            "word": "Lightweight Directory Access Protocol (LDAP)",
            "def": "Lightweight Directory Access Protocol (LDAP) \n A software protocol for enabling anyone to locate organizations, individuals, and other resources such as files and devices in a network, whether on the public Internet or on a corporate Intranet."
        },
        {
            "word": "Link State",
            "def": "Link State \n With link state, routes maintain information about all routers and router-to-router links within a geographic area, and creates a table of best routes with that information."
        },
        {
            "word": "List Based Access Control",
            "def": "List Based Access Control \n List Based Access Control associates a list of users and their privileges with each object."
        },
        {
            "word": "Loadable Kernel Modules (LKM)",
            "def": "Loadable Kernel Modules (LKM) \n Loadable Kernel Modules allow for the adding of additional functionality directly into the kernel while the system is running."
        },
        {
            "word": "Log Clipping",
            "def": "Log Clipping \n Log clipping is the selective removal of log entries from a system log to hide a compromise."
        },
        {
            "word": "Logic bombs",
            "def": "Logic bombs \n Logic bombs are programs or snippets of code that execute when a certain predefined event occurs. Logic bombs may also be set to go off on a certain date or when a specified set of circumstances occurs."
        },
        {
            "word": "Logic Gate",
            "def": "Logic Gate \n A logic gate is an elementary building block of a digital circuit. Most logic gates have two inputs and one output. As digital circuits can only understand binary, inputs and outputs can assume only one of two states, 0 or 1."
        },
        {
            "word": "Loopback Address",
            "def": "Loopback Address \n The loopback address (127.0.0.1) is a pseudo IP address that always refer back to the local host and are never sent out onto a network."
        },
        {
            "word": "MAC Address",
            "def": "MAC Address \n A physical address; a numeric value that uniquely identifies that network device from every other device on the planet."
        },
        {
            "word": "Malicious Code",
            "def": "Malicious Code \n Software (e.g., Trojan horse) that appears to perform a useful or desirable function, but actually gains unauthorized access to system resources or tricks a user into executing other malicious logic."
        },
        {
            "word": "Malware",
            "def": "Malware \n A generic term for a number of different types of malicious code."
        },
        {
            "word": "Mandatory Access Control (MAC)",
            "def": "Mandatory Access Control (MAC) \n Mandatory Access Control controls is where the system controls access to resources based on classification levels assigned to both the objects and the users. These controls cannot be changed by anyone."
        },
        {
            "word": "Masquerade Attack",
            "def": "Masquerade Attack \n A type of attack in which one system entity illegitimately poses as (assumes the identity of) another entity."
        },
        {
            "word": "md5",
            "def": "md5 \n A one way cryptographic hash function. Also see \"hash functions\" and \"sha1\""
        },
        {
            "word": "Measures of Effectiveness (MOE)",
            "def": "Measures of Effectiveness (MOE) \n Measures of Effectiveness is a probability model based on engineering concepts that allows one to approximate the impact a give action will have on an environment. In Information warfare it is the ability to attack or defend within an Internet environment."
        },
        {
            "word": "Monoculture",
            "def": "Monoculture \n Monoculture is the case where a large number of users run the same software, and are vulnerable to the same attacks."
        },
        {
            "word": "Morris Worm",
            "def": "Morris Worm \n A worm program written by Robert T. Morris, Jr. that flooded the ARPANET in November, 1988, causing problems for thousands of hosts."
        },
        {
            "word": "Multi-Cast",
            "def": "Multi-Cast \n Broadcasting from one host to a given set of hosts."
        },
        {
            "word": "Multi-Homed",
            "def": "Multi-Homed \n You are \"multi-homed\" if your network is directly connected to two or more ISP's."
        },
        {
            "word": "Multiplexing",
            "def": "Multiplexing \n To combine multiple signals from possibly disparate sources, in order to transmit them over a single path."
        },
        {
            "word": "National Institute of Standards and Technology (NIST)",
            "def": "National Institute of Standards and Technology (NIST) \n National Institute of Standards and Technology, a unit of the US Commerce Department. Formerly known as the National Bureau of Standards, NIST promotes and maintains measurement standards. It also has active programs for encouraging and assisting industry and science to develop and use these standards."
        },
        {
            "word": "Natural Disaster",
            "def": "Natural Disaster \n Any \"act of God\" (e.g., fire, flood, earthquake, lightning, or wind) that disables a system component."
        },
        {
            "word": "Netmask",
            "def": "Netmask \n 32-bit number indicating the range of IP addresses residing on a single IP network/subnet/supernet. This specification displays network masks as hexadecimal numbers. For example, the network mask for a class C IP network is displayed as 0xffffff00. Such a mask is often displayed elsewhere in the literature as 255.255.255.0."
        },
        {
            "word": "Network Address Translation",
            "def": "Network Address Translation \n The translation of an Internet Protocol address used within one network to a different IP address known within another network. One network is designated the inside network and the other is the outside."
        },
        {
            "word": "Network Mapping",
            "def": "Network Mapping \n To compile an electronic inventory of the systems and the services on your network."
        },
        {
            "word": "Network Taps",
            "def": "Network Taps \n Network taps are hardware devices that hook directly onto the network cable and send a copy of the traffic that passes through it to one or more other networked devices."
        },
        {
            "word": "Network-Based IDS",
            "def": "Network-Based IDS \n A network-based IDS system monitors the traffic on its network segment as a data source. This is generally accomplished by placing the network interface card in promiscuous mode to capture all network traffic that crosses its network segment. Network traffic on other segments, and traffic on other means of communication (like phone lines) can't be monitored. Network-based IDS involves looking at the packets on the network as they pass by some sensor. The sensor can only see the packets that happen to be carried on the network segment it's attached to. Packets are considered to be of interest if they match a signature.Network-based intrusion detection passively monitors network activity for indications of attacks. Network monitoring offers several advantages over traditional host-based intrusion detection systems. Because many intrusions occur over networks at some point, and because networks are increasingly becoming the targets of attack, these techniques are an excellent method of detecting many attacks which may be missed by host-based intrusion detection mechanisms."
        },
        {
            "word": "Non-Printable Character",
            "def": "Non-Printable Character \n A character that doesn't have a corresponding character letter to its corresponding ASCII code. Examples would be the Linefeed, which is ASCII character code 10 decimal, the Carriage Return, which is 13 decimal, or the bell sound, which is decimal 7. On a PC, you can often add non-printable characters by holding down the Alt key, and typing in the decimal value (i.e., Alt-007 gets you a bell). There are other character encoding schemes, but ASCII is the most prevalent."
        },
        {
            "word": "Non-Repudiation",
            "def": "Non-Repudiation \n Non-repudiation is the ability for a system to prove that a specific user and only that specific user sent a message and that it hasn't been modified."
        },
        {
            "word": "Null Session",
            "def": "Null Session \n Known as Anonymous Logon, it is a way of letting an anonymous user retrieve information such as user names and shares over the network or connect without authentication. It is used by applications such as explorer.exe to enumerate shares on remote servers."
        },
        {
            "word": "Octet",
            "def": "Octet \n A sequence of eight bits. An octet is an eight-bit byte."
        },
        {
            "word": "One-Way Encryption",
            "def": "One-Way Encryption \n Irreversible transformation of plaintext to cipher text, such that the plaintext cannot be recovered from the cipher text by other than exhaustive procedures even if the cryptographic key is known."
        },
        {
            "word": "One-Way Function",
            "def": "One-Way Function \n A (mathematical) function, f, which is easy to compute the output based on a given input. However given only the output value it is impossible (except for a brute force attack) to figure out what the input value is."
        },
        {
            "word": "Open Shortest Path First (OSPF)",
            "def": "Open Shortest Path First (OSPF) \n Open Shortest Path First is a link state routing algorithm used in interior gateway routing. Routers maintain a database of all routers in the autonomous system with links between the routers, link costs, and link states (up and down)."
        },
        {
            "word": "OSI",
            "def": "OSI \n OSI (Open Systems Interconnection) is a standard description or \"reference model\" for how messages should be transmitted between any two points in a telecommunication network. Its purpose is to guide product implementers so that their products will consistently work with other products. The reference model defines seven layers of functions that take place at each end of a communication. Although OSI is not always strictly adhered to in terms of keeping related functions together in a well-defined layer, many if not most products involved in telecommunication make an attempt to describe themselves in relation to the OSI model. It is also valuable as a single reference view of communication that furnishes everyone a common ground for education and discussion."
        },
        {
            "word": "OSI layers",
            "def": "OSI layers \n The main idea in OSI is that the process of communication between two end points in a telecommunication network can be divided into layers, with each layer adding its own set of special, related functions. Each communicating user or program is at a computer equipped with these seven layers of function. So, in a given message between users, there will be a flow of data through each layer at one end down through the layers in that computer and, at the other end, when the message arrives, another flow of data up through the layers in the receiving computer and ultimately to the end user or program. The actual programming and hardware that furnishes these seven layers of function is usually a combination of the computer operating system, applications (such as your Web browser), TCP/IP or alternative transport and network protocols, and the software and hardware that enable you to put a signal on one of the lines attached to your computer. OSI divides telecommunication into seven layers. The layers are in two groups. The upper four layers are used whenever a message passes from or to a user. The lower three layers (up to the network layer) are used when any message passes through the host computer or router. Messages intended for this computer pass to the upper layers. Messages destined for some other host are not passed up to the upper layers but are forwarded to another host. The seven layers are: Layer 7: The application layer...This is the layer at which communication partners are identified, quality of service is identified, user authentication and privacy are considered, and any constraints on data syntax are identified. (This layer is not the application itself, although some applications may perform application layer functions.) Layer 6: The presentation layer...This is a layer, usually part of an operating system, that converts incoming and outgoing data from one presentation format to another (for example, from a text stream into a popup window with the newly arrived text). Sometimes called the syntax layer. Layer 5: The session layer...This layer sets up, coordinates, and terminates conversations, exchanges, and dialogs between the applications at each end. It deals with session and connection coordination. Layer 4: The transport layer...This layer manages the end-to-end control (for example, determining whether all packets have arrived) and error-checking. It ensures complete data transfer. Layer 3: The network layer...This layer handles the routing of the data (sending it in the right direction to the right destination on outgoing transmissions and receiving incoming transmissions at the packet level). The network layer does routing and forwarding. Layer 2: The data-link layer...This layer provides synchronization for the physical level and does bit-stuffing for strings of 1's in excess of 5. It furnishes transmission protocol knowledge and management. Layer 1: The physical layer...This layer conveys the bit stream through the network at the electrical and mechanical level. It provides the hardware means of sending and receiving data on a carrier."
        },
        {
            "word": "Overload",
            "def": "Overload \n Hindrance of system operation by placing excess burden on the performance capabilities of a system component."
        },
        {
            "word": "Packet",
            "def": "Packet \n A piece of a message transmitted over a packet-switching network. One of the key features of a packet is that it contains the destination address in addition to the data. In IP networks, packets are often called datagrams."
        },
        {
            "word": "Packet Switched Network",
            "def": "Packet Switched Network \n A packet switched network is where individual packets each follow their own paths through the network from one endpoint to another."
        },
        {
            "word": "Partitions",
            "def": "Partitions \n Major divisions of the total physical hard disk space."
        },
        {
            "word": "Password Authentication Protocol (PAP)",
            "def": "Password Authentication Protocol (PAP) \n Password Authentication Protocol is a simple, weak authentication mechanism where a user enters the password and it is then sent across the network, usually in the clear."
        },
        {
            "word": "Password Cracking",
            "def": "Password Cracking \n Password cracking is the process of attempting to guess passwords, given the password file information."
        },
        {
            "word": "Password Sniffing",
            "def": "Password Sniffing \n Passive wiretapping, usually on a local area network, to gain knowledge of passwords."
        },
        {
            "word": "Patch",
            "def": "Patch \n A patch is a small update released by a software manufacturer to fix bugs in existing programs."
        },
        {
            "word": "Patching",
            "def": "Patching \n Patching is the process of updating software to a different version."
        },
        {
            "word": "Payload",
            "def": "Payload \n Payload is the actual application data a packet contains."
        },
        {
            "word": "Penetration",
            "def": "Penetration \n Gaining unauthorized logical access to sensitive data by circumventing a system's protections."
        },
        {
            "word": "Penetration Testing",
            "def": "Penetration Testing \n Penetration testing is used to test the external perimeter security of a network or facility."
        },
        {
            "word": "Permutation",
            "def": "Permutation \n Permutation keeps the same letters but changes the position within a text to scramble the message."
        },
        {
            "word": "Personal Firewalls",
            "def": "Personal Firewalls \n Personal firewalls are those firewalls that are installed and run on individual PCs."
        },
        {
            "word": "pharming",
            "def": "pharming \n This is a more sophisticated form of MITM attack. A user's session is redirected to a masquerading website. This can be achieved by corrupting a DNS server on the Internet and pointing a URL to the masquerading website's IP. Almost all users use a URL like www.worldbank.com instead of the real IP (192.86.99.140) of the website. Changing the pointers on a DNS server, the URL can be redirected to send traffic to the IP of the pseudo website. At the pseudo website, transactions can be mimicked and information like login credentials can be gathered. With this the attacker can access the real www.worldbank.com site and conduct transactions using the credentials of a valid user on that website."
        },
        {
            "word": "Phishing",
            "def": "Phishing \n The use of e-mails that appear to originate from a trusted source to trick a user into entering valid credentials at a fake website. Typically the e-mail and the web site looks like they are part of a bank the user is doing business with."
        },
        {
            "word": "Ping of Death",
            "def": "Ping of Death \n An attack that sends an improperly large ICMP echo request packet (a \"ping\") with the intent of overflowing the input buffers of the destination machine and causing it to crash."
        },
        {
            "word": "Ping Scan",
            "def": "Ping Scan \n A ping scan looks for machines that are responding to ICMP Echo Requests."
        },
        {
            "word": "Ping Sweep",
            "def": "Ping Sweep \n An attack that sends ICMP echo requests (\"pings\") to a range of IP addresses, with the goal of finding hosts that can be probed for vulnerabilities."
        },
        {
            "word": "Plaintext",
            "def": "Plaintext \n Ordinary readable text before being encrypted into ciphertext or after being decrypted."
        },
        {
            "word": "Point-to-Point Protocol (PPP)",
            "def": "Point-to-Point Protocol (PPP) \n A protocol for communication between two computers using a serial interface, typically a personal computer connected by phone line to a server. It packages your computer's TCP/IP packets and forwards them to the server where they can actually be put on the Internet."
        },
        {
            "word": "Point-to-Point Tunneling Protocol (PPTP)",
            "def": "Point-to-Point Tunneling Protocol (PPTP) \n A protocol (set of communication rules) that allows corporations to extend their own corporate network through private \"tunnels\" over the public Internet."
        },
        {
            "word": "Poison Reverse",
            "def": "Poison Reverse \n Split horizon with poisoned reverse (more simply, poison reverse) does include such routes in updates, but sets their metrics to infinity. In effect, advertising the fact that there routes are not reachable."
        },
        {
            "word": "Polyinstantiation",
            "def": "Polyinstantiation \n Polyinstantiation is the ability of a database to maintain multiple records with the same key. It is used to prevent inference attacks."
        },
        {
            "word": "Polymorphism",
            "def": "Polymorphism \n Polymorphism is the process by which malicious software changes its underlying code to avoid detection."
        },
        {
            "word": "Port",
            "def": "Port \n A port is nothing more than an integer that uniquely identifies an endpoint of a communication stream. Only one process per machine can listen on the same port number."
        },
        {
            "word": "Port Scan",
            "def": "Port Scan \n A port scan is a series of messages sent by someone attempting to break into a computer to learn which computer network services, each associated with a \"well-known\" port number, the computer provides. Port scanning, a favorite approach of computer cracker, gives the assailant an idea where to probe for weaknesses. Essentially, a port scan consists of sending a message to each port, one at a time. The kind of response received indicates whether the port is used and can therefore be probed for weakness."
        },
        {
            "word": "Possession",
            "def": "Possession \n Possession is the holding, control, and ability to use information."
        },
        {
            "word": "Post Office Protocol, Version 3 (POP3)",
            "def": "Post Office Protocol, Version 3 (POP3) \n An Internet Standard protocol by which a client workstation can dynamically access a mailbox on a server host to retrieve mail messages that the server has received and is holding for the client."
        },
        {
            "word": "Practical Extraction and Reporting Language (Perl)",
            "def": "Practical Extraction and Reporting Language (Perl) \n A script programming language that is similar in syntax to the C language and that includes a number of popular Unix facilities such as sed, awk, and tr."
        },
        {
            "word": "Preamble",
            "def": "Preamble \n A preamble is a signal used in network communications to synchronize the transmission timing between two or more systems. Proper timing ensures that all systems are interpreting the start of the information transfer correctly. A preamble defines a specific series of transmission pulses that is understood by communicating systems to mean \"someone is about to transmit data\". This ensures that systems receiving the information correctly interpret when the data transmission starts. The actual pulses used as a preamble vary depending on the network communication technology in use."
        },
        {
            "word": "Pretty Good Privacy (PGP)TM",
            "def": "Pretty Good Privacy (PGP)TM \n Trademark of Network Associates, Inc., referring to a computer program (and related protocols) that uses cryptography to provide data security for electronic mail and other applications on the Internet."
        },
        {
            "word": "Private Addressing",
            "def": "Private Addressing \n IANA has set aside three address ranges for use by private or non-Internet connected networks. This is referred to as Private Address Space and is defined in RFC 1918. The reserved address blocks are: 10.0.0.0 to 10.255.255.255 (10/8 prefix) 172.16.0.0 to 172.31.255.255 (172.16/12 prefix) 192.168.0.0 to 192.168.255.255 (192.168/16 prefix)"
        },
        {
            "word": "Program Infector",
            "def": "Program Infector \n A program infector is a piece of malware that attaches itself to existing program files."
        },
        {
            "word": "Program Policy",
            "def": "Program Policy \n A program policy is a high-level policy that sets the overall tone of an organization's security approach."
        },
        {
            "word": "Promiscuous Mode",
            "def": "Promiscuous Mode \n When a machine reads all packets off the network, regardless of who they are addressed to. This is used by network administrators to diagnose network problems, but also by unsavory characters who are trying to eavesdrop on network traffic (which might contain passwords or other information)."
        },
        {
            "word": "Proprietary Information",
            "def": "Proprietary Information \n Proprietary information is that information unique to a company and its ability to compete, such as customer lists, technical data, product costs, and trade secrets."
        },
        {
            "word": "Protocol",
            "def": "Protocol \n A formal specification for communicating; an IP address the special set of rules that end points in a telecommunication connection use when they communicate. Protocols exist at several levels in a telecommunication connection."
        },
        {
            "word": "Protocol Stacks (OSI)",
            "def": "Protocol Stacks (OSI) \n A set of network protocol layers that work together."
        },
        {
            "word": "Proxy Server",
            "def": "Proxy Server \n A server that acts as an intermediary between a workstation user and the Internet so that the enterprise can ensure security, administrative control, and caching service. A proxy server is associated with or part of a gateway server that separates the enterprise network from the outside network and a firewall server that protects the enterprise network from outside intrusion."
        },
        {
            "word": "Public Key",
            "def": "Public Key \n The publicly-disclosed component of a pair of cryptographic keys used for asymmetric cryptography."
        },
        {
            "word": "Public Key Encryption",
            "def": "Public Key Encryption \n The popular synonym for \"asymmetric cryptography\"."
        },
        {
            "word": "Public Key Infrastructure (PKI)",
            "def": "Public Key Infrastructure (PKI) \n A PKI (public key infrastructure) enables users of a basically unsecured public network such as the Internet to securely and privately exchange data and money through the use of a public and a private cryptographic key pair that is obtained and shared through a trusted authority. The public key infrastructure provides for a digital certificate that can identify an individual or an organization and directory services that can store and, when necessary, revoke the certificates."
        },
        {
            "word": "Public-Key Forward Secrecy (PFS)",
            "def": "Public-Key Forward Secrecy (PFS) \n For a key agreement protocol based on asymmetric cryptography, the property that ensures that a session key derived from a set of long-term public and private keys will not be compromised if one of the private keys is compromised in the future."
        },
        {
            "word": "QAZ",
            "def": "QAZ \n A network worm."
        },
        {
            "word": "Race Condition",
            "def": "Race Condition \n A race condition exploits the small window of time between a security control being applied and when the service is used."
        },
        {
            "word": "Radiation Monitoring",
            "def": "Radiation Monitoring \n Radiation monitoring is the process of receiving images, data, or audio from an unprotected source by listening to radiation signals."
        },
        {
            "word": "Ransomware",
            "def": "Ransomware \n A type of malware that is a form of extortion. It works by encrypting a victim's hard drive denying them access to key files. The victim must then pay a ransom to decrypt the files and gain access to them again."
        },
        {
            "word": "Reconnaissance",
            "def": "Reconnaissance \n Reconnaissance is the phase of an attack where an attackers finds new systems, maps out networks, and probes for specific, exploitable vulnerabilities."
        },
        {
            "word": "Reflexive ACLs (Cisco)",
            "def": "Reflexive ACLs (Cisco) \n Reflexive ACLs for Cisco routers are a step towards making the router act like a stateful firewall. The router will make filtering decisions based on whether connections are a part of established traffic or not."
        },
        {
            "word": "Registry",
            "def": "Registry \n The Registry in Windows operating systems in the central set of settings and information required to run the Windows computer."
        },
        {
            "word": "regression analysis",
            "def": "regression analysis \n The use of scripted tests which are used to test software for all possible input is should expect. Typically developers will create a set of regression tests that are executed before a new version of a software is released. Also see \"fuzzing\"."
        },
        {
            "word": "Request for Comment (RFC)",
            "def": "Request for Comment (RFC) \n A series of notes about the Internet, started in 1969 (when the Internet was the ARPANET). An Internet Document can be submitted to the IETF by anyone, but the IETF decides if the document becomes an RFC. Eventually, if it gains enough interest, it may evolve into an Internet standard."
        },
        {
            "word": "Resource Exhaustion",
            "def": "Resource Exhaustion \n Resource exhaustion attacks involve tying up finite resources on a system, making them unavailable to others."
        },
        {
            "word": "Response",
            "def": "Response \n A response is information sent that is responding to some stimulus."
        },
        {
            "word": "Reverse Address Resolution Protocol (RARP)",
            "def": "Reverse Address Resolution Protocol (RARP) \n RARP (Reverse Address Resolution Protocol) is a protocol by which a physical machine in a local area network can request to learn its IP address from a gateway server's Address Resolution Protocol table or cache. A network administrator creates a table in a local area network's gateway router that maps the physical machine (or Media Access Control - MAC address) addresses to corresponding Internet Protocol addresses. When a new machine is set up, its RARP client program requests from the RARP server on the router to be sent its IP address. Assuming that an entry has been set up in the router table, the RARP server will return the IP address to the machine which can store it for future use."
        },
        {
            "word": "Reverse Engineering",
            "def": "Reverse Engineering \n Acquiring sensitive data by disassembling and analyzing the design of a system component."
        },
        {
            "word": "Reverse Lookup",
            "def": "Reverse Lookup \n Find out the hostname that corresponds to a particular IP address. Reverse lookup uses an IP (Internet Protocol) address to find a domain name."
        },
        {
            "word": "Reverse Proxy",
            "def": "Reverse Proxy \n Reverse proxies take public HTTP requests and pass them to back-end webservers to send the content to it, so the proxy can then send the content to the end-user."
        },
        {
            "word": "Risk",
            "def": "Risk \n Risk is the product of the level of threat with the level of vulnerability. It establishes the likelihood of a successful attack."
        },
        {
            "word": "Risk Assessment",
            "def": "Risk Assessment \n A Risk Assessment is the process by which risks are identified and the impact of those risks determined."
        },
        {
            "word": "Risk Averse",
            "def": "Risk Averse \n Avoiding risk even if this leads to the loss of opportunity. For example, using a (more expensive) phone call vs. sending an e-mail in order to avoid risks associated with e-mail may be considered \"Risk Averse\""
        },
        {
            "word": "Rivest-Shamir-Adleman (RSA)",
            "def": "Rivest-Shamir-Adleman (RSA) \n An algorithm for asymmetric cryptography, invented in 1977 by Ron Rivest, Adi Shamir, and Leonard Adleman."
        },
        {
            "word": "Role Based Access Control",
            "def": "Role Based Access Control \n Role based access control assigns users to roles based on their organizational functions and determines authorization based on those roles."
        },
        {
            "word": "Root",
            "def": "Root \n Root is the name of the administrator account in Unix systems."
        },
        {
            "word": "Rootkit",
            "def": "Rootkit \n A collection of tools (programs) that a hacker uses to mask intrusion and obtain administrator-level access to a computer or computer network."
        },
        {
            "word": "Router",
            "def": "Router \n Routers interconnect logical networks by forwarding information to other networks based upon IP addresses."
        },
        {
            "word": "Routing Information Protocol (RIP)",
            "def": "Routing Information Protocol (RIP) \n Routing Information Protocol is a distance vector protocol used for interior gateway routing which uses hop count as the sole metric of a path's cost."
        },
        {
            "word": "Routing Loop",
            "def": "Routing Loop \n A routing loop is where two or more poorly configured routers repeatedly exchange the same packet over and over."
        },
        {
            "word": "RPC Scans",
            "def": "RPC Scans \n RPC scans determine which RPC services are running on a machine."
        },
        {
            "word": "Rule Set Based Access Control (RSBAC)",
            "def": "Rule Set Based Access Control (RSBAC) \n Rule Set Based Access Control targets actions based on rules for entities operating on objects."
        },
        {
            "word": "S/Key",
            "def": "S/Key \n A security mechanism that uses a cryptographic hash function to generate a sequence of 64-bit, one-time passwords for remote user login. The client generates a one-time password by applying the MD4 cryptographic hash function multiple times to the user's secret key. For each successive authentication of the user, the number of hash applications is reduced by one."
        },
        {
            "word": "Safety",
            "def": "Safety \n Safety is the need to ensure that the people involved with the company, including employees, customers, and visitors, are protected from harm."
        },
        {
            "word": "Scavenging",
            "def": "Scavenging \n Searching through data residue in a system to gain unauthorized knowledge of sensitive data."
        },
        {
            "word": "Secure Electronic Transactions (SET)",
            "def": "Secure Electronic Transactions (SET) \n Secure Electronic Transactions is a protocol developed for credit card transactions in which all parties (customers, merchant, and bank) are authenticated using digital signatures, encryption protects the message and provides integrity, and provides end-to-end security for credit card transactions online."
        },
        {
            "word": "Secure Shell (SSH)",
            "def": "Secure Shell (SSH) \n A program to log into another computer over a network, to execute commands in a remote machine, and to move files from one machine to another."
        },
        {
            "word": "Secure Sockets Layer (SSL)",
            "def": "Secure Sockets Layer (SSL) \n A protocol developed by Netscape for transmitting private documents via the Internet. SSL works by using a public key to encrypt data that's transferred over the SSL connection."
        },
        {
            "word": "Security Policy",
            "def": "Security Policy \n A set of rules and practices that specify or regulate how a system or organization provides security services to protect sensitive and critical system resources."
        },
        {
            "word": "Segment",
            "def": "Segment \n Segment is another name for TCP packets."
        },
        {
            "word": "Sensitive Information",
            "def": "Sensitive Information \n Sensitive information, as defined by the federal government, is any unclassified information that, if compromised, could adversely affect the national interest or conduct of federal initiatives."
        },
        {
            "word": "Separation of Duties",
            "def": "Separation of Duties \n Separation of duties is the principle of splitting privileges among multiple individuals or systems."
        },
        {
            "word": "Server",
            "def": "Server \n A system entity that provides a service in response to requests from other system entities called clients."
        },
        {
            "word": "Session",
            "def": "Session \n A session is a virtual connection between two hosts by which network traffic is passed."
        },
        {
            "word": "Session Hijacking",
            "def": "Session Hijacking \n Take over a session that someone else has established."
        },
        {
            "word": "Session Key",
            "def": "Session Key \n In the context of symmetric encryption, a key that is temporary or is used for a relatively short period of time. Usually, a session key is used for a defined period of communication between two computers, such as for the duration of a single connection or transaction set, or the key is used in an application that protects relatively large amounts of data and, therefore, needs to be re-keyed frequently."
        },
        {
            "word": "SHA1",
            "def": "SHA1 \n A one way cryptographic hash function. Also see \"MD5\""
        },
        {
            "word": "Shadow Password Files",
            "def": "Shadow Password Files \n A system file in which encryption user password are stored so that they aren't available to people who try to break into the system."
        },
        {
            "word": "Share",
            "def": "Share \n A share is a resource made public on a machine, such as a directory (file share) or printer (printer share)."
        },
        {
            "word": "Shell",
            "def": "Shell \n A Unix term for the interactive user interface with an operating system. The shell is the layer of programming that understands and executes the commands a user enters. In some systems, the shell is called a command interpreter. A shell usually implies an interface with a command syntax (think of the DOS operating system and its \"C:>\" prompts and user commands such as \"dir\" and \"edit\")."
        },
        {
            "word": "Signals Analysis",
            "def": "Signals Analysis \n Gaining indirect knowledge of communicated data by monitoring and analyzing a signal that is emitted by a system and that contains the data but is not intended to communicate the data."
        },
        {
            "word": "Signature",
            "def": "Signature \n A Signature is a distinct pattern in network traffic that can be identified to a specific tool or exploit."
        },
        {
            "word": "Simple Integrity Property",
            "def": "Simple Integrity Property \n In Simple Integrity Property a user cannot write data to a higher integrity level than their own."
        },
        {
            "word": "Simple Network Management Protocol (SNMP)",
            "def": "Simple Network Management Protocol (SNMP) \n The protocol governing network management and the monitoring of network devices and their functions. A set of protocols for managing complex networks."
        },
        {
            "word": "Simple Security Property",
            "def": "Simple Security Property \n In Simple Security Property a user cannot read data of a higher classification than their own."
        },
        {
            "word": "Smartcard",
            "def": "Smartcard \n A smartcard is an electronic badge that includes a magnetic strip or chip that can record and replay a set key."
        },
        {
            "word": "Smurf",
            "def": "Smurf \n The Smurf attack works by spoofing the target address and sending a ping to the broadcast address for a remote network, which results in a large amount of ping replies being sent to the target."
        },
        {
            "word": "Sniffer",
            "def": "Sniffer \n A sniffer is a tool that monitors network traffic as it received in a network interface."
        },
        {
            "word": "Sniffing",
            "def": "Sniffing \n A synonym for \"passive wiretapping.\""
        },
        {
            "word": "Social Engineering",
            "def": "Social Engineering \n A euphemism for non-technical or low-technology means - such as lies, impersonation, tricks, bribes, blackmail, and threats - used to attack information systems."
        },
        {
            "word": "Socket",
            "def": "Socket \n The socket tells a host's IP stack where to plug in a data stream so that it connects to the right application."
        },
        {
            "word": "Socket Pair",
            "def": "Socket Pair \n A way to uniquely specify a connection, i.e., source IP address, source port, destination IP address, destination port."
        },
        {
            "word": "SOCKS",
            "def": "SOCKS \n A protocol that a proxy server can use to accept requests from client users in a company's network so that it can forward them across the Internet. SOCKS uses sockets to represent and keep track of individual connections. The client side of SOCKS is built into certain Web browsers and the server side can be added to a proxy server."
        },
        {
            "word": "Software",
            "def": "Software \n Computer programs (which are stored in and executed by computer hardware) and associated data (which also is stored in the hardware) that may be dynamically written or modified during execution."
        },
        {
            "word": "Source Port",
            "def": "Source Port \n The port that a host uses to connect to a server. It is usually a number greater than or equal to 1024. It is randomly generated and is different each time a connection is made."
        },
        {
            "word": "Spam",
            "def": "Spam \n Electronic junk mail or junk newsgroup postings."
        },
        {
            "word": "Spanning Port",
            "def": "Spanning Port \n Configures the switch to behave like a hub for a specific port."
        },
        {
            "word": "Split Horizon",
            "def": "Split Horizon \n Split horizon is a algorithm for avoiding problems caused by including routes in updates sent to the gateway from which they were learned."
        },
        {
            "word": "Split Key",
            "def": "Split Key \n A cryptographic key that is divided into two or more separate data items that individually convey no knowledge of the whole key that results from combining the items."
        },
        {
            "word": "Spoof",
            "def": "Spoof \n Attempt by an unauthorized entity to gain access to a system by posing as an authorized user."
        },
        {
            "word": "SQL Injection",
            "def": "SQL Injection \n SQL injection is a type of input validation attack specific to database-driven applications where SQL code is inserted into application queries to manipulate the database."
        },
        {
            "word": "Stack Mashing",
            "def": "Stack Mashing \n Stack mashing is the technique of using a buffer overflow to trick a computer into executing arbitrary code."
        },
        {
            "word": "Standard ACLs (Cisco)",
            "def": "Standard ACLs (Cisco) \n Standard ACLs on Cisco routers make packet filtering decisions based on Source IP address only."
        },
        {
            "word": "Star Property",
            "def": "Star Property \n In Star Property, a user cannot write data to a lower classification level without logging in at that lower classification level."
        },
        {
            "word": "State Machine",
            "def": "State Machine \n A system that moves through a series of progressive conditions."
        },
        {
            "word": "Stateful Inspection",
            "def": "Stateful Inspection \n Also referred to as dynamic packet filtering. Stateful inspection is a firewall architecture that works at the network layer. Unlike static packet filtering, which examines a packet based on the information in its header, stateful inspection examines not just the header information but also the contents of the packet up through the application layer in order to determine more about the packet than just information about its source and destination."
        },
        {
            "word": "Static Host Tables",
            "def": "Static Host Tables \n Static host tables are text files that contain hostname and address mapping."
        },
        {
            "word": "Static Routing",
            "def": "Static Routing \n Static routing means that routing table entries contain information that does not change."
        },
        {
            "word": "Stealthing",
            "def": "Stealthing \n Stealthing is a term that refers to approaches used by malicious code to conceal its presence on the infected system."
        },
        {
            "word": "Steganalysis",
            "def": "Steganalysis \n Steganalysis is the process of detecting and defeating the use of steganography."
        },
        {
            "word": "Steganography",
            "def": "Steganography \n Methods of hiding the existence of a message or other data. This is different than cryptography, which hides the meaning of a message but does not hide the message itself. An example of a steganographic method is \"invisible\" ink."
        },
        {
            "word": "Stimulus",
            "def": "Stimulus \n Stimulus is network traffic that initiates a connection or solicits a response."
        },
        {
            "word": "Store-and-Forward",
            "def": "Store-and-Forward \n Store-and-Forward is a method of switching where the entire packet is read by a switch to determine if it is intact before forwarding it."
        },
        {
            "word": "Straight-Through Cable",
            "def": "Straight-Through Cable \n A straight-through cable is where the pins on one side of the connector are wired to the same pins on the other end. It is used for interconnecting nodes on the network."
        },
        {
            "word": "Stream Cipher",
            "def": "Stream Cipher \n A stream cipher works by encryption a message a single bit, byte, or computer word at a time."
        },
        {
            "word": "Strong Star Property",
            "def": "Strong Star Property \n In Strong Star Property, a user cannot write data to higher or lower classifications levels than their own."
        },
        {
            "word": "Sub Network",
            "def": "Sub Network \n A separately identifiable part of a larger network that typically represents a certain limited number of host computers, the hosts in a building or geographic area, or the hosts on an individual local area network."
        },
        {
            "word": "Subnet Mask",
            "def": "Subnet Mask \n A subnet mask (or number) is used to determine the number of bits used for the subnet and host portions of the address. The mask is a 32-bit value that uses one-bits for the network and subnet portions and zero-bits for the host portion."
        },
        {
            "word": "Switch",
            "def": "Switch \n A switch is a networking device that keeps track of MAC addresses attached to each of its ports so that data is only transmitted on the ports that are the intended recipient of the data."
        },
        {
            "word": "Switched Network",
            "def": "Switched Network \n A communications network, such as the public switched telephone network, in which any user may be connected to any other user through the use of message, circuit, or packet switching and control devices. Any network providing switched communications service."
        },
        {
            "word": "Symbolic Links",
            "def": "Symbolic Links \n Special files which point at another file."
        },
        {
            "word": "Symmetric Cryptography",
            "def": "Symmetric Cryptography \n A branch of cryptography involving algorithms that use the same key for two different steps of the algorithm (such as encryption and decryption, or signature creation and signature verification). Symmetric cryptography is sometimes called \"secret-key cryptography\" (versus public-key cryptography) because the entities that share the key."
        },
        {
            "word": "Symmetric Key",
            "def": "Symmetric Key \n A cryptographic key that is used in a symmetric cryptographic algorithm."
        },
        {
            "word": "SYN Flood",
            "def": "SYN Flood \n A denial of service attack that sends a host more TCP SYN packets (request to synchronize sequence numbers, used when opening a connection) than the protocol implementation can handle."
        },
        {
            "word": "Synchronization",
            "def": "Synchronization \n Synchronization is the signal made up of a distinctive pattern of bits that network hardware looks for to signal that start of a frame."
        },
        {
            "word": "Syslog",
            "def": "Syslog \n Syslog is the system logging facility for Unix systems."
        },
        {
            "word": "System Security Officer (SSO)",
            "def": "System Security Officer (SSO) \n A person responsible for enforcement or administration of the security policy that applies to the system."
        },
        {
            "word": "System-Specific Policy",
            "def": "System-Specific Policy \n A System-specific policy is a policy written for a specific system or device."
        },
        {
            "word": "T1, T3",
            "def": "T1, T3 \n A digital circuit using TDM (Time-Division Multiplexing)."
        },
        {
            "word": "Tamper",
            "def": "Tamper \n To deliberately alter a system's logic, data, or control information to cause the system to perform unauthorized functions or services."
        },
        {
            "word": "TCP Fingerprinting",
            "def": "TCP Fingerprinting \n TCP fingerprinting is the user of odd packet header combinations to determine a remote operating system."
        },
        {
            "word": "TCP Full Open Scan",
            "def": "TCP Full Open Scan \n TCP Full Open scans check each port by performing a full three-way handshake on each port to determine if it was open."
        },
        {
            "word": "TCP Half Open Scan",
            "def": "TCP Half Open Scan \n TCP Half Open scans work by performing the first half of a three-way handshake to determine if a port is open."
        },
        {
            "word": "TCP Wrapper",
            "def": "TCP Wrapper \n A software package which can be used to restrict access to certain network services based on the source of the connection; a simple tool to monitor and control incoming network traffic."
        },
        {
            "word": "TCP/IP",
            "def": "TCP/IP \n A synonym for \"Internet Protocol Suite;\" in which the Transmission Control Protocol and the Internet Protocol are important parts. TCP/IP is the basic communication language or protocol of the Internet. It can also be used as a communications protocol in a private network (either an Intranet or an Extranet)."
        },
        {
            "word": "TCPDump",
            "def": "TCPDump \n TCPDump is a freeware protocol analyzer for Unix that can monitor network traffic on a wire."
        },
        {
            "word": "TELNET",
            "def": "TELNET \n A TCP-based, application-layer, Internet Standard protocol for remote login from one host to another."
        },
        {
            "word": "Threat",
            "def": "Threat \n A potential for violation of security, which exists when there is a circumstance, capability, action, or event that could breach security and cause harm."
        },
        {
            "word": "Threat Assessment",
            "def": "Threat Assessment \n A threat assessment is the identification of types of threats that an organization might be exposed to."
        },
        {
            "word": "Threat Model",
            "def": "Threat Model \n A threat model is used to describe a given threat and the harm it could to do a system if it has a vulnerability."
        },
        {
            "word": "Threat Vector",
            "def": "Threat Vector \n The method a threat uses to get to the target."
        },
        {
            "word": "Time to Live",
            "def": "Time to Live \n A value in an Internet Protocol packet that tells a network router whether or not the packet has been in the network too long and should be discarded."
        },
        {
            "word": "Tiny Fragment Attack",
            "def": "Tiny Fragment Attack \n With many IP implementations it is possible to impose an unusually small fragment size on outgoing packets. If the fragment size is made small enough to force some of a TCP packet's TCP header fields into the second fragment, filter rules that specify patterns for those fields will not match. If the filtering implementation does not enforce a minimum fragment size, a disallowed packet might be passed because it didn't hit a match in the filter. STD 5, RFC 791 states: Every Internet module must be able to forward a datagram of 68 octets without further fragmentation. This is because an Internet header may be up to 60 octets, and the minimum fragment is 8 octets."
        },
        {
            "word": "Token Ring",
            "def": "Token Ring \n A token ring network is a local area network in which all computers are connected in a ring or star topology and a binary digit or token-passing scheme is used in order to prevent the collision of data between two computers that want to send messages at the same time."
        },
        {
            "word": "Token-Based Access Control",
            "def": "Token-Based Access Control \n Token based access control associates a list of objects and their privileges with each user. (The opposite of list based.)"
        },
        {
            "word": "Token-Based Devices",
            "def": "Token-Based Devices \n A token-based device is triggered by the time of day, so every minute the password changes, requiring the user to have the token with them when they log in."
        },
        {
            "word": "Topology",
            "def": "Topology \n The geometric arrangement of a computer system. Common topologies include a bus, star, and ring. The specific physical, i.e., real, or logical, i.e., virtual, arrangement of the elements of a network. Note 1: Two networks have the same topology if the connection configuration is the same, although the networks may differ in physical interconnections, distances between nodes, transmission rates, and/or signal types. Note 2: The common types of network topology are illustrated"
        },
        {
            "word": "Traceroute (tracert.exe)",
            "def": "Traceroute (tracert.exe) \n Traceroute is a tool the maps the route a packet takes from the local machine to a remote destination."
        },
        {
            "word": "Transmission Control Protocol (TCP)",
            "def": "Transmission Control Protocol (TCP) \n A set of rules (protocol) used along with the Internet Protocol to send data in the form of message units between computers over the Internet. While IP takes care of handling the actual delivery of the data, TCP takes care of keeping track of the individual units of data (called packets) that a message is divided into for efficient routing through the Internet. Whereas the IP protocol deals only with packets, TCP enables two hosts to establish a connection and exchange streams of data. TCP guarantees delivery of data and also guarantees that packets will be delivered in the same order in which they were sent."
        },
        {
            "word": "Transport Layer Security (TLS)",
            "def": "Transport Layer Security (TLS) \n A protocol that ensures privacy between communicating applications and their users on the Internet. When a server and client communicate, TLS ensures that no third party may eavesdrop or tamper with any message. TLS is the successor to the Secure Sockets Layer."
        },
        {
            "word": "Triple DES",
            "def": "Triple DES \n A block cipher, based on DES, that transforms each 64-bit plaintext block by applying the Data Encryption Algorithm three successive times, using either two or three different keys, for an effective key length of 112 or 168 bits."
        },
        {
            "word": "Triple-Wrapped",
            "def": "Triple-Wrapped \n S/MIME usage: data that has been signed with a digital signature, and then encrypted, and then signed again."
        },
        {
            "word": "Trojan Horse",
            "def": "Trojan Horse \n A computer program that appears to have a useful function, but also has a hidden and potentially malicious function that evades security mechanisms, sometimes by exploiting legitimate authorizations of a system entity that invokes the program."
        },
        {
            "word": "Trunking",
            "def": "Trunking \n Trunking is connecting switched together so that they can share VLAN information between them."
        },
        {
            "word": "Trust",
            "def": "Trust \n Trust determine which permissions and what actions other systems or users can perform on remote machines."
        },
        {
            "word": "Trusted Ports",
            "def": "Trusted Ports \n Trusted ports are ports below number 1024 usually allowed to be opened by the root user."
        },
        {
            "word": "Tunnel",
            "def": "Tunnel \n A communication channel created in a computer network by encapsulating a communication protocol's data packets in (on top of) a second protocol that normally would be carried above, or at the same layer as, the first one. Most often, a tunnel is a logical point-to-point link - i.e., an OSI layer 2 connection - created by encapsulating the layer 2 protocol in a transport protocol (such as TCP), in a network or inter-network layer protocol (such as IP), or in another link layer protocol. Tunneling can move data between computers that use a protocol not supported by the network connecting them."
        },
        {
            "word": "UDP Scan",
            "def": "UDP Scan \n UDP scans perform scans to determine which UDP ports are open."
        },
        {
            "word": "Unicast",
            "def": "Unicast \n Broadcasting from host to host."
        },
        {
            "word": "Uniform Resource Identifier (URI)",
            "def": "Uniform Resource Identifier (URI) \n The generic term for all types of names and addresses that refer to objects on the World Wide Web."
        },
        {
            "word": "Uniform Resource Locator (URL)",
            "def": "Uniform Resource Locator (URL) \n The global address of documents and other resources on the World Wide Web. The first part of the address indicates what protocol to use, and the second part specifies the IP address or the domain name where the resource is located. For example, http://www.pcwebopedia.com/ind... ."
        },
        {
            "word": "Unix",
            "def": "Unix \n A popular multi-user, multitasking operating system developed at Bell Labs in the early 1970s. Created by just a handful of programmers, Unix was designed to be a small, flexible system used exclusively by programmers."
        },
        {
            "word": "Unprotected Share",
            "def": "Unprotected Share \n In Windows terminology, a \"share\" is a mechanism that allows a user to connect to file systems and printers on other systems. An \"unprotected share\" is one that allows anyone to connect to it."
        },
        {
            "word": "User",
            "def": "User \n A person, organization entity, or automated process that accesses a system, whether authorized to do so or not."
        },
        {
            "word": "User Contingency Plan",
            "def": "User Contingency Plan \n User contingency plan is the alternative methods of continuing business operations if IT systems are unavailable."
        },
        {
            "word": "User Datagram Protocol (UDP)",
            "def": "User Datagram Protocol (UDP) \n A communications protocol that, like TCP, runs on top of IP networks. Unlike TCP/IP, UDP/IP provides very few error recovery services, offering instead a direct way to send and receive datagrams over an IP network. It's used primarily for broadcasting messages over a network. UDP uses the Internet Protocol to get a datagram from one computer to another but does not divide a message into packets (datagrams) and reassemble it at the other end. Specifically, UDP doesn't provide sequencing of the packets that the data arrives in."
        },
        {
            "word": "Virtual Private Network (VPN)",
            "def": "Virtual Private Network (VPN) \n A restricted-use, logical (i.e., artificial or simulated) computer network that is constructed from the system resources of a relatively public, physical (i.e., real) network (such as the Internet), often by using encryption (located at hosts or gateways), and often by tunneling links of the virtual network across the real network. For example, if a corporation has LANs at several different sites, each connected to the Internet by a firewall, the corporation could create a VPN by (a) using encrypted tunnels to connect from firewall to firewall across the Internet and (b) not allowing any other traffic through the firewalls. A VPN is generally less expensive to build and operate than a dedicated real network, because the virtual network shares the cost of system resources with other users of the real network."
        },
        {
            "word": "Virus",
            "def": "Virus \n A hidden, self-replicating section of computer software, usually malicious logic, that propagates by infecting - i.e., inserting a copy of itself into and becoming part of - another program. A virus cannot run by itself; it requires that its host program be run to make the virus active."
        },
        {
            "word": "Voice Firewall",
            "def": "Voice Firewall \n A physical discontinuity in a voice network that monitors, alerts and controls inbound and outbound voice network activity based on user-defined call admission control (CAC) policies, voice application layer security threats or unauthorized service use violations."
        },
        {
            "word": "Voice Intrusion Prevention System (IPS)",
            "def": "Voice Intrusion Prevention System (IPS) \n Voice IPS is a security management system for voice networks which monitors voice traffic for multiple calling patterns or attack/abuse signatures to proactively detect and prevent toll fraud, Denial of Service, telecom attacks, service abuse, and other anomalous activity."
        },
        {
            "word": "War Chalking",
            "def": "War Chalking \n War chalking is marking areas, usually on sidewalks with chalk, that receive wireless signals that can be accessed."
        },
        {
            "word": "War Dialer",
            "def": "War Dialer \n A computer program that automatically dials a series of telephone numbers to find lines connected to computer systems, and catalogs those numbers so that a cracker can try to break into the systems."
        },
        {
            "word": "War Dialing",
            "def": "War Dialing \n War dialing is a simple means of trying to identify modems in a telephone exchange that may be susceptible to compromise in an attempt to circumvent perimeter security."
        },
        {
            "word": "War Driving",
            "def": "War Driving \n War driving is the process of traveling around looking for wireless access point signals that can be used to get network access."
        },
        {
            "word": "Web of Trust",
            "def": "Web of Trust \n A web of trust is the trust that naturally evolves as a user starts to trust other's signatures, and the signatures that they trust."
        },
        {
            "word": "Web Server",
            "def": "Web Server \n A software process that runs on a host computer connected to the Internet to respond to HTTP requests for documents from client web browsers."
        },
        {
            "word": "WHOIS",
            "def": "WHOIS \n An IP for finding information about resources on networks."
        },
        {
            "word": "Windowing",
            "def": "Windowing \n A windowing system is a system for sharing a computer's graphical display presentation resources among multiple applications at the same time. In a computer that has a graphical user interface (GUI), you may want to use a number of applications at the same time (this is called task). Using a separate window for each application, you can interact with each application and go from one application to another without having to reinitiate it. Having different information or activities in multiple windows may also make it easier for you to do your work. A windowing system uses a window manager to keep track of where each window is located on the display screen and its size and status. A windowing system doesn't just manage the windows but also other forms of graphical user interface entities."
        },
        {
            "word": "Windump",
            "def": "Windump \n Windump is a freeware tool for Windows that is a protocol analyzer that can monitor network traffic on a wire."
        },
        {
            "word": "Wired Equivalent Privacy (WEP)",
            "def": "Wired Equivalent Privacy (WEP) \n A security protocol for wireless local area networks defined in the standard IEEE 802.11b."
        },
        {
            "word": "Wireless Application Protocol",
            "def": "Wireless Application Protocol \n A specification for a set of communication protocols to standardize the way that wireless devices, such as cellular telephones and radio transceivers, can be used for Internet access, including e-mail, the World Wide Web, newsgroups, and Internet Relay Chat."
        },
        {
            "word": "Wiretapping",
            "def": "Wiretapping \n Monitoring and recording data that is flowing between two points in a communication system."
        },
        {
            "word": "World Wide Web (\"the Web\", WWW, W3)",
            "def": "World Wide Web (\"the Web\", WWW, W3) \n The global, hypermedia-based collection of information and services that is available on Internet servers and is accessed by browsers using Hypertext Transfer Protocol and other information retrieval mechanisms."
        },
        {
            "word": "Worm",
            "def": "Worm \n A computer program that can run independently, can propagate a complete working version of itself onto other hosts on a network, and may consume computer resources destructively."
        },
        {
            "word": "Zero Day",
            "def": "Zero Day \n The \"Day Zero\" or \"Zero Day\" is the day a new vulnerability is made known. In some cases, a \"zero day\" exploit is referred to an exploit for which no patch is available yet. (\"day one\" - day at which the patch is made available)."
        },
        {
            "word": "Zero-day attack",
            "def": "Zero-day attack \n A zero-day (or zero-hour or day zero) attack or threat is a computer threat that tries to exploit computer application vulnerabilities that are unknown to others or undisclosed to the software developer. Zero-day exploits (actual code that can use a security hole to carry out an attack) are used or shared by attackers before the software developer knows about the vulnerability."
        },
        {
            "word": "Zombies",
            "def": "Zombies \n A zombie computer (often shortened as zombie) is a computer connected to the Internet that has been compromised by a hacker, a computer virus, or a trojan horse. Generally, a compromised machine is only one of many in a botnet, and will be used to perform malicious tasks of one sort or another under remote direction. Most owners of zombie computers are unaware that their system is being used in this way. Because the owner tends to be unaware, these computers are metaphorically compared to zombies."
        },
        {
            "word": "10BaseT; 100BaseT",
            "def": " An Ethernet specification that can handle up to 10 mega bits of data per second. 10BaseT Ethernet imposes differing limitations, depending on what type of physical wire is being used and how many stations are attached to the network. For example, the maximum distance a hub can be from a workstation in 10BaseT is 325 feet if using twisted pair cables, but 3,000 feet if using fiber optic cable. Most modern Ethernets are migrating to 100BaseT, which is ten times faster than 10BaseT.  \n  "
        },
        {
            "word": "ACL (Access Control List)",
            "def": " A method of keeping in check the Internet traffic that attempts to flow through a given hub, router, firewall, or similar device. Access control is often accomplished by creating a list specifying the IP addresses and/or ports from which permitted traffic can come. The device stops any traffic coming from IP addresses or ports not on the ACL.  \n  "
        },
        {
            "word": "active mode FTP (File Transfer Protocol)",
            "def": " One of two ways an FTP data connection is made. In active mode, the FTP server establishes the data connection. In passive mode, the client establishes the connection. In general, FTP user agents use active mode and Web user agents use passive mode.  \n  "
        },
        {
            "word": "activity light",
            "def": " An LED (light-emitting diode) that shines when a piece of hardware is working, communicating with the network, and transmitting data.  \n  "
        },
        {
            "word": "address learning",
            "def": " A method by which switches and routers determine the unique address number for each device on a network, enabling accurate transmission to and from each node.  \n  "
        },
        {
            "word": "address space probe",
            "def": " An intrusion technique in which a hacker sequentially scans IP addresses, generally as the information-gathering prelude to an attack. These probes are usually attempts to map IP address space as the hacker looks for security holes that might be exploited to compromise system security.  \n  "
        },
        {
            "word": "agent",
            "def": " A computer program that reports information to another computer or allows another computer access to the local system. Agents can be used for good or evil. Many security programs have agent components that report security information back to a central reporting platform. However, agents can also be remotely controlled programs hackers use to access machines.  \n  "
        },
        {
            "word": "AH (authentication header)",
            "def": " An IPSec header used to verify that the contents of a packet have not been modified while the packet was in transit.  \n  "
        },
        {
            "word": "algorithm (encryption)",
            "def": " A set of mathematical rules (logic) for the process of encryption and decryption.  \n  "
        },
        {
            "word": "alias",
            "def": " A shortcut that enables a user to identify a group of hosts, networks, or users under one name. Aliases are used to speed user authentication and service configuration. For example, in configuring a Firebox a user can set up the alias \"Marketing\" to include the IP addresses of every network user in a company's marketing department.  \n  "
        },
        {
            "word": "API (Application Programming Interface)",
            "def": " Programming tools that specify standard ways software programs within a given operating environment should act, so that numerous applications can play well together. These specifications and tools enable a developer to create applications that will interact well with other applications that the developer has never seen, because all the developers are working from standardized specifications. For example, the robust APIs in Windows allow many dissimilar software products to interact upon one another (and even look similar) within the Windows environment.  \n  "
        },
        {
            "word": "Argument",
            "def": " See parameter.  \n  "
        },
        {
            "word": "armed",
            "def": " When a Firebox is armed, it is actively guarding against intrusion and attack.  \n  "
        },
        {
            "word": "ARP (Address Resolution Protocol)",
            "def": " Each device on a network has at least two addresses: a media access control (MAC) address, and an Internet Protocol (IP) address. The MAC address is the address of the physical network interface card inside the device, and never changes for the life of the device. The IP address can change if the machine moves to another part of the network or the network uses DHCP. ARP, one of the IP protocols, is used to match, or resolve, an IP address to its appropriate MAC address (and vice versa). ARP works by broadcasting a packet to all hosts attached to an Ethernet. The packet contains the IP address the sender is interested in communicating with. Most hosts ignore the packet. The target machine, recognizing that the IP address in the packet matches its own, returns an answer.  \n  "
        },
        {
            "word": "ARP table",
            "def": " A table of IP addresses stored on a local computer, used to match IP addresses to their corresponding MAC addresses. \n See also ARP.  \n  "
        },
        {
            "word": "ASN.1 (Abstract Syntax Notation One)",
            "def": " An international standard that aims at specifying data used in communication protocols. ISO/IEC standard for encoding rules used in ANSI X.509 certificates. Two common types exist: DER (Distinguished Encoding Rules) and BER (Basic Encoding Rules).  \n  "
        },
        {
            "word": "asymmetric keys",
            "def": " A pair of encryption keys, composed of one public key and one private key. Each key is one way, meaning that a key used to encrypt data cannot be used to decrypt the same data. However, information encrypted using the public key can be decrypted using the private key, and vice versa. This technology is commonly applied to e-mails, which are encrypted for confidentiality en route.  \n  "
        },
        {
            "word": "attack",
            "def": " An attempt to break into a system.  \n  "
        },
        {
            "word": "ATM (asynchronous transfer mode)",
            "def": " A networking technology that breaks data into fixed-length cells, enabling high transfer speeds. ATM is widely used for the backbone, or core, of the Internet.  \n  "
        },
        {
            "word": "authentication",
            "def": " 1. The process of identifying an individual, usually based on a user name and password. Authentication iusually requires something a person has (such as a key, badge, or token), something a person knows (such as a password, ID number, or mother's maiden name), or something a person is (represented by a photo, fingerprint or retina scan, etc). When authentication requires two of those three things, it is considered strong authentication.  \n  2. A method of associating a user name with a workstation IP address, allowing the tracking of connections based on name rather than IP address. With authentication, you can track users regardless of which machine a person chooses to work from.  \n  "
        },
        {
            "word": "autopartitioning",
            "def": " A feature on some network devices that isolates a node within the workgroup when the node becomes disabled, so as not to affect the entire network or group.  \n  "
        },
        {
            "word": "authorization",
            "def": " To convey official access or legal power to a person or entity.  \n  "
        },
        {
            "word": "backbone",
            "def": " A term often used to describe the main network connections composing the Internet.  \n  "
        },
        {
            "word": "backdoor",
            "def": " A design fault, planned or accidental, that allows the apparent strength of the design to be easily avoided by those who know the trick.  \n  "
        },
        {
            "word": "bandwidth",
            "def": " The rate at which a network segment can transfer data.  \n  "
        },
        {
            "word": "Bandwidth Meter",
            "def": " A monitoring tool that provides a real-time graphical display of network activities across a Firebox. This comes as a part of the application called Firebox Monitors.  \n  "
        },
        {
            "word": "bastion host",
            "def": " A computer placed outside a firewall to provide public services (such as World Wide Web access and FTP) to other Internet sites, hardened to withstand whatever attacks the Internet can throw at it.  \n  Hardening is accomplished by making the box as single-purpose as possible, removing all unneeded services and potential security vulnerabilities. Bastion host is sometimes inaccurately generalized to refer to any host critical to the defense of a local network.  \n  "
        },
        {
            "word": "bitmask",
            "def": " A pattern of bits for an IP address that determines how much of the IP address identifies the host and how much identifies the network. For example, if a bitmask of 24 were applied to the address 10.12.132.208, 10.12.132 identifies the network and the remainder of the address (1-254) can be used to specify individual machines on the 10.12.132 network.  \n  To learn more, see IP address and subnet mask. You can find a full discussion of the topic in these Security Fundamentals articles: \"Understanding IP Addresses and Binary,\" \"Understanding IPv4 Subnetting (Part 1),\" and \"Understanding IPv4 Subnetting (Part 2).\"  \n  "
        },
        {
            "word": "black hat",
            "def": " A person of malicious intent who researches, develops, and uses techniques to defeat security measures and invade computer networks. See white hat.  \n  "
        },
        {
            "word": "block cipher",
            "def": " A procedure that translates plain text into coded text, operating on blocks of plain text of a fixed size (usually 64 bits). Every block is padded out to be the same size, making the encrypted message harder to guess.  \n  "
        },
        {
            "word": "blocked port",
            "def": " A security measure in which a specific port is disabled, stopping users outside the firewall from gaining access to the network through that port. The ports commonly blocked by network administrators are the ports most commonly used in attacks. \n See also port.  \n  "
        },
        {
            "word": "blocked site",
            "def": " An IP address outside the firewall, explicitly blocked so it cannot connect with hosts behind the firewall. Sites can be blocked manually and permanently, or automatically and temporarily.  \n  "
        },
        {
            "word": "Blue Screen of Death (BSoD)",
            "def": " When a Windows NT-based system encounters a serious error, the entire operating system halts and displays a screen with information regarding the error. The name comes from the blue color of the error screen.  \n  "
        },
        {
            "word": "boot up",
            "def": " To start a computer. Inspired by the phrase, \"pull oneself up by one's boot straps.\"  \n  "
        },
        {
            "word": "botnet",
            "def": " Collection of computers that are infected with small bits of code (bots) that allow a remote computer to control some or all of the functions of the infected machines. The botmaster who controls the infected computers has the ability to manipulate them individually, or collectively as bot armies that act in concert. Botnets are typically used for disreputable purposes, such as Denial of Service attacks, click fraud, and spam.  \n  "
        },
        {
            "word": "BOVPN (Branch Office Virtual Private Network)",
            "def": " A type of VPN that creates a securely encrypted tunnel over an unsecured public network, either between two networks that are protected by the WatchGuard Firebox System, or between a WatchGuard Firebox and an IPSec-compliant device. BOVPN allows a user to connect two or more locations over the Internet while protecting the resources on the Trusted and Optional networks.  \n  "
        },
        {
            "word": "bridge",
            "def": " A piece of hardware used to connect two local area networks, or segments of a LAN, so that devices on the network can communicate without requiring a router. Bridges can only connect networks running the same protocol.  \n  "
        },
        {
            "word": "broadcast",
            "def": " A network transmission sent to all nodes on a network.  \n  "
        },
        {
            "word": "broadcast address",
            "def": " A special type of networking address that denotes all machines on a given network segment.  \n  "
        },
        {
            "word": "browser",
            "def": " See Web browser.  \n  "
        },
        {
            "word": "buffer overflow",
            "def": " The result of a programming flaw. Some computer programs expect input from the user (for example, a Web page form might accept phone numbers from prospective customers). The program allows some virtual memory for accepting the expected input. If the programmer did not write his program to discard extra input (e.g., if instead of a phone number, someone submitted one thousand characters), the input can overflow the amount of memory allocated for it, and break into the portion of memory where code is executed. A skillful hacker can exploit this flaw to make someone's computer execute the hacker's code. Used interchangeably with the term, \"buffer overrun.\"  \n  "
        },
        {
            "word": "bus topology",
            "def": " A type of network design used by all Ethernet systems, in which all the devices are connected to a central cable.  \n  "
        },
        {
            "word": "cable segment",
            "def": " A section of network cable separated by switches, routers, or bridges.  \n  "
        },
        {
            "word": "cascade",
            "def": " A command that arranges windows so that they are overlapped, with the active window in front.  \n  "
        },
        {
            "word": "Category 3 cabling",
            "def": " A cabling specification for 10BaseT networks, which are capable of handling up to 10 mega bits of data per second. \n See also 10BaseT / 100BaseT.  \n  "
        },
        {
            "word": "Category 5 cabling",
            "def": " A cabling specification for 100BaseT networks, which are capable of handling up to 100 mega bits of data per second. \n See also 10BaseT / 100BaseT.  \n  "
        },
        {
            "word": "CBC (Cipher Block Chaining)",
            "def": " A technique commonly used by encryption algorithms like Data Encryption Standard (DES) - CBC, where a plain text message is broken into sequential blocks. The first block is encrypted using a given cipher, creating cipher text. That cipher text is used to encrypt the second block of plain text. This pattern continues, with each subsequent block of plain text being encrypted using the cipher text encrypted just before it.  \n  "
        },
        {
            "word": "CD-ROM (Compact Disc Read-Only Memory)",
            "def": " A compact disk on which data is stored.  \n  "
        },
        {
            "word": "certificate",
            "def": " An electronic document attached to someone's public key by a trusted third party, which attests that the public key belongs to a legitimate owner and has not been compromised. Certificates are intended to help you verify that a file or message actually comes from the entity it claims to come from.  \n  "
        },
        {
            "word": "certificate authority (CA)",
            "def": " A trusted third party (TTP) who verifies the identity of a person or entity, then issues digital certificates vouching that various attributes (e. g., name, a given public key) have a valid association with that entity.  \n  "
        },
        {
            "word": "certificate revocation list",
            "def": " See CRL.  \n  "
        },
        {
            "word": "CHAP (Challenge Handshake Authentication Protocol)",
            "def": " A type of authentication where the person logging in uses secret information and some special mathematical operations to come up with a number value. The server he or she is logging into knows the same secret value and performs the same mathematical operations. If the results match, the person is authorized to access the server. One of the numbers in the mathematical operation is changed after every log-in, to protect against an intruder secretly copying a valid authentication session and replaying it later to log in. Often contrasted with PAP.  \n  "
        },
        {
            "word": "CIDR (Classless Inter-Domain Routing)",
            "def": " Originally, Internet addresses were classified as A, B, or C. The early classification system did not envision the massive popularity of the Internet, and is in danger of running out of new unique addresses. CIDR is an addressing scheme that allows one IP address to designate many IP addresses. A CIDR IP address looks like a normal IP address except that it ends with a slash followed by a number; for example, 192.168.0.0/16. CIDR is described in RFC 1519. For a full discussion of \"classful\" versus CIDR \"classless\" routing, see these LiveSecurity editorials from the Foundations series: \"Understanding IPv4 Subnetting (Part 1),\" and \"Understanding IPv4 Subnetting (Part 2).\"  \n  "
        },
        {
            "word": "cipher block chaining",
            "def": " See CBC.  \n  "
        },
        {
            "word": "cipher text",
            "def": " The result of encrypting either characters or bits using some algorithm. Cipher text is unreadable until it is decrypted.  \n  "
        },
        {
            "word": "Class A, Class B, Class C",
            "def": " See Internet address class.  \n  "
        },
        {
            "word": "clear-signed message",
            "def": " A message that is digitally signed but not encrypted. \n See digital signature.  \n  "
        },
        {
            "word": "clear text",
            "def": " Characters in a human readable form prior to encryption or after decryption. Also called plain text.  \n  "
        },
        {
            "word": "click fraud",
            "def": " An online crime that involves automating the act of clicking on a web link to perpetrate a fraud. In a classic click fraud scenario, a legitimate web site decides to advertise on another site, which hosts the ad. The legitimate web site agrees to pay the ad hosting site a few cents each time a potential customer clicks on the ad, which links back to the legitimate site. Cheaters use automated tools to click the ad over and over, earning money from the legitimate site under false pretenses (since the clicks do not come from actual people interested in the advertised products). Some click fraud attacks are launched by companies that use them to deplete the advertising budget of a competitor. Other click fraud scenarios can bias the results of a poll or vote.  \n  "
        },
        {
            "word": "client",
            "def": " A computer process that requests a service from another computer and accepts the server's responses.  \n  "
        },
        {
            "word": "Client/Server",
            "def": " A network computing system in which individual computers (clients) use a central computer (server) for services such as file storage, printing, and communications. \n See peer-to-peer.  \n  "
        },
        {
            "word": "coax (coaxial) cable",
            "def": " A type of cable, used in Ethernet networking, with a solid central conductor surrounded by an insulator, in turn surrounded by a cylindrical shield woven from fine wires. The shield minimizes electrical and radio frequency interference.  \n  "
        },
        {
            "word": "cold boot",
            "def": " The process of starting a computer by turning on the power to the system unit.  \n  "
        },
        {
            "word": "collisions",
            "def": " Conflicts that occur when two packets are sent over the network simultaneously. When packets collide, both packets are rejected. Ethernet automatically resends them at altered timing.  \n  "
        },
        {
            "word": "compress",
            "def": " To compact a file or group of files so that they occupy less disk space. \n See also decompress.  \n  "
        },
        {
            "word": "compression function",
            "def": " A function that accepts input and returns a shorter output. One common program that performs this is WinZIP.  \n  "
        },
        {
            "word": "Control Panel",
            "def": " The set of Microsoft Windows programs used to change system hardware, software, and settings.  \n  "
        },
        {
            "word": "conventional encryption",
            "def": " See symmetric algorithm.  \n  "
        },
        {
            "word": "cookie",
            "def": " A text file passed from the Web server to the Web client (a user's browser) that is used to identify a user and could record personal information such as ID and password, mailing address, credit card number, and more. A cookie is what enables your favorite Web site to \"recognize\" you each time you revisit it.  \n  "
        },
        {
            "word": "coprocessor",
            "def": " A microprocessor designed to assist another microprocessor in specific functions, such as handling complex mathematics or graphics, and to temporarily reduce the workload of the other microprocessor.  \n  "
        },
        {
            "word": "CPU (Central Processing Unit)",
            "def": " The microprocessor chip that interprets and carries out most of the instructions you give your computer. Also, simply, a term for a computer.  \n  "
        },
        {
            "word": "cracker",
            "def": " Another term for someone who attempts to defeat network security measures, with hostile intent. Commonly used in popular media as a synonym for hacker.  \n  "
        },
        {
            "word": "CRL (Certificate Revocation List)",
            "def": " An up-to-date list of previously issued certificates that are no longer valid. \n See also revocation.  \n  "
        },
        {
            "word": "cross-certification",
            "def": " A status where two or more organizations or certificate authorities share some level of trust.  \n  "
        },
        {
            "word": "crossover cable",
            "def": " Ethernet cables have multiple wires inside them. Some are dedicated to sending; some are dedicated to receiving. A crossover cable is a special cable in which the receive and send wires cross so that the sending leads on one device can directly connect to the receiving leads on the other device. When WatchGuard encloses a crossover cable with its products, it is typically color-coded red for easy identification.  \n  "
        },
        {
            "word": "cross-site scripting",
            "def": " An attack performed through Web browsers, taking advantage of poorly-written Web applications. Cross-site scripting attacks can take many forms. One common form is for an attacker to trick a user into clicking on a specially-crafted, malicious hyperlink. The link appears to lead to an innocent site, but the site is actually the attacker's, and includes embedded scripts. What the script does is up to the attacker; commonly, it collects data the victim might enter, such as a credit card number or password. The malicious link itself might also collect the victim's cookie data.  \n  "
        },
        {
            "word": "cryptanalysis",
            "def": " The art or science of transferring cipher text into plain text without initial knowledge of the key used to encrypt the plain text.  \n  "
        },
        {
            "word": "CRYPTOCard",
            "def": " One element in a proprietary authentication system, which uses an offline card containing a large secret key to answer security \"challenges\" from the network. The large number inside the card, called a key, is like a hard-to-guess password used in encrypting and decrypting. The key is never stored on a computer, which increases its safety against unauthorized discovery.  \n  "
        },
        {
            "word": "cryptography",
            "def": " The art and science of encoding and decoding messages using mathematical algorithms that utilize a secret key. The concept has broadened to include managing messages that have some combination of: privacy (by being unreadable to anyone but the sender and receiver); integrity (not modified while en route), and non-repudiation (digitally signed in such a way that the originator cannot plausibly claim he or she did not originate it).  \n  "
        },
        {
            "word": "CSLIP (Compressed Serial Line Internet Protocol)",
            "def": " A protocol for exchanging IP packets over a serial line, which compresses the headers of many TCP/IP packets.  \n  "
        },
        {
            "word": "custom filter rules",
            "def": " A filter rule is a configuration setting to either deny or allow specific content types through the Firebox. A custom filter rule is a rule a Firebox user created in WatchGuard Policy Manager, in contrast with the pre-made rules WatchGuard created for the Firebox.  \n  "
        },
        {
            "word": "CVE-compatible",
            "def": " Common Vulnerabilities and Exposures (CVE) is a list of standardized names for vulnerabilities and other information security exposures, whose aim is to standardize the names for all publicly known vulnerabilities and security exposures. \"CVE-compatible\" means that a tool, Web site, database, or service uses CVE names in a way that allows it to cross-link with other repositories that use CVE names.  \n  "
        },
        {
            "word": "data compression",
            "def": " See compress.  \n  "
        },
        {
            "word": "datagram",
            "def": " A packet of data that contains information, plus origin and destination addresses. Generally used in reference to UDP and ICMP packets when talking about IP protocols.  \n  "
        },
        {
            "word": "data transmission speed",
            "def": " The number of bits that can travel per second over a network cable, typically measured in bits per second (bps).  \n  "
        },
        {
            "word": "DCE-RPC (Distributed Computing Environment Remote Procedure Call)",
            "def": " A Microsoft implementation of a portmapping service. A portmapper is a service that runs on a specific port, redirecting clients that send a request to that port. These initial calls typically result in a response from the trusted machine that redirects the client to a new port for the actual service the client wants. \n See also RPC.  \n  "
        },
        {
            "word": "DDoS",
            "def": " See denial of service attack (DoS).  \n  "
        },
        {
            "word": "decompress",
            "def": " To expand a compressed file or group of files back to their normal size so that the file or files can be opened. \n See also compress.  \n  "
        },
        {
            "word": "decrypt",
            "def": " To decode data that has been encrypted, turning it back into plain text. \n See also encrypt.  \n  "
        },
        {
            "word": "dedicated server",
            "def": " A single computer in a network, reserved for serving the needs of the network.  \n  "
        },
        {
            "word": "default",
            "def": " A predefined setting built into a program, used when an alternative setting is not specified.  \n  "
        },
        {
            "word": "default gateway",
            "def": " When individual machines on a network segment send data packets, they check the packet's destination to figure out whether the destination is local (meaning, on the same network segment) or not. If the packet's destination is not local, the machine forwards it to a node on the network serving as the entrance to all other networks. This node is called the default gateway, and could be any routing device, such as a router or a firewall appliance.  \n  "
        },
        {
            "word": "default packet handling",
            "def": " A set of rules that instruct the Firebox on how to process packets when no other rules have been specified. For example, by default the Firebox logs any packet sent to a broadcast address.  \n  "
        },
        {
            "word": "denial of service attack (DoS)",
            "def": " A type of attack aimed at making the targeted system or network unusable, often by monopolizing system resources. For example, in February 2000 a hacker directed thousands of requests to eBay's Web site. The network traffic flooded the available Internet connection so that no users could access eBay for a few hours. A distributed denial of service (DDoS) involves many computer systems, possibly hundreds, all sending traffic to a few choice targets. The term \"Denial of Service\" is also used imprecisely to refer to any outwardly-induced condition that renders a computer unusable, thus \"denying service\" to its rightful user.  \n  "
        },
        {
            "word": "DES (Data Encryption Standard)",
            "def": " A commonly-used encryption algorithm that encrypts data using a key of 56 bits, which is considered fairly weak given the speed and power of modern computers. Until recently it was the US government's encryption standard, but it has largely been replaced by Triple-DES and AES. \n See also Triple-DES.  \n  "
        },
        {
            "word": "device",
            "def": " A generic term for computer equipment such as a hub, switch, router, or printer.  \n  "
        },
        {
            "word": "DHCP (Dynamic Host Configuration Protocol)",
            "def": " A standard proposed in RFC 1541 for transferring network configuration information from a central server to devices as the devices boot up. This data typically includes a machine's IP address, which the server can change and allocate automatically (on the fly) under DHCP.  \n  "
        },
        {
            "word": "DHCP server",
            "def": " A device that automatically assigns IP addresses to networked computers from a defined pool of numbers, returning unused IP addresses to the pool. Using a DHCP server, an administrator normally does not have to get involved with the details of assigning IP addresses to individual clients.  \n  "
        },
        {
            "word": "dialog box",
            "def": " A box that appears when you choose a command from a menu. It offers additional options, and requires your acknowledgement before it goes away.  \n  "
        },
        {
            "word": "dial-up connection",
            "def": " A connection between a remote computer and a server, established using software, a modem, and a telephone line.  \n  "
        },
        {
            "word": "dictionary attack",
            "def": " An attempt to guess a password by systematically trying every word in a dictionary as the password. This attack is usually automated, using a dictionary of the hacker's choosing, which may include both ordinary words and jargon, names, and slang.  \n  "
        },
        {
            "word": "Diffie-Hellman",
            "def": " A mathematical algorithm that allows two users to exchange a secret key over an insecure medium without any prior secrets. This protocol, named after the inventors who first published it in 1976, is used in Virtual Private Networking (VPN).  \n  "
        },
        {
            "word": "digital signature",
            "def": " An electronic identification of a person or thing, intended to verify to a recipient the integrity of data sent to them, and the identity of the sender. Creating a digital signature involves elaborate mathematical techniques that the sender and recipient can both perform on the transmitted data. Performing identical formulas on identical data should produce identical results at both the sending and receiving end. If the recipient's results do not equal the sender's results, the message may have been tampered with en route. If the message was modified after being sent -- even if all someone did was change the punctuation on a sentence, or added an extra space between two of the words -- you could tell. A digital signature typically depends upon three elements: public key encryption, a Certificate Authority, and a digital certificate.  \n  "
        },
        {
            "word": "disarmed",
            "def": " The state of a Firebox when it is not actively protecting a network.  \n  "
        },
        {
            "word": "DLL (Dynamic Link Library)",
            "def": " In Microsoft Windows, a Dynamic Link Library is a collection of functions that perform very commonly used tasks. This library is intended to be a universal resource that any program can use, reducing the need to have similar snippets of code existing on a computer in multiple places. Windows comes with many DLLs that programs can use to get the recognized \"Windows\" feel.  \n  "
        },
        {
            "word": "DMZ (Demilitarized Zone)",
            "def": " A partially-protected zone on a network, not exposed to the full fury of the Internet, but not fully behind the firewall. This technique is typically used on parts of the network which must remain open to the public (such as a Web server) but must also access trusted resources (such as a database). The point is to allow the inside firewall component, guarding the trusted resources, to make certain assumptions about the impossibility of outsiders forging DMZ addresses. WatchGuard refers to the DMZ as the Optional network interface.  \n  "
        },
        {
            "word": "DNS (Domain Name System)",
            "def": " A network system of servers that translates numeric IP addresses into readable, hierarchical Internet addresses, and vice versa. This is what allows your computer network to understand that you want to reach the server at 192.168.100.1 (for example) when you type into your browser a domain name such as www.watchguard.com.  \n  "
        },
        {
            "word": "DNS cache poisoning",
            "def": " A clever technique that tricks your DNS server into believing it has received authentic information when, in reality, it has been lied to. Why would an attacker corrupt your DNS server's cache? So that your DNS server will give out incorrect answers that provide IP addresses of the attacker's choice, instead of the real addresses. Imagine that someone decides to use the Microsoft Update Web site to get the latest Internet Explorer patch. But, the attacker has inserted phony addresses for update.microsoft.com in your DNS server, so instead of being taken to Microsoft's download site, the victim's browser arrives at the attacker's site and downloads the latest worm.  \n  "
        },
        {
            "word": "DNS lookup",
            "def": " The Domain Name Service act of matching a friendly, readable domain name (such as www.watchguard.com) to its associated IP address.  \n  "
        },
        {
            "word": "DNS spoofing",
            "def": " An attack technique where a hacker intercepts your system's requests to a DNS server in order to issue false responses as though they came from the real DNS server. Using this technique, an attacker can convince your system that an existing Web page does not exist, or respond to requests that should lead to a legitimate Web site, with the IP address of a malicious Web site. This differs from DNS cache poisoning because in DNS spoofing, the attacker does not hack a DNS server; instead, he inserts himself between you and the server and impersonates the server.  \n  "
        },
        {
            "word": "domain name hijacking",
            "def": " An attack technique where the attacker takes over a domain by first blocking access to the victim domain's DNS server, then putting up a malicious server in its place. For example, if a hacker wanted to take over fnark.com, he would have to remove the fnark.com DNS server from operation using a Denial of Service attack to block access to fnark's DNS server. Then, he would put up his own DNS server, advertising it to everyone on the Internet as fnark.com. When an unsuspecting user went to access fnark.com, he would get the attacker's domain instead of the real one.  \n  "
        },
        {
            "word": "Domain Name System (DNS)",
            "def": " See DNS.  \n  "
        },
        {
            "word": "DoS",
            "def": " See denial of service attack.  \n  "
        },
        {
            "word": "dotted notation",
            "def": " The notation used to write IP addresses as four decimal numbers separated by dots (periods), sometimes called dotted quad. Example: 123.212.12.4. For a full explanation of IP addresses, see the Security Fundamentals article, \"Understanding IP Addresses and Binary.\"  \n  "
        },
        {
            "word": "driver",
            "def": " A software program that manipulates a device (such as a printer, keyboard, mouse, or hard drive). The driver accepts generic commands from a program and then translates them into specialized commands for the device.  \n  "
        },
        {
            "word": "drop-in mode",
            "def": " A network configuration in which the Firebox is physically located between the router and the LAN without any of the computers on the Trusted interface being reconfigured. This is a quick and simplified way to get the Firebox into the network, but can only protect a single network that is not subdivided into smaller networks. \n See also proxy ARP. For a contrasting approach, see routed mode.  \n  "
        },
        {
            "word": "drop-in network",
            "def": " A network being used in drop-in mode. \n See drop-in mode.  \n  "
        },
        {
            "word": "DSA (Digital Signature Algorithm)",
            "def": " A public key digital signature algorithm proposed by the National Institute of Standards and Technology.  \n  "
        },
        {
            "word": "DSS (Digital Signature Standard)",
            "def": " A standard for digital signatures proposed by the National Institute of Standards and Technology.  \n  "
        },
        {
            "word": "DVCP (Dynamic VPN Configuration Protocol)",
            "def": " A WatchGuard proprietary protocol that simplifies configuration of VPNs. A DVCP server provides centralized storage of all configured devices under management and builds Virtual Private Networks quickly and interactively for those devices.  \n  "
        },
        {
            "word": "Dynamic Link Library",
            "def": " See DLL.  \n  "
        },
        {
            "word": "dynamic NAT",
            "def": " On outgoing requests from your network, the Firebox replaces all private IP source addresses with one public address (usually its own). \n See Network Address Translation, and IP masquerading.  \n  "
        },
        {
            "word": "dynamic packet filtering",
            "def": " See stateful packet filtering.  \n  "
        },
        {
            "word": "ECC (Elliptic Curve Cryptosystem)",
            "def": " A method for creating public key algorithms, which some experts claim provides the highest strength-per-bit of any cryptosystem known today. Its algorithms accept an encryption key but then add extra numbers representing the coordinates of points on an imaginary wiggly curve as it crosses an imaginary line. Its complicated algebraic approach allows shorter keys to produce security equivalent to longer keys in other cryptosystems (such as RSA). Shorter keys mean the encryption and decryption can be performed relatively quickly and with less computer hardware. Numerous experts believe ECC will eventually enjoy widespread use.  \n  "
        },
        {
            "word": "elevation of privilege",
            "def": " Almost every computer program has some notion of \"privilege\" built in, meaning, permission to do some set of actions on the system. This permission is granted to individuals based on their ability to present proper credentials (for example, a username and password). Privilege has levels -- for example, a guest account typically has fewer privileges than an administrator account. Many network attacks begin with an attacker obtaining limited privileges on a system, then attempting to leverage those privileges into greater privileges that might ultimately lead to controlling the system. Any attempt to gain greater permissions illicitly (typically, by impersonating a privileged user or otherwise bypassing normal authentication) is considered an elevation of privilege.\"  \n  "
        },
        {
            "word": "encryption",
            "def": " The process of disguising data to hide its content. As used in a network security context, encryption is usually accomplished by putting the data through any of several established mathematical algorithms developed specifically for this purpose.  \n  "
        },
        {
            "word": "entropy",
            "def": " In cryptography, a mathematical measurement of the amount of uncertainty or randomness.  \n  "
        },
        {
            "word": "ESMTP (Extended Simple Mail Transfer Protocol)",
            "def": " A protocol that provides extensions to SMTP for sending e-mail that supports graphics, audio, and video files, and text in various foreign languages. These extensions were first described in RFC 1869.  \n  "
        },
        {
            "word": "ESP (Encapsulating Security Payload)",
            "def": " An IPSec protocol used in WatchGuard's Branch Office VPN. ESP encrypts all or part of a packet of data in a way that assures confidentiality even though the data travels over the public Internet. It provides data integrity, and offers assurance of the identity of the data's sender (authentication). For details, see RFC 1827.  \n  "
        },
        {
            "word": "Ethernet",
            "def": " One of the least expensive, most widely deployed networking standards, enabling the transmission of data at 10 million bits per second (Mbps), using a specified protocol. A more recent Ethernet standard, called 100BaseTx, enables data to be transmitted and received at 100 Mbps.  \n  "
        },
        {
            "word": "Ethernet address",
            "def": " A unique ID number obtained automatically when an Ethernet adapter is added to a computer. This address identifies the machine as a unique communication item and enables direct communications to and from that particular computer. \n See also MAC address.  \n  "
        },
        {
            "word": "event",
            "def": " Any network incident that prompts some kind of log entry or other notification.  \n  "
        },
        {
            "word": "Event processor",
            "def": " See WatchGuard Security Event Processor.  \n  "
        },
        {
            "word": "Evil twin",
            "def": " A wireless access point masquerading as a trusted wireless network. Attackers use an evil twin to trick unsuspecting users into connecting to their network. Once the victim connects, the attacker can steal passwords or other sensitive information by either capturing unencrypted HTTP traffic or using their control of the network traffic to perform convincing phishing attacks.  \n  "
        },
        {
            "word": "extension",
            "def": " See file extension.  \n  "
        },
        {
            "word": "External interface",
            "def": " On the Firebox, an Ethernet port intended for connecting to the portion of your network that presents the greatest security risk (typically the Internet and any other switches, routers, or servers connected to, but outside, your network).  \n  "
        },
        {
            "word": "External network",
            "def": " Any network that can connect to yours, with which you have neither a trusted or semi-trusted relationship. For example, a company's employees would typically be trusted on your network, a primary vendor's network might be semi-trusted, but the public Internet would be untrusted  hence, External.  \n  "
        },
        {
            "word": "failover",
            "def": " A configuration that allows a secondary machine to take over in the event of a stoppage in the first machine, thus allowing normal use to return or continue. \n See also high availability.  \n  "
        },
        {
            "word": "failover logging",
            "def": " A process in which the Firebox immediately establishes contact with a secondary log host, in the event that the Firebox cannot communicate with the primary log host.  \n  "
        },
        {
            "word": "fail-shut mode",
            "def": " A condition in which a firewall blocks all incoming and outgoing network traffic in the event of a firewall failure. This is the opposite of fail-open mode, in which a firewall crash opens all traffic in both directions. Fail-shut is the default failure mode of the WatchGuard Firebox System.  \n  "
        },
        {
            "word": "fast Ethernet",
            "def": " An Ethernet networking system that transmits data at 100 million bits per second (Mbps), ten times the speed of an earlier Ethernet standard. Derived from the Ethernet 802.3 standard, it is also known as 100Base-T.  \n  "
        },
        {
            "word": "file server",
            "def": " A dedicated network computer that stores data files so that other computers can share access to them. \n See also client/server.  \n  "
        },
        {
            "word": "filtering process",
            "def": " Deciding whether a packet should be allowed or denied, depending on what is contained in its header or its contents, based on user-defined policies.  \n  "
        },
        {
            "word": "fingerprint",
            "def": " A unique identifier for a key that is obtained by hashing specific portions of the key data. \n See one-way hash function.  \n  "
        },
        {
            "word": "file extension",
            "def": " Under Windows, a period and up to three characters at the end of a file name. The extension can help identify the type of file, and often helps a computer know what to do with the file. For example, if a file is named glossary.exe, the file extension is \".exe.\" The .exe tells a Windows computer that the glossary file is executable.  \n  "
        },
        {
            "word": "filters",
            "def": " Small, fast programs in a firewall that examine packets as they arrive at the firewall, and route or reject the packets based on user-definable rules.  \n  "
        },
        {
            "word": "Firebox",
            "def": " The WatchGuard firewall appliance.  \n  "
        },
        {
            "word": "Firebox Monitors",
            "def": " A suite of WatchGuard Firebox System observation tools combined into a single user interface accessible from Firebox System Manager. Firebox Monitors allows you to keep an eye on bandwidth usage, who has authenticated to the Firebox, what Web sites have been automatically blocked because they sent questionable traffic, and more.  \n  "
        },
        {
            "word": "Firebox System Manager",
            "def": " WatchGuard's toolkit of applications enabling configuration, management, and monitoring of a network security policy.  \n  "
        },
        {
            "word": "firewall",
            "def": " Software or hardware components that restrict access between a protected network and the Internet, or between other sets of networks, to block unwanted use or abuse.  \n  "
        },
        {
            "word": "flash disk",
            "def": " An 8-megabyte, on-board flash ROM disk that acts like a hard disk in a Firebox. The word \"flash\" arises from the fact that it can be erased and reprogrammed rapidly, in blocks instead of one byte at a time.  \n  "
        },
        {
            "word": "forward DNS lookup",
            "def": " See DNS lookup  \n  "
        },
        {
            "word": "FQDN (Fully Qualified Domain Name)",
            "def": " A fully qualified domain name consists of a host and domain name, including a top-level domain such as .com, .net, .gov, .edu, etc. For example, www.watchguard.com is a fully qualified domain name. www is the local host, watchguard is the second-level domain, and .com is the top level domain.  \n  "
        },
        {
            "word": "FTP (File Transfer Protocol)",
            "def": " The most common protocol for copying files over the Internet. \n See also active mode FTP.  \n  "
        },
        {
            "word": "Fully Qualified Domain Name",
            "def": " See FQDN.  \n  "
        },
        {
            "word": "Function",
            "def": " In programming, a function is part of a program that performs a specific task. Computer programs usually consist of modules of code. Each module consists of a small part of the program written to perform one specific task. These small, special-purpose chunks of code are called functions. When a program runs, it calls different functions to perform certain tasks. For example, a programmer could write a function to alphabetize a list of names. When the program got to the place where it needed to alphabetize a list of names, the program would call the alphabetizing function, and the function would return the list of names in the correct order. If those names then had to be inserted into a database, the program might call a different function to accomplish that. \n See also parameter and Dynamic Link Libraries.  \n  "
        },
        {
            "word": "gateway",
            "def": " A system that provides access between two or more networks. Gateways are typically used to connect networks that are dissimilar. The Firebox often serves as the gateway between the Internet and your network.  \n  "
        },
        {
            "word": "GUI (Graphical User Interface)",
            "def": " The visual representation on a computer screen that allows users to view, enter, or change information. It is characterized by icons and commonly utilizes a mouse, in contrast to a Command Line Interface (CLI), which uses strictly text.  \n  "
        },
        {
            "word": "handshake",
            "def": " See TCP handshake.  \n  "
        },
        {
            "word": "hash code",
            "def": " A unique, mathematical summary of a document that serves to identify the document and its contents. \n See message digest.  \n  "
        },
        {
            "word": "header",
            "def": " A series of bytes at the beginning of a communication packet that provides information about the packet such as its computer of origin, the intended recipient, packet size, and destination port number. The header of a packet is like the envelope of a traditionally-mailed letter, in that it conveys \"return address\" and \"intended recipient\" information but is not the real content of the message.  \n  "
        },
        {
            "word": "hexadecimal",
            "def": " A base-16 numbering system (from hexadecem, Latin for 16) particularly important in computer programming, since four bits (each consisting of a one or zero) are succinctly expressed using a single hexadecimal digit. Hexadecimal resembles decimal (base-10) numbering with the digits 0 through 9, but the decimal equivalents of 10 - 16 are represented in hexadecimal by the letters A through F. Example: the decimal number 252 is written in hexadecimal as FC.  \n  "
        },
        {
            "word": "hierarchical trust",
            "def": " A method of organizing \"trust\" within an organization by allowing one Certificate Authority to delegate a portion of its responsibility to a subordinate Certificate Authority. For example, a business might have a master Certificate Authority, which vouches for a Certificate Authority at the company's Los Angeles office, which vouches for a Certificate Authority at the company's Phoenix office. Commonly used in ANSI X.509 certificates.  \n  "
        },
        {
            "word": "High Availability",
            "def": " High Availability enables the installation of two Fireboxes so that if one fails for any reason, the other takes over immediately. This minimizes data loss while the failed box is replaced or repaired..  \n  "
        },
        {
            "word": "Historical Reports",
            "def": " A WatchGuard Firebox System application that creates HTML reports of Firebox log files, displaying session types, most active hosts, most used services, and other information useful in monitoring and troubleshooting a network.  \n  "
        },
        {
            "word": "HMAC (Hashed Message Authentication Code)",
            "def": " A mechanism for message authentication, using cryptographic one-way hash functions, based upon RFC 2104 and commonly used in VPNs. The end result is that when you receive a data packet, you can know that whoever sent the packet possesses the same secret key that you do. You can combine this with other technologies, such as IKE, to know who sent a given message.  \n  "
        },
        {
            "word": "home page",
            "def": " The first page of a multi-page Web site, used as an entrance into the site.  \n  "
        },
        {
            "word": "host",
            "def": " A network-connected computer.  \n  "
        },
        {
            "word": "host route",
            "def": " A network configuration where a router sits between the Firebox and an internal host. For the Firebox to be able to send data to the host, it must be informed of the existence of the additional router (and the host behind it). This entry in the Firebox's routing table is the host route.  \n  "
        },
        {
            "word": "HostWatch",
            "def": " A WatchGuard Firebox System Manager application that provides a real-time display of which hosts are connected from behind the Firebox to hosts on the Internet.  \n  "
        },
        {
            "word": "HTML (HyperText Markup Language)",
            "def": " A simple programming language used to format Web pages, including methods to specify text characteristics, graphic placement, and links. HTML files are written in plain text, then read or interpreted by a Web browser.  \n  "
        },
        {
            "word": "HTTP (HyperText Transfer Protocol)",
            "def": " A communications standard designed and used to transfer information and documents between servers or from a server to a client. This standard is what enables your Web browser to fetch pages from the World Wide Web.  \n  "
        },
        {
            "word": "HTTPS (Secure HTTP)",
            "def": " A variation of HTTP enabling the secure transmission of data. Generally used in conjunction with Secure Sockets Layer (SSL), which encrypts the HTTP.  \n  "
        },
        {
            "word": "hub",
            "def": " A device that serves as a common connection point for multiple devices on a network. There are several different types of hubs, but in general each receives and sends signals to all the devices connected to it.  \n  "
        },
        {
            "word": "hyperlink",
            "def": " An object on a Web page such as a graphic or underlined text that represents a link to another location, either on the same Web site or on a different Web site. When a user clicks on a hyperlink, a page or graphic from the linked location appears in the user's Web browser.  \n  "
        },
        {
            "word": "IANA (Internet Assigned Number Authority)",
            "def": " The central authority charged with assigning parameter values (numbers) to Internet protocols. For example, IANA controls the assignment of well-known TCP/IP port numbers. Currently IANA manages port numbers 1 through 1023.  \n  "
        },
        {
            "word": "ICANN (Internet Corporation for Assigned Names and Numbers )",
            "def": " A non-profit, private-sector corporation formed by a broad coalition of the Internet's business, technical, academic, and user communities. ICANN has been recognized by the U.S. and other governments as the global consensus entity to coordinate the technical management of the Internet's domain name system, the allocation of IP address space, the assignment of protocol parameters, and the management of the root server system.  \n  "
        },
        {
            "word": "ICMP (Internet Control Message Protocol)",
            "def": " A protocol used to pass control and error messages back and forth between nodes on the Internet. Perhaps the most used ICMP command is ping.  \n  "
        },
        {
            "word": "identity certificate",
            "def": " A signed statement that binds a public encryption key to the name of an individual and therefore delegates authority from that individual to the public key. Any message encrypted with that person's public key can then be regarded as being from that person.  \n  "
        },
        {
            "word": "IDS (Intrusion Detection System)",
            "def": " A class of networking products devoted to detecting attacks from hackers. Network-based intrusion detection systems examine the traffic on a network for signs of unauthorized access or attacks in progress, while host-based systems look at processes running on a local machine for activity an administrator has defined as \"bad.\"  \n  "
        },
        {
            "word": "IEEE (Institute of Electrical and Electronics Engineers)",
            "def": " Pronounced \"eye-triple-E.\" An organization of engineers, scientists, and students who issue standards related to electrical, electronic, and computer engineering. For example, IEEE developed the standards for using Ethernet, token ring, and WiFi.  \n  "
        },
        {
            "word": "IETF (Internet Engineering Task Force)",
            "def": " A large, open international community of network designers, operators, vendors, and researchers concerned with the evolution of the Internet architecture and the smooth operation of the Internet. IANA is chartered by one of the IETF's working groups.  \n  "
        },
        {
            "word": "IKE (Internet Key Exchange)",
            "def": " A standard proposed in RFC 2409 used with IPSec virtual private networks (VPNs) for automating the process of negotiating encryption keys, changing keys, and determining when to change keys. IKE first mutually authenticates the two endpoints that plan to set up IPSec tunnels between them; then the endpoints can establish mutually agreed-upon security parameters. For more, see IPSec and VPN.  \n  "
        },
        {
            "word": "initialization vector",
            "def": " A block of arbitrary data that serves as the starting point for a block cipher like Triple-DES. \n See also cipher block chaining.  \n  "
        },
        {
            "word": "initialize",
            "def": " To prepare (a disk) for information storage.  \n  "
        },
        {
            "word": "installation wizard",
            "def": " A software tool specifically designed to guide a user through the process of installing a new application.  \n  "
        },
        {
            "word": "integrity; data integrity",
            "def": " The concept that you can discern whether data is in the condition its authors or owners intend it to be, and that it has not been modified by unauthorized persons during storage or transmittal.  \n  "
        },
        {
            "word": "interface",
            "def": " A boundary across which two independent systems meet and act on or communicate with each other. The term sometimes refers to the wires, plugs, and sockets that hardware devices use to communicate with each other. Other times, it refers to the style in which a software program receives and responds to user input; for example, command line interface or graphical user interface.  \n  "
        },
        {
            "word": "Internet address class",
            "def": " Historically, to efficiently administer the whole range of possible 32-bit IP addresses, the addresses were separated into three classes that describe networks of varying sizes:  \n  Class A - If the first octet of an IP address is less than 128, it is a Class A address. A network with a Class A address can have up to about 16 million hosts. \n Example: 64.64.10.1.  \n  Class B - If the first octet of an IP address is from 128 to 191, it is a Class B address. A network with a Class B address can have up to 64,000 hosts. \n Example: 155.155.24.301.  \n  Class C - If the first octet of an IP address is from 192 to 223, it is a Class C address. A network with a Class C address can have up to 254 hosts. \n Example: 192.168.14.4.  \n  Modern addressing techniques favor classless routing, rendering these class categorizations less and less relevant. For a full discussion of the topic, see the following Security Fundamentals articles: \"Understanding IP Addresses and Binary,\" \"Understanding IPv4 Subnetting (Part 1),\" and \"Understanding IPv4 Subnetting (Part 2).\" For a briefer treatment, see network address.  \n  "
        },
        {
            "word": "Internet Engineering Task Force",
            "def": " See IETF.  \n  "
        },
        {
            "word": "intranet",
            "def": " A self-contained network with a limited number of participants who extend limited trust to one another in order to accomplish an agreed-upon goal. For example, a manufacturer and its key vendors might create an intranet to facilitate managing the process of turning raw materials into finished products.  \n  "
        },
        {
            "word": "Intrusion Detection System",
            "def": " See IDS.  \n  "
        },
        {
            "word": "IP (Internet Protocol)",
            "def": " A fundamental set of detailed specifications that controls how data packets are formatted and how they move from one networked computer to another.  \n  "
        },
        {
            "word": "IP address",
            "def": " An understanding of IP addresses is foundational for managing a network, so we go into some depth with this definition.  \n  In short, an IP address is a numeric identifier that represents a computer or device on a TCP/IP network. The devices on the network rely on the address in order to know where to route data.  \n  The format of an IP address is a 32-bit number divided into four 8-bit segments, separated by periods. The four segments, called octets, can be represented in binary notation (ones and zeros, the basic building blocks of all software) like this: 11010000.10001100.00100011.00000010. Because writing so many ones and zeros is inefficient and laborious for humans, IP addresses are usually converted to decimal notation when written out (but remember, the machines always understand them as ones and zeros). For example, the same binary address above, expressed in decimal, is 208.140.35.2. In decimal notation, no octet can have a value greater than 255. This is because binary requires 9 ones and zeros to express a number greater than 255, and the rules for IP addresses only allow 8.  \n  Some portion of any IP address designates a network, and the remaining portion of the address designates a specific device on that network. For more information, see network address, Internet address class, and subnet mask. You can also read the Security Fundamentals article, \"Understanding IP Addresses and Binary.\"  \n  "
        },
        {
            "word": "IP fragment",
            "def": " A formatted portion of data that is part of a larger IP packet. IP fragments are typically used when an IP packet is too large for the physical media that the data must cross. For example, the IP standard for Ethernet limits IP packets to about 1,500 bytes, but the maximum IP packet size is 65,536 bytes. To send packets larger than 1,500 bytes over an Ethernet, IP fragments must be used.  \n  "
        },
        {
            "word": "IP masquerading",
            "def": " See NAT.  \n  "
        },
        {
            "word": "IP options",
            "def": " Extensions to the Internet Protocol used mainly for debugging and for special applications on local networks. In general, there are no legitimate uses of IP options over an Internet connection.  \n  "
        },
        {
            "word": "IP options attack",
            "def": " A method of gaining unauthorized network access by utilizing IP options.  \n  "
        },
        {
            "word": "IPSec (Internet Protocol Security)",
            "def": " An open-standard methodology of exchanging data over the public Internet while protecting the data from prying eyes as it travels from the originator to the recipient. IPSec provides encryption and authentication options to maximize the confidentiality of data transmissions, employing cryptographic protocols in conjunction with IKE and ISAKMP. The IETF chartered the IPSec work group to provide cryptographic security services that will flexibly support combinations of authentication, integrity, access control, and confidentiality. IPSec standards are commonly employed when establishing a VPN.  \n  "
        },
        {
            "word": "IP spoofing",
            "def": " The act of inserting a false (but ordinary-seeming) sender IP address into the \"From\" field of an Internet transmission's header in order to hide the actual origin of the transmission. There are few, if any, legitimate reasons to perform IP spoofing; the technique is usually one aspect of an attack.  \n  "
        },
        {
            "word": "ISAKMP (Internet Security Association Key Management Protocol)",
            "def": " A set of specifications defined in RFC 2408 and used in close conjunction with IPSec. Defines the procedures for authenticating, creating and managing security associations, generating keys, and using digital certificates when establishing VPN connections.  \n  "
        },
        {
            "word": "ISO (International Organization for Standardization)",
            "def": " An international organization composed of national standards bodies from over 75 countries. For example, ANSI (American National Standards Institute) is a member of ISO. ISO has defined a number of important computer standards, the most significant of which is perhaps OSI (Open Systems Interconnection), a standardized architecture for designing networks.  \n  "
        },
        {
            "word": "ISP (Internet service provider)",
            "def": " A business that sells access to the Internet. A government bureau or an educational institution may be the ISP for some organizations.  \n  "
        },
        {
            "word": "ITU-T (International Telecommunication Union-Telecommunication)",
            "def": " Formerly the CCITT (Consultative Committee for International Telegraph and Telephone), a worldwide telecommunications technology standards organization. Just as IETF and ICANN propose and maintain standards for the Internet, ITUT proposes and establishes standards for international telephony.  \n  "
        },
        {
            "word": "IV",
            "def": " See initialization vector.  \n  "
        },
        {
            "word": "Java applet",
            "def": " A small program written in the Java programming language that can be included on an HTML page, much in the same way an image is included. When someone uses a Java-enabled browser to view a page that contains an applet, the applet's code is transferred to that user's system and executed by the browser's Java virtual machine (JVM). For example, if you access a Web page that shows a virtual stock ticker streaming by with live data, that might be enabled by a Java applet.  \n  "
        },
        {
            "word": "Kerberos",
            "def": " A trusted third-party authentication protocol developed at Massachusetts Institute of Technology and used widely in the United States. Unlike other authentication schemes, Kerberos does not use public key technology. Instead, it uses symmetric ciphers and secrets shared between the Kerberos server and each individual user. Each user has a unique password, and the Kerberos server uses this password to encrypt messages sent to that user, so the message can't be read by anyone else.  \n  "
        },
        {
            "word": "key",
            "def": " A secret code, most often expressed as a numeric value, used to encrypt a message, to make the text unreadable to anyone but the intended recipient. If a message encrypted by a key must be decrypted by using the same key, the key is called a symmetric key. If a message encrypted by a key must be decrypted using a different key, the keys are called asymmetric keys, or a key pair. Key pairs (usually comprised of a public key and a private key) form the basis of public key cryptography.  \n  "
        },
        {
            "word": "key exchange",
            "def": " A scheme for two or more nodes to transfer a secret session key across an unsecured channel, such as the Internet.  \n  "
        },
        {
            "word": "key fingerprint",
            "def": " A uniquely identifying string of numbers and characters used to authenticate public keys.  \n  "
        },
        {
            "word": "key ID",
            "def": " A code that uniquely identifies a key pair. Two key pairs can have the same user ID, but they have different key IDs. \n See also key and key fingerprint.  \n  "
        },
        {
            "word": "key length",
            "def": " The number of bits representing the key size; the longer the key, the stronger it is.  \n  "
        },
        {
            "word": "key management",
            "def": " The process and procedure for safely storing and distributing accurate cryptographic keys; the overall process of generating and distributing cryptographic keys to authorized recipients in a secure manner.  \n  "
        },
        {
            "word": "key pair",
            "def": " Public key cryptography uses a pair of key codes related to each other in this way: if you lock-up data using one key code, you can only unlock it using the other key code. And vice versa. One of the keys is made known publicly, while the other is kept private. The two, together, form a key pair. \n See also key and keyring.  \n  "
        },
        {
            "word": "keyring",
            "def": " A set of digital codes, or keys, used to encrypt and decrypt messages in asymmetric cryptography. Each user has two types of keyrings: a private keyring and a public one. People who wish to receive encrypted messages typically publish their public keys in directories or make their keys otherwise available. To send them an encrypted message, all you have to do is get a copy of their public key, use the public key to encrypt your message, and send it to them. The only person who can decrypt the message is the person who possesses the matching private key.  \n  "
        },
        {
            "word": "key splitting",
            "def": " The process of dividing a private key into multiple pieces and sharing those pieces among several users. A designated number of users must bring their shares of the key together to use the key.  \n  "
        },
        {
            "word": "LAN (local area network)",
            "def": " A computer network that spans a relatively small area, generally confined to a single building or group of buildings.  \n  "
        },
        {
            "word": "LDAP (Lightweight Directory Access Protocol)",
            "def": " A protocol that helps manage information about authorized users on a network such as names, phone numbers, addresses, and what a user is and is not allowed to access. LDAP is vendor- and platform-neutral, working across otherwise incompatible systems.  \n  "
        },
        {
            "word": "LED (light-emitting diode)",
            "def": " A small indicator light on a networking device that indicates status and other information about the device. For example, an LED on the WatchGuard SOHO blinks to indicate when the SOHO is receiving data.  \n  "
        },
        {
            "word": "link",
            "def": " See hyperlink.  \n  "
        },
        {
            "word": "Linux",
            "def": " An open source version of the UNIX operating system.  \n  "
        },
        {
            "word": "LiveSecurity Service",
            "def": " See WatchGuard LiveSecurity Service.  \n  "
        },
        {
            "word": "log host, logging host",
            "def": " A designated device for receiving and storing a record of events from another device or program (such as a Firebox, SOHO, or ServerLock).  \n  "
        },
        {
            "word": "LogViewer",
            "def": " A WatchGuard Firebox System Manager application for viewing Firebox log files.  \n  "
        },
        {
            "word": "loopback interface",
            "def": " A special type of interface that allows you to make network connections to yourself, using IP. This convention, which all Internet-aware applications expect and utilize, has a variety of purposes, including routing and application testing.  \n  "
        },
        {
            "word": "MAC (Machine Authentication Code)",
            "def": " A way to check the integrity of information transmitted over, or stored on, an unreliable medium, based on a secret key. Typically, MACs are used between two parties who share a secret key, in order to validate the information transmitted between the two parties. key-dependent, one-way hash function, requiring the use of the identical key to verify the hash. \n See also HMAC.  \n  "
        },
        {
            "word": "MAC address (Media Access Control)",
            "def": " One of the two addresses every networked computer has (the other being an IP address), a Media Access Control address is a unique 48-bit identifier usually written as 12 hexadecimal characters grouped in pairs (e. g., 00-00-0c-34-11-4e). This address is usually hard-coded into a Network Interface Card (NIC) by its manufacturer, and does not change. It is the physical address of a data device, and is used as an aid for routers trying to locate machines on large networks. \n See also ARP and Ethernet address.  \n  "
        },
        {
            "word": "mail server",
            "def": " Refers to both the application and the physical machine tasked with routing incoming and outgoing electronic mail.  \n  "
        },
        {
            "word": "Management Station",
            "def": " The computer on which the WatchGuard Firebox System Firebox System Manager and Policy Manager run. In its simplest terms, this is the computer you use to configure and monitor a WatchGuard Firebox.  \n  "
        },
        {
            "word": "masquerading",
            "def": " In the WatchGuard Firebox System, masquerading sets up addressing so that a Firebox presents its IP address to the outside world in place of the private IP addresses of the hosts protected by the Firebox. \n See also NAT.  \n  "
        },
        {
            "word": "MD2 (Message Digest 2)",
            "def": " 128-bit, one-way hash function that is dependent on a random permutation of bytes. MD2 is considered very secure, but takes a long time to compute, and therefore is rarely used. \n See also message digest.  \n  "
        },
        {
            "word": "MD4 (Message Digest 4)",
            "def": " A 128-bit, one-way hash function that uses a simple set of bit manipulations on 32-bit operands, developed as a weaker but faster alternative to MD2. \n See also message digest.  \n  "
        },
        {
            "word": "MD5 (Message Digest 5)",
            "def": " A more secure, more complex version of MD4, but still a 128-bit, one-way hash function. Although now widely used, MD5 contains a few flaws discovered in 1996 making it slightly weaker, so it is gradually falling out of favor in deference to another message digest function known as SHA-1. \n See also message digest.  \n  "
        },
        {
            "word": "message digest",
            "def": " A mathematical function used in encryption to distill the information contained in a file into a single large number, typically between 128 and 256 bits in length. Message digests are also known as one-way hash functions because they produce results where it is mathematically infeasible to try to calculate the original message by computing backwards from the result. Message digest functions are designed so that a change to a single character in the message will cause the message to result in a very different message digest number. Many different message digest functions have been proposed and are now in use; most are considered highly resistant to attack.  \n  "
        },
        {
            "word": "MIME (Multipurpose Internet Mail Extensions)",
            "def": " A specification for formatting non-ASCII messages so that they can be sent over the Internet. Many e-mail clients now support MIME, which enables them to send and receive graphics, audio, and video files via the Internet mail system. In addition, MIME supports messages in character sets other than ASCII.  \n  "
        },
        {
            "word": "MIME type",
            "def": " Though MIME was developed for email (SMTP), it proved so useful that other application protocols also adopted it. For example, HTTP uses MIME headers to indicate what sort of data is being transferred. RFC 2046 defines how MIME can handle various media types, such as image, audio, video, and application. MIME content types are expressed as a type and a subtype, separated by a slash. (Example: image/jpeg).  \n  "
        },
        {
            "word": "modem",
            "def": " A shortened version of \"modulator/demodulator,\" this is the word for a communications device that sends computer transmissions over a standard telephone line.  \n  "
        },
        {
            "word": "motherboard",
            "def": " The main printed circuit board in a computer, which contains sockets that accept additional boards (daughterboards).  \n  "
        },
        {
            "word": "MSDUN",
            "def": " An abbreviation for Microsoft Dial-Up Networking, required for remote user VPN.  \n  "
        },
        {
            "word": "multiple network configuration",
            "def": " See routed mode.  \n  "
        },
        {
            "word": "name resolution",
            "def": " The successful look-up of an IP address to discover the name of the networked computer it indicates. \n See DNS.  \n  "
        },
        {
            "word": "NAT (Network Address Translation)",
            "def": " A technology where you advertise one IP address for the world to send stuff to (e-mails, HTTP, database traffic, whatever). Then the Firebox translates that request from the outside world and sends it to the appropriate IP address inside your network. In this way, the Firebox can hide from outsiders the IP addresses of machines on your internal network. Various techniques for applying NAT include dynamic NAT, and static NAT. Some people use the term NAT interchangeably with masquerading.  \n  "
        },
        {
            "word": "National Institute for Standards and Technology",
            "def": " See NIST.  \n  "
        },
        {
            "word": "NetBIOS (Network Basic Input/Output System)",
            "def": " An older proprietary Microsoft networking protocol that enables a computer to connect to and communicate with a Local Area Network (LAN).  \n  "
        },
        {
            "word": "NetBEUI (NetBIOS Extended User Interface)",
            "def": " A non-routable networking protocol used by smaller, non-subnetted networks for internal communications. Because NetBEUI is not publicly routable, network transmissions sent via NetBEUI cannot be transmitted over the Internet.  \n  "
        },
        {
            "word": "network address",
            "def": " The network portion of an Internet Protocol (IP) address. For a Class A network, the network address is the first byte of the IP address (e.g., in 74.10.10.10, the network address is 74). For a class B network, the network address is the first two bytes of the IP address (e.g., in 128.10.10.10, the network address is 128.10). For a class C network, the network address is the first three bytes of the IP address (e.g., in 192.168.10.10, the network address is 192.168.10). In each case, the remaining bits can be used to identify specific computers, often called hosts. In the Internet, assigned network addresses are globally unique; that is, a computer cannot have the same IP address as any other computer with which it can communicate. \n See also CIDR block addressing, Internet address class, and subnet mask. For a very full discussion of these concepts, see the Security Fundamentals articles, \"Understanding IP Addresses and Binary,\" \"Understanding IPv4 Subnetting (Part 1),\" and \"Understanding IPv4 Subnetting (Part 2).\"  \n  "
        },
        {
            "word": "network address translation",
            "def": " See NAT.  \n  "
        },
        {
            "word": "netmask",
            "def": " See subnet mask.  \n  "
        },
        {
            "word": "Network Configuration wizard",
            "def": " Automated software presenting a series of windows. The various windows and fields prompt you for essential information that helps create a basic Firebox configuration.  \n  "
        },
        {
            "word": "network adaptor, network interface card (NIC)",
            "def": " A device that sends and receives data between the computer and the network cabling. Every computer attached to a network must have a NIC.  \n  "
        },
        {
            "word": "network range",
            "def": " See subnet mask.  \n  "
        },
        {
            "word": "network segment",
            "def": " A subdivision of a computer network, bounded by a device such as a router, switch, or even a Firebox. Dividing an Ethernet into multiple segments is a common way of increasing available bandwidth on the individual segments.  \n  "
        },
        {
            "word": "NFS (Network File System)",
            "def": " A popular TCP/IP service for providing shared file systems over a network. NFS allows all network users to access shared files stored on computers of different types. A user can manipulate shared files as if the files were stored locally on the user's own hard disk. NFS is typically found on Unix computers.  \n  "
        },
        {
            "word": "NIST (National Institute for Standards and Technology)",
            "def": " A division of the U.S. Department of Commerce that publishes open interoperability standards called Federal Information Processing Standards (FIPSs). Part of NIST's charter is to distribute complete and accurate information about computer security issues to government and the general public.  \n  "
        },
        {
            "word": "node",
            "def": " A computer or CPU on a network.  \n  "
        },
        {
            "word": "non-seed router",
            "def": " A router that waits to receive information (the routing maintenance table) from other routers on the network before it begins routing packets.  \n  "
        },
        {
            "word": "NTP (Network Time Protocol)",
            "def": " An Internet service used to synchronize clocks among Internet hosts. Properly configured, NTP can usually keep the clocks of participating hosts within a few milliseconds of each other.  \n  "
        },
        {
            "word": "Oakley",
            "def": " The Oakley Session Key Exchange provides a hybrid Diffie-Hellman session key exchange for use within the ISAKMP framework. Oakley provides the important property of Perfect Forward Secrecy (PFS).  \n  "
        },
        {
            "word": "octet",
            "def": " A byte. Used instead of \"byte\" in most IP documents because historically many hosts did not use 8-bit bytes. For a full discussion, read the Security Fundamentals article, \"Understanding IP Addresses and Binary.\"  \n  "
        },
        {
            "word": "one-time pad",
            "def": " A stack of papers bound together, with each paper providing one large, non-repeating set of truly random letters and/or numbers used as an encryption key. Widely used in World War II, the method consisted of using the key on a page exactly once, then tearing off the page and using the key on the next page for the next message. Since the key changes with every message, the enemy does not have a feasible chance to decrypt any given message; thus, one-time pads are considered the only perfect encryption scheme -- as long as the bad guys don't intercept a copy of the pad.  \n  "
        },
        {
            "word": "one-way hash function",
            "def": " A mathematical process performed on data to produce a numeric result called a message digest, which cannot be reversed to produce the original message. \n See hash and message digest.  \n  "
        },
        {
            "word": "open source software",
            "def": " A term applied when the source code of a computer program is made available free of charge to the general public. The reason for doing so is that potentially, a larger group of programmers will produce a more useful and bug-free product than a smaller group of programmers, and that more people will use software that is free. The concept relies on peer review to find and eliminate bugs in the program code, which happens at a much quicker rate than with commercial software because the information is shared throughout the open source community instead of through a corporation's smaller, proprietary R & D department. One of the most famous examples of open source software is Linux.  \n  "
        },
        {
            "word": "Optional interface",
            "def": " The Ethernet port on the Firebox provided so you can connect a second secured network. This second network is often referred to as the \"demilitarized zone\" (DMZ), or the Optional network.  \n  "
        },
        {
            "word": "Optional network",
            "def": " A network architecture used by an organization that wants to host its own Internet services without allowing unauthorized access to its private network. Typically, the Optional network contains devices accessible to public Internet traffic, such as Web (HTTP) servers, FTP servers, SMTP (e-mail) servers and DNS servers. Access from the Optional network to the Trusted network can then be appropriately restricted by the firewall. For that reason, some refer to the Optional network as a \"semi-public\" network.  \n  "
        },
        {
            "word": "out-of-band (OOB)",
            "def": " A management feature that enables the Management Station to communicate with the Firebox via a telephone line and a modem. OOB is very useful for remotely configuring a Firebox when Ethernet access is unavailable.  \n  "
        },
        {
            "word": "packet",
            "def": " A unit of information formatted according to specific protocols that allow precise transmittal of data from one node in a network to another. Also called a datagram or a data packet, it contains two parts: a header and a payload. The header is like an envelope; the payload is the contents. In Internet Protocol, any message that is larger than 1,500 bytes gets fragmented into packets for transmission.  \n  "
        },
        {
            "word": "packet filtering",
            "def": " Controlling access to a network by analyzing the headers of incoming and outgoing packets, and letting them pass or halting them based on rules created by a network administrator. A packet filter allows or denies packets depending on where they are going, from whom they are sent, or what port they use. Packet filtering is one technique, among many, for implementing security firewalls.  \n  "
        },
        {
            "word": "PAP (Password Authentication Protocol)",
            "def": " An identity verification method used to send a user name and password over a network to a computer that compares the user name and password to a table listing authorized users. WatchGuard products do not support this authentication method because the user name and password travel as clear text that a hacker could read. \n See also CHAP.  \n  "
        },
        {
            "word": "parameter",
            "def": " In programming, some value passed to a function. The function either uses the parameter in its task, or performs an operation on the parameter. A parameter can be a value such as a number, a name, or even a file. For instance, a function that alphabetizes might not know what text file to alphabetize unless a file name is passed to the function as a parameter. The function might not know whether to print the alphabetized list, display it on a screen, or save it as a new file unless one of those options is also expressed as a parameter. A parameter can also be referred to as an argument.  \n  "
        },
        {
            "word": "passive mode FTP",
            "def": " See active mode FTP.  \n  "
        },
        {
            "word": "passphrase",
            "def": " An easy-to-remember phrase which offers better security than a single-word password, because it is longer and thus harder to guess or calculate.  \n  "
        },
        {
            "word": "password",
            "def": " A secret sequence of characters or a word that a user submits to a system for purposes of authentication, validation, or verification. WatchGuard recommends the use of passphrases in place of passwords.  \n  "
        },
        {
            "word": "password caching",
            "def": " The temporary storage of a user's username and password by some application.  \n  "
        },
        {
            "word": "peer-to-peer",
            "def": " Sometimes abbreviated as P2P, this is a method of distributing files over a network where all computers are treated as equals (in contrast to a client/server architecture). Using P2P client software, a client can receive files from another client. Some P2P file distribution systems require a centralized database of available files (such as Napster), while other distribution systems like Gnutella are decentralized.  \n  "
        },
        {
            "word": "perfect forward secrecy (PFS)",
            "def": " A cryptosystem in which, if one encryption key is compromised, only the data encrypted by that specific key is compromised. Some cryptosystems allow keys to be derived from previous keys, so that if the first key is compromised, an attacker might have enough information to figure out other keys and/or decrypt data encrypted using those keys. RFC 2409 describes PFS in detail.  \n  "
        },
        {
            "word": "PGP (Pretty Good Privacy)",
            "def": " An application and protocol (RFC 1991) for secure e-mail and file encryption. PGP uses a variety of algorithms (like RSA, DSA, MD5, SHA-1) to provide encryption, authentication, message integrity, and key management.  \n  "
        },
        {
            "word": "PGP/MIME",
            "def": " An IETF standard (detailed in RFCs 2015 and 3156) that provides privacy and authentication using the Multipurpose Internet Mail Extensions (MIME) security content types described in RFC 1847, currently deployed in PGP 5.0 and later versions.  \n  "
        },
        {
            "word": "Phase 1, Phase 2",
            "def": " Stages in establishing a site-to-site Virtual Private Network (VPN) tunnel. Designated computers negotiate security parameters to protect the managing of the tunnel itself using IKE (Internet Key Exchange); the result of this negotiation is called the Phase 1, or ISAKMP, security association (SA). The Phase 1 SA is then used to securely negotiate security parameters to protect IP packets; the result of that negotiation is called the Phase 2, or IPSec, SA. The Phase 2 SA is then used to securely tunnel ESP or AH-protected IP packets between these two computers.  \n  "
        },
        {
            "word": "phishing",
            "def": " An attack where the attacker tries to trick the victim into giving up sensitive information by masquerading as a trusted entity. In a common phishing attack, the attacker tries to steal authentication credentials using a fake login form on a malicious website which is designed to look like an actual organization. Attackers can also send phishing emails to users trying to trick them into downloading attached malware or visiting malicious links. See also spear phishing and whaling.  \n  "
        },
        {
            "word": "ping",
            "def": " A utility to determine whether a specific IP address is accessible. It works by sending a packet to the specified address and waiting for a reply; hence, it was named after the sound echo sonar makes when trying to locate an object.  \n  "
        },
        {
            "word": "PKCS (Public Key Crypto Standards)",
            "def": " A set of standards published by RSA Security, developed in cooperation with an informal consortium (Apple, DEC, Lotus, Microsoft, MIT, and Sun), that includes algorithm-specific and algorithm-independent implementation standards for reliable, secure public key cryptography.  \n  "
        },
        {
            "word": "PKI (Public Key Infrastructure)",
            "def": " A system of digital certificates, Certificate Authorities, and other registration authorities that verify the validity of each party involved in an Internet transaction. The intent is to establish a trusted relationship between the parties. PKI's various mechanisms can provide a foundation for message confidentiality, message integrity, non-repudiation (which means the author of a message cannot later claim he did not write it), and authentication. PKI is necessary and foundational for certificate-based Virtual Private Networks (VPN).  \n  "
        },
        {
            "word": "plain text",
            "def": " Characters in a human readable form prior to encryption or after decryption. Also called clear text.  \n  "
        },
        {
            "word": "plug and play",
            "def": " An ease-of-use ideal in the personal computer market that assures the user that a hardware device (for example, a mouse, a modem, or a scanner) can be installed without resorting to manual hardware configuration of either the device or the PC into which the device is being installed.  \n  "
        },
        {
            "word": "Policy Manager",
            "def": " The Windows-based interface used to modify and upload a Firebox configuration file. One component of the WatchGuard Firebox System.  \n  "
        },
        {
            "word": "port",
            "def": " 1. A physical hole in a computing device where you plug something in (such as, \"this PC communicates with the printer via the serial port\").  \n  2. When used in relation to IP services, a made-up, or logical, endpoint for a connection, conceived so that the computer can handle multiple applications over one network connection. Your system figures out how to treat data coming at it partially by looking at what port the data is destined for (for example, HTTP, or Web traffic, by convention uses port 80; SMTP, or e-mail traffic, uses port 25). For a fuller explanation, read the Security Fundamentals article, \"What Is a Port?\"  \n  "
        },
        {
            "word": "port address translation",
            "def": " See NAT.  \n  "
        },
        {
            "word": "port forwarding",
            "def": " See NAT.  \n  "
        },
        {
            "word": "port space probe",
            "def": " An intrusion technique whereby a hacker attempts to connect to sequential port numbers. These probes are usually attempts to find security holes which the attacker might exploit. When a listening computer responds to a message sent to a given port, the attacker then knows there really is a computer there, listening on that port.  \n  "
        },
        {
            "word": "PPP (Point-to-Point Protocol)",
            "def": " A method of connecting a computer to the Internet, often used with dial-up modems.  \n  "
        },
        {
            "word": "PPPoE (Point-to-Point Protocol over Ethernet)",
            "def": " A method of transmitting PPP traffic over Ethernet to the Internet through a common broadband medium. Commonly used in Europe. The users have the appearance of \"dialing\" the Internet, but their computers are in fact always connected.  \n  "
        },
        {
            "word": "PPTP (Point-to-Point Tunneling Protocol)",
            "def": " A VPN tunneling protocol with encryption. It uses one TCP port (for negotiation and authentication of a VPN connection) and one IP protocol (for data transfer) to connect the two nodes in a VPN. Though favored by Microsoft, many experts feel PPTP offers weaker confidentiality of data than a competing standard, IPSec.  \n  "
        },
        {
            "word": "Pretty Good Privacy",
            "def": " See PGP.  \n  "
        },
        {
            "word": "primary key(IPSec)",
            "def": " An IPSec key responsible for creating a security association. Values can be set in time or data size.  \n  "
        },
        {
            "word": "principle of precedence",
            "def": " Logic followed by the Firebox when deciding which permissions and prohibitions in your security policy override others. As a general guideline, a more specific rule usually overrides a more general rule. For example, if you've established a general a rule that says to let Any Internet traffic enter your network, and you also have a rule that says to block any traffic over port 31337, then port 31337 will be blocked: the specific rule takes precedence over the general.  \n  "
        },
        {
            "word": "private key",
            "def": " The \"secret\" component of an asymmetric key pair, often referred to as the decryption key. In a key pair (composed of a public key and a private key), it is essential that you keep the private key to yourself. \n See also asymmetric key, key pair, and public key.  \n  "
        },
        {
            "word": "private network address",
            "def": " A private network address is an IP address range that is used only within the confines of a single organization. Private addresses are used for traffic from one location to another within a clearly defined network and at no time are meant to extend beyond the perimeter, or firewall, of the organization. They are not routable on the Internet, and require some sort of address translation (see NAT) to reach the Internet. Private network address ranges are defined by the IANA and RFC 1918 as being 10.0.0.0/8, 172.16.0.0/12, and 192.168.0.0/16.  \n  "
        },
        {
            "word": "privilege elevation",
            "def": " See elevation of privilege.  \n  "
        },
        {
            "word": "probe",
            "def": " A type of hacking attempt characterized by repetitious, sequential access attempts. For example, a hacker might try to probe a series of ports in search of one that is open, or one might probe a range of IP addresses in search of a responsive computer.  \n  "
        },
        {
            "word": "procedure",
            "def": " See function.  \n  "
        },
        {
            "word": "protocol",
            "def": " A set of formal rules describing how to transmit data, especially across a network. The protocol determines issues such as: the type of error checking to be used, data compression method, if any; how the sending device will indicate that it has finished sending a message, and how the receiving device will indicate that it has received a message. Low-level protocols define the electrical and physical standards to be observed, bit- and byte-ordering, and the transmission and error detection and correction of the bit stream. High-level protocols deal with the data formatting, including the syntax of messages, character sets, and sequencing of messages.  \n  "
        },
        {
            "word": "proxy ARP",
            "def": " Proxy Address Resolution Protocol allows a network to use one network address across two physical interfaces. In typical routing, separate network interfaces on a routing device must connect to different networks with distinct IP addresses (e.g., 192.168.10.n and 192.168.11.n). Thus, adding a firewall appliance that has multiple interfaces could potentially force a network to be subdivided into separate network addresses (because although a firewall appliance is not a router, it performs routing). Proxy ARP is the answer for administrators who do not want to renumber their network. It is a technique that the Firebox uses to handle traffic between hosts that don't expect to encounter a routing device -- those hosts would expect to transmit directly to hosts now placed behind a firewall. Using Proxy ARP, the Firebox responds to ARP requests for hosts on the \"other side\" of it that can't reply for themselves. The Firebox gives an ARP reply matching the remote IP address with the Firebox's own Ethernet address (in essence, a lie, so that the requesting half of the network can continue acting as if the other half of the network is local). The Firebox then receives packets on behalf of hosts behind it, and forwards them appropriately. Proxy ARP is what allows you to use the same network address across all three Ethernet interfaces of the Firebox, known as drop-in mode. \n See also Address Resolution Protocol.  \n  "
        },
        {
            "word": "proxy server",
            "def": " A server that sits between a client application (such as a browser) and a \"real\" server. The proxy server intercepts client requests and forwards them to the other server. Its purpose is two-fold: for outgoing traffic, it allows private, non-routable machines to reach a machine which can reach the Internet for them. Secondly, as it receives responses to the client machine requests (for example, Web pages) it can cache them locally so that further client requests can be answered locally and immediately. Use of the Firebox removes the need for a proxy server, unless the proxy server is used for caching files.  \n  "
        },
        {
            "word": "proxy service",
            "def": " A combination of stateful packet filtering with content inspection. Essentially, the Firebox intercepts traffic intended for another destination (for example, a Web server or an e-mail server) and imposes rigid access and routing rules with the defense of the internal networks and servers in mind. Dangerous traffic is discarded, while normal traffic is passed to the intended destination.  \n  "
        },
        {
            "word": "pseudo-random number",
            "def": " A number that results from applying randomizing algorithms to input derived from the computing environment, such as mouse coordinates or the time of day. \n See also random number.  \n  "
        },
        {
            "word": "Public Key Crypto Standards",
            "def": " See PKCS.  \n  "
        },
        {
            "word": "public key",
            "def": " The publicly available component of an asymmetric key pair, often referred to as the encryption key. In a key pair (composed of a public key and a private key), you can make your public key well-known, as messages encrypted with it can only be decrypted by your private key. \n See also asymmetric key, key pair, and private key.  \n  "
        },
        {
            "word": "public key cryptography",
            "def": " Cryptography in which a public and private key pair is used, encrypting the data at the sender's end and decrypting it at the receiver's end. Since the data is encrypted while it travels the public Internet, no additional security is needed -- it can safely use public networks without loss of confidentiality. \n See also asymmetric key and key pair.  \n  "
        },
        {
            "word": "Public Key Infrastructure",
            "def": " See PKI.  \n  "
        },
        {
            "word": "RADIUS (Remote Authentication Dial-In User Service)",
            "def": " A method widely used on the Internet by ISPs and large organizations to validate usernames and passwords for dial-up users, and to provide proper accounting. RADIUS is distributed in source-code form, making it highly modifiable.  \n  "
        },
        {
            "word": "random number",
            "def": " A number generated from a large set of numbers, using an algorithm that gives every number an equal probability of occurring. Random numbers are used as an ingredient in encryption keys; thus, a random number generator is a necessary element in creating unique keys that are unpredictable to an adversary.  \n  "
        },
        {
            "word": "RC4 (Rivest Cipher 4)",
            "def": " One of many symmetric key algorithms. Once a proprietary algorithm of RSA Data Security, Inc., RC4 creates keys of variable size which are called streaming ciphers; that is, they are used to encrypt a stream of data byte-by-byte as it goes by.  \n  "
        },
        {
            "word": "RC5 (Rivest Cipher 5)",
            "def": " A cipher that encrypts a block (many bytes) of data at a time. The RC5 algorithm enables the user to specify block size, key length, and how many times the encrypted message should be re-encrypted (referred to as encryption rounds).  \n  "
        },
        {
            "word": "related hosts",
            "def": " A method for informing the Firebox of the physical location of a particular computer or device. This is most commonly used when the Firebox is utilizing proxy ARP in drop-in mode. Although the Firebox can use proxy ARP to automatically learn the location of hosts on its interfaces, an administrator can specify related hosts in the WatchGuard Firebox Software to make sure the Firebox knows the location of critical machines immediately.  \n  "
        },
        {
            "word": "related networks",
            "def": " A legacy term synonymous with secondary network. \n See secondary network.  \n  "
        },
        {
            "word": "remote user",
            "def": " Someone you allow to access your office network, who is geographically removed from the office.  \n  "
        },
        {
            "word": "repeater",
            "def": " A network device that regenerates signals so that they can travel farther along a cable without losing or distorting data. A repeater is not as smart as a router, but it can relay messages between subnetworks that use different protocols or cable types.  \n  "
        },
        {
            "word": "reverse lookup; reverse DNS lookup",
            "def": " The opposite of a DNS lookup. DNS works like the phone book: in a DNS lookup, you have a name (such as watchguard.com) but you want the number (an IP address). In a reverse lookup, you have the number (e.g., 64.119.131.128), but you want to find the domain name associated with it (e.g., watchguard.com).  \n  "
        },
        {
            "word": "revocation",
            "def": " This term is most often used in the context of digital certificates. A Certificate Authority assures that all parties in a digital transaction are who they claim to be and that all documents are genuine. The Certificate Authority (CA) vouches for your digital certificate, which is like ID the CA issued you. If the CA subsequently finds out one of the parties misrepresented themselves (as happened in March of 2001, when Verisign issued digital certificates to imposters claiming to represent Microsoft), the CA can revoke the digital certificate. Thus, revocation is the retraction of certification or authorization.  \n  "
        },
        {
            "word": "RFC (Request for Comments)",
            "def": " RFC documents describe standards used or proposed for the Internet. Each RFC is identified by a number, such as RFC 1700. The Internet Engineering Task Force maintains RFCs on the World Wide Web, at www.ietf.org/rfc.html.  \n  "
        },
        {
            "word": "ring topology",
            "def": " A basic networking configuration in which all nodes are connected in a circle with no terminated ends on the cable.  \n  "
        },
        {
            "word": "rogue access point",
            "def": " An unauthorized wireless access point installed on a secure network. Rogue access points (APs) increase the attack surface of a network and can potentially allow an attacker to obtain network access without being physically present in the building.  \n  "
        },
        {
            "word": "route",
            "def": " 1. The sequence of computerized devices through which information travels to reach its target machine. Each device the information travels through delineates one stage of the route, referred to as a \"hop.\"  \n  2. An entry stored on a computer, telling it how to reach other devices or networks. These entries can be automatically generated when you set up your network and can also be entered manually. They are stored in your local host's routing table.  \n  "
        },
        {
            "word": "routed mode",
            "def": " A Firebox configuration where each of the Firebox's three Ethernet interfaces must use IP addresses in different subnets. This type of configuration is intended for situations in which the Firebox is put in place with separate logical networks on its interfaces. For a contrasting approach, see drop-in mode.  \n  "
        },
        {
            "word": "router",
            "def": " A device, connected to at least two networks, that receives and sends data packets between those networks. Routers refer to packet headers and a forwarding table to decide where to forward packets to.  \n  "
        },
        {
            "word": "routine",
            "def": " See function.  \n  "
        },
        {
            "word": "RPC (Remote Procedure Call)",
            "def": " A protocol that allows a computer to ask some other computer to perform a task or service and return the result. The computer making the request is often referred to as a client, and the computer doing the task is called the server. The client computer does not need to know how to perform the task itself, it just sends an RPC request to a server and gets some result.  \n  "
        },
        {
            "word": "RUVPN (Remote User Virtual Private Networking)",
            "def": " RUVPN establishes a secure connection over the Internet between a remote computer and your protected network.  \n  "
        },
        {
            "word": "salt",
            "def": " A tiny bit of near-random data inserted where too much predictability would be undesirable. In cryptography, salt is a random string that is added onto passwords (or random numbers) before an algorithm is performed on the password. The extra data effectively lengthens and obscures the password, making the cipher text less susceptible to dictionary attacks.  \n  "
        },
        {
            "word": "scalable architecture",
            "def": " Software and/or hardware constructed so that it can grow efficiently.  \n  "
        },
        {
            "word": "SCSI (Small Computer System Interface)",
            "def": " A processor-independent standard for system-level interfacing between a computer and intelligent devices including hard disks, floppy disks, CD-ROM, printers, and scanners. Pronounced \"scuzzy.\"  \n  "
        },
        {
            "word": "secondary network",
            "def": " A network on the same physical wire as a Firebox interface having a different IP network address. This technique allows you to add as many subnets as you want to a single Ethernet interface on a Firebox.  \n  "
        },
        {
            "word": "secret key",
            "def": " The encryption key used in symmetric algorithms.  \n  "
        },
        {
            "word": "secret sharing",
            "def": " See key splitting.  \n  "
        },
        {
            "word": "secure channel",
            "def": " A means of conveying information from one entity to another using a method that does not offer an intruder the ability to reorder, delete, insert, or read information.  \n  "
        },
        {
            "word": "SecurID token",
            "def": " A hardware-based authentication method owned by RSA. The user enters his PIN into the token, which resembles a small hand-held calculator. The token combines the user's PIN with numbers inside itself to create a number that RSA calls a \"passcode.\" The user then logs in with his username on a PC, entering the passcode number. The PC sends it to an authentication server. If the passcode matches what the server expects, the user is authorized. This method is known as \"response only\" because the server did not issue a challenge.  \n  "
        },
        {
            "word": "security association (SA)",
            "def": " In Internet Protocol Security (IPSec), settings that establish policy and encryption keys used to protect communications between two end points in a Virtual Private Network (VPN). Security associations are negotiated between two computers during the first phase of establishing an Internet Key Exchange (IKE) connection. \n See also Phase 1, Phase 2.  \n  "
        },
        {
            "word": "segment",
            "def": " A section of a network. Typically, a segment is thought of as ending where it reaches a router or a routing device (such as the Firebox).  \n  "
        },
        {
            "word": "self-extracting file",
            "def": " A compressed file that automatically decompresses when double-clicked.  \n  "
        },
        {
            "word": "server",
            "def": " A computer that provides shared resources to network users. The network users are often referred to as clients of that server. \n See also client/server.  \n  "
        },
        {
            "word": "server-based network",
            "def": " A network in which all client computers use a dedicated central server computer for network functions such as storage, security, and other resources. \n See also server.  \n  "
        },
        {
            "word": "Server Message Block (SMB)",
            "def": " A message format used by DOS and Windows to share files, directories and devices (such as printers). NetBIOS is based on the SMB format, and many network products use SMB. SMB runs over most common network protocols, including TCP/IP.  \n  "
        },
        {
            "word": "Services Arena",
            "def": " WatchGuard's term for the area in WatchGuard Firebox System's Policy Manager that displays icons representing the services (such as proxies and packet filters) configured for a Firebox.  \n  "
        },
        {
            "word": "ServiceWatch",
            "def": " A graphical monitor providing a real-time display that graphs how many connections exist, by service. This comes as part of an application called Firebox Monitors.  \n  "
        },
        {
            "word": "session hijacking",
            "def": " An intrusion technique whereby a hacker sends a command to an already existing connection between two machines, in order to wrest control of the connection away from the machine that initiated it. The hacker's goal is to gain access to a server while bypassing normal authentication measures.  \n  "
        },
        {
            "word": "session key",
            "def": " The secret (symmetric) key used to encrypt each set of data on a transaction basis. A different session key is used for each communication session. \n See also asymmetric key and key pair.  \n  "
        },
        {
            "word": "session stealing",
            "def": " See session hijacking.  \n  "
        },
        {
            "word": "setup keys (IKE)",
            "def": " Internet Key Exchange keys responsible for creating a security association.  \n  "
        },
        {
            "word": "SHA-1 (Secure Hash Algorithm)",
            "def": " A message digest function (also called a one-way hash) used in encryption. The 1994 revision to SHA, developed by NIST. SHA-1 is a mathematical process used to change the contents of a file into a 160-bit number, similar to MD4. \n See also message digest.  \n  "
        },
        {
            "word": "shared secret",
            "def": " In IPSec usage, a passphrase or password that exists on two devices to be connected by VPN. In order to begin the security negotiations that result in a VPN tunnel, both devices must know the pre-existing secret, which is used by each party to authenticate the other.  \n  "
        },
        {
            "word": "sign",
            "def": " To apply a digital signature which, in the USA, is as legally binding as a handwritten signature.  \n  "
        },
        {
            "word": "signature",
            "def": " A digital code created with a private key. \n See digital signature.  \n  "
        },
        {
            "word": "single sign-on",
            "def": " A log-in routine in which one logon provides access to all resources on the network.  \n  "
        },
        {
            "word": "slash notation",
            "def": " A concise decimal format for expressing a binary subnet mask. For example: 192.168.44.0/24 indicates that in the 32-bit IP address, the first 24 bits (192.168.44) are the address of a network. The remaining 8 bits can be used to indicate the addresses of specific devices on that network. For more, see IP address and subnet mask; for a full discussion, see the Security Fundamentals articles, \"Understanding IPv4 Subnetting (Part 1)\" and \"Part 2.\"  \n  "
        },
        {
            "word": "SLIP (Serial Line Internet Protocol)",
            "def": " A protocol for exchanging IP packets over a serial line (for example, a modem connection).  \n  "
        },
        {
            "word": "S/MIME (Secure Multipurpose Mail Extension)",
            "def": " A proposed standard for encrypting and authenticating MIME data, which is used primarily for Internet e-mail. \n See MIME.  \n  "
        },
        {
            "word": "SMS (Security Management System)",
            "def": " The former name of the GUI used to configure a Firebox. Now known as the WatchGuard Policy Manager.  \n  "
        },
        {
            "word": "SMTP (Simple Mail Transfer Protocol)",
            "def": " A protocol for sending electronic mail between servers.  \n  "
        },
        {
            "word": "social engineering attack",
            "def": " An attack that does not depend on technology as much as it depends upon tricking or persuading an individual to divulge privileged information to the attacker, usually unknowingly. For example, an attacker might phone a company's internal help desk, posing as an employee, and say, \"This is Fred in Accounting. I was on vacation for five weeks and forgot my network password. Could you look it up for me?\" If the gullible help desk technician reveals the password to the attacker, the attacker \"socially engineered\" it out of him.  \n  "
        },
        {
            "word": "SOCKS",
            "def": " A protocol for handling TCP traffic through a proxy server. It can be used with virtually any TCP application, including Web browsers and FTP clients. It provides a simple firewall because it checks incoming and outgoing packets and hides the IP addresses of client applications. SOCKS is an IETF standard, documented in RFCs 1928, 1929 and 1961. WatchGuard's SOHO uses a SOCKSv5 proxy.  \n  "
        },
        {
            "word": "SOHO",
            "def": " An abbreviation for businesses categorized as Small Office/Home Office. Also the name of the WatchGuard firewall devices designed for businesses of this size.  \n  "
        },
        {
            "word": "spam",
            "def": " Unsolicited commercial e-mail sent to many recipients, much like an electronic version of junk mail.  \n  "
        },
        {
            "word": "spear phishing",
            "def": " A type of targeted phishing attack where the attacker uses gathered details about the targeted victim to increase the credibility of the attack message.  \n  "
        },
        {
            "word": "spoofing",
            "def": " Altering data packets to falsely identify the originating computer. Spoofing is generally used when a hacker wants to make it difficult to trace where the attacks are coming from.  \n  "
        },
        {
            "word": "SSID (Service Set Identifier)",
            "def": " Usually pronounced as a word, rather than initials. A unique string, up to 32 characters, that serves as the name of a wireless local area network (WLAN). Because a SSID differentiates one network from another, multiple wireless networks can function even when their ranges overlap. In an open network, the access point broadcasts the SSID. You can configure your wireless access point (WAP) not to broadcast the SSID, so that users trying to join the network must already know the network name.  \n  "
        },
        {
            "word": "SSL (Secure Sockets Layer)",
            "def": " A protocol for transmitting private documents over the Internet, often used by e-commerce sites (among others). SSL works by using a private key to encrypt data transferred over an SSL connection.  \n  "
        },
        {
            "word": "stance",
            "def": " The policy of a firewall regarding the default handling of IP packets. Stance dictates what the firewall will do with any given packet in the absence of explicit instructions. The WatchGuard default stance is to discard all packets that are not explicitly allowed, often stated as \"That which is not explicitly allowed is denied.\"  \n  "
        },
        {
            "word": "star topology",
            "def": " A networking setup used with 10Base-T Ethernet cabling and a hub. Each node on the network is connected to the hub, like points of a star.  \n  "
        },
        {
            "word": "stateful packet filtering",
            "def": " \"Packet filtering\" means using a firewall to examine where each packet comes from (by IP source address), where it's going (IP destination), and what port it's using. This information helps the firewall determine whether to allow or deny the packet's passage through your network. In stateful inspection, the firewall also examines more of the packet's delivery information and its conditions, including what port the packet is using, and maintains a sense of context. For example, a packet might arrive looking like a valid Reply packet, but if you never issued a Request, through dynamic packet filtering the firewall can sense that this is a spurious packet, and deny it.  \n  "
        },
        {
            "word": "static NAT (Network Address Translation)",
            "def": " The ability to have the Firebox forward all traffic received on a given port and a given public IP, to a private IP behind the firewall. \n See also NAT.  \n  "
        },
        {
            "word": "stream cypher",
            "def": " A class of symmetric key encryption that encrypts each byte of data as it is received, instead of gathering the data into large blocks before encrypting. Useful for equipment that has little memory for buffering data.  \n  "
        },
        {
            "word": "subnet",
            "def": " A subdivision of a network that uses a sequential range of IP addresses (i.e. 10.45.32.1 to 10.45.32.128). Administrators divide large networks into subnets for many reasons. One reason: subnets are typically easier to troubleshoot than a large network because the administrator is dealing with fewer machines at a time.  \n  "
        },
        {
            "word": "subnet mask",
            "def": " This is a difficult concept to express succinctly. If it is new to you, please begin by reading the entry for IP address.  \n  A subnet mask is a numeric value that helps a networked host or router understand how to interpret the destination IP address on packets the machine receives. When a computer receives a data packet, it tries to figure out if the IP address the packet is destined for is local (meaning, on the same network segment as the machine), or non-local. This matters to the machine because if the destination is local, the machine can deliver the packet (using ARP). If the address is not local, the machine does not know how to deliver the packet. Figuratively, it says, \"I give up!\" and forwards the packet to the default gateway (another machine, often a router, which handles everything non-local).  \n  In trying to decide whether a destination IP address is local or not, the machine must discern how much of the IP address designates the destination network, and how much of the address designates the destination host. If the destination address is 192.168.14.10, what part of that address specifies the destination network? 192? Or 192.168? Or perhaps 192.168.14?  \n  The subnet mask, which is specified on each networked machine in a routing table, provides the answer. Like an IP address, a subnet mask is a 32-bit value. The machine combines it mathematically with the destination IP address, using an operation called a \"Boolean AND.\" The nature of the subnet mask plus the Boolean AND guarantee a result that will tell the machine, in binary values, how much of the IP address is the network range and how much is the host address. The machine then understands how to properly forward the packet. \n See also CIDR and slash notation. For a full discussion, see the Security Fundamentals articles, \"Understanding IP Addresses and Binary,\" \"Understanding IPv4 Subnetting (Part 1),\" and \"Understanding IPv4 Subnetting (Part 2).\"  \n  "
        },
        {
            "word": "subroutine",
            "def": " See function.  \n  "
        },
        {
            "word": "substitution cipher",
            "def": " An encoding method in which plain text characters are replaced with other characters to form coded text. For example, the most elementary substitution cipher might say A=1, B=2, C=3, etc. to encrypt the word \"DOG\" as \"4-15-7.\" Real substitution ciphers, of course, are much more complex.  \n  "
        },
        {
            "word": "switch",
            "def": " A device that filters and forwards packets between LAN segments. A typical switch has numerous physical ports, each acting as a connection point for a network segment. Larger networks utilize switches to break the network into smaller, more manageable chunks, which are easier to secure. With the traffic on the entire network broken into smaller units, packets encounter fewer collisions, enhancing network performance.  \n  "
        },
        {
            "word": "symmetric algorithm",
            "def": " An encryption method where the same key is used both to encrypt and decrypt messages. Also called conventional, secret key, and single key algorithm. \n See also asymmetric keys.  \n  "
        },
        {
            "word": "SYN flood attack",
            "def": " A method of denying service to legitimate users of a network resource (such as a Web server) by intentionally overloading a network with illegitimate TCP connection requests. SYN is short for \"synchronize,\" the first packet sent when one computer tries to connect to another using TCP. In a normal TCP connection, or handshake:  \n  1. Computer A sends a SYN packet;  \n  2. Computer B acknowledges the connection attempt and sends back its own SYN packet (thus, a SYN/ACK packet), and  \n  3. Computer A acknowledges Computer B's response.  \n  In a SYN flood attack, Computer A never acknowledges Computer B (in other words, Step 3 never happens). This forces Computer B to wait for A's acknowledgment until B times out and drops the connection. Flooding Computer B with a huge number of such incomplete requests keeps B tied up uselessly. This is one version of a Denial of Service attack.  \n  "
        },
        {
            "word": "syslog",
            "def": " An industry-standard protocol used for sending and receiving log information for devices on a network. Syslog support is included in Unix-based and Linux-based systems.  \n  "
        },
        {
            "word": "TCP (Transmission Control Protocol)",
            "def": " A set of rules that enables a broad spectrum of different kinds of computers to establish a connection and exchange streams of data. TCP guarantees delivery of data and also guarantees that packets will be delivered in the same order in which they were sent, so it is considered \"reliable.\" Most long-haul traffic on the Internet uses TCP.  \n  "
        },
        {
            "word": "TCP handshake",
            "def": " A three-step process computers go through when negotiating a connection with one another. Simplistically described, in a normal TCP handshake:  \n  1. Computer A sends a SYN packet (for \"synchronize\");  \n  2. Computer B acknowledges the connection attempt and sends back its own SYN packet (thus, a SYN/ACK packet), and  \n  3. Computer A acknowledges Computer B's response.  \n  Once both computers are synchronized and acknowledged, they can begin passing data back and forth. To learn how attackers might exploit this, see SYN flood attack.  \n  "
        },
        {
            "word": "TCP/IP (Transmission Control Protocol/Internet Protocol)",
            "def": " A common networking standard with the ability to connect a diverse array of systems. This is one of the underlying protocols of the Internet. For others, see ICMP, IP, TCP, and UDP.  \n  "
        },
        {
            "word": "TCP session hijacking",
            "def": " See session hijacking.  \n  "
        },
        {
            "word": "Telnet",
            "def": " A remote control program typically found on Unix systems in TCP/IP networks. A telnet client runs on your PC and connects it to a remote server on a network. You can then enter commands through the Telnet program and they will be executed as if you were entering them directly on the server console. This enables you to control the server and communicate with other servers on that remote network.  \n  "
        },
        {
            "word": "timestamping",
            "def": " Recording the time when an event happens (typically in a log) or when a piece of information is created or modified.  \n  "
        },
        {
            "word": "TLS (Transport Layer Security)",
            "def": " A general-purpose protocol for encrypting Web, e-mail, and other stream-oriented information sent over the Internet. TLS is a relatively recent (first published in 1999) derivative of the Secure Sockets Layer (SSL) version 3.0 protocol, and is described in RFCs 2246, 2712, 2817, and 2818.  \n  "
        },
        {
            "word": "token",
            "def": " Also called a security token or an authentication token. Something a person has that evidences validity, or identity. It is usually a hardware device that resembles a hand-held calculator, since it often has some sort of display and perhaps a keypad for entering numbers. Tokens achieve the goal of \"two-factor authentication,\" considered a strong standard of security when validating who a user is, because accessing a network that uses tokens requires two factors: something the person knows (a password) and something the person has (the token).  \n  "
        },
        {
            "word": "tooltip",
            "def": " A name or phrase that appears when the mouse pointer pauses over a button or icon.  \n  "
        },
        {
            "word": "topology",
            "def": " A wiring configuration used for a network. Also referred to as a network's architecture.  \n  "
        },
        {
            "word": "transposition cipher",
            "def": " A cipher in which the plain text remains the same but the order of the characters is scrambled. Thus, the word \"DOG\" might become \"OGD.\" Transposition is sometimes used as one step in the midst of several mathematical operations that, together, make up a cryptographic algorithm.  \n  "
        },
        {
            "word": "Triple-DES (3DES)",
            "def": " A cryptographic algorithm using three keys (rather than one or two). Triple DES is simply another mode of DES operation, where the DES algorithm is applied three times on the data to be encrypted, using a different key each time. 3DES is currently one of two US federal government standards for encrypting non-classified data.  \n  "
        },
        {
            "word": "trust",
            "def": " Confidence in the honesty, integrity, or reliability of a person, company, or other entity. The concept also extends to believing that an unseen remote party is who he or she claims to be.  \n  "
        },
        {
            "word": "Trusted interface",
            "def": " The Ethernet port on the Firebox that connects it to your internal network. \n See Trusted network and Optional interface.  \n  "
        },
        {
            "word": "Trusted network",
            "def": " The private network which you intend your firewall to primarily protect. The Trusted network is usually where your most sensitive corporate resources reside or where home office employees do their work. This contrasts with the semi-public Optional network.  \n  "
        },
        {
            "word": "tunnel",
            "def": " In Virtual Private Networks (VPN), an encrypted connection between sites. Only the originator and the receiver of the message see it in its clear state. Any hacker trying to intercept the message en route gets nothing but a scrambled mess. Because the path of a VPN message has \"light\" (clear text) at each end but \"darkness\" (obscurity) at all the between-points, it is called, metaphorically, a VPN tunnel.  \n  On a technical level, a tunnel is a means of exchanging encapsulated data packets between two parties. Though some tunneling protocols forward cleartext packets, WatchGuard utilizes tunneling protocols such as PPTP and IPSec ESP that forward encrypted packets.  \n  "
        },
        {
            "word": "twisted-pair cable",
            "def": " A cable used for both network and telephone communications. Also known as UTP (unshielded twisted pair) and 10Base-T/100Base-T cable.  \n  "
        },
        {
            "word": "UDP (User Datagram Protocol)",
            "def": " A set of standards for transmitting data over networks. Some technicians have nicknamed it the \"Unreliable Darn Protocol\" because when sending data, UDP does not verify that it has established a connection at the receiving end; it simply blasts away until the message has been sent. Thus, UDP is termed a \"connectionless\" protocol. Because it doesn't perform the checks and verifications of TCP, UDP is simpler to implement and is used where a small amount of packet loss is acceptable. On the Internet, UDP is often used for streaming video and audio.  \n  "
        },
        {
            "word": "URL (Universal Resource Locator)",
            "def": " The user-friendly address that identifies the location of a Web site, such as http://www.watchguard.com.  \n  "
        },
        {
            "word": "validation",
            "def": " The act of examining information provided by a person (or a system) to ascertain what rights, privileges, or permissions they may (or may not) have to perform some action. For example, when you attempt to charge a purchase at a retail store to a credit card, the cashier validates your identity by examining your identification and comparing your signature on the receipt with the signature on the credit card.  \n  "
        },
        {
            "word": "verification",
            "def": " In cryptography, the act of testing the authenticity of a digital signature by performing special mathematical operations on data provided by a sender, to see if it matches an expected result. If the information provided by the sender yields the expected result, the signature is valid, because calculating the proper answer requires secret data known only by the sender. Verification proves that the information was actually sent by the signer and that the message has not been subsequently altered by anyone else. \n See also asymmetric key and digital signature.  \n  "
        },
        {
            "word": "VPN (Virtual Private Network)",
            "def": " A means of having the security benefits of a private, dedicated, leased-line network, without the cost of actually owning one. VPN uses cryptography to scramble data so it's unreadable while traveling over the Internet, thus providing privacy over public lines. Companies with branch offices commonly use VPNs to connect multiple locations. \n See also tunnel.  \n  "
        },
        {
            "word": "Vulnerability Assessment",
            "def": " Vulnerability Assessment is the process of identifying network and device vulnerabilities before hackers can exploit the security holes. QualysGuard is a Managed Vulnerability Assessment Web service solution to audit networks. QualysGuard is a continuous preventive process to: \n Detect network and system vulnerabilities. \n Deliver near-instantaneous email alerts summarizing discovered vulnerabilities and trends. \n Prioritize the severity of each vulnerability on an industry-standard scale, from \"watch\" to \"urgent\", so administrators can readily determine where to deploy their security specialists for fixes. \n Recommend and make direct links to verified remedies for each vulnerability. \n Produce trend analysis in graphical form, with granular detail appropriate for both security specialists and non-technical management to track vulnerabilities over time.  \n  "
        },
        {
            "word": "WAN (Wide Area Network)",
            "def": " A computer network that spans a relatively large geographical area. Typically, a WAN consists of two or more local area networks (LANs) connected by a high-speed line.  \n  "
        },
        {
            "word": "WatchGuard LiveSecurity Service",
            "def": " Part of the WatchGuard Firebox Security System offering, separate from the software and the Firebox, which keeps network defenses current. The LiveSecurity Service includes software updates, technical support, timely broadcasts of security intelligence, and a resource-rich Web site containing FAQs, archived articles, online training, a moderated user forum, and the latest software.  \n  "
        },
        {
            "word": "WatchGuard Security Event Processor (WSEP)",
            "def": " WatchGuard's proprietary log server software. It provides critical timing services for the Firebox and includes its own GUI. \n See server and client/server.  \n  "
        },
        {
            "word": "WebBlocker",
            "def": " An optional WatchGuard software module that prevents users behind the Firebox from accessing undesirable Web sites. It works based on a regularly updated database of sites that could be objectionable, categorized by content type (e.g., pornography, gambling, or racist hatred sites).  \n  "
        },
        {
            "word": "Web browser",
            "def": " Software used to view thxe World Wide Web, a graphically rich presentation of information on the Internet. The most popular Web browser is Microsoft's Internet Explorer, but other browsers such as Netscape Navigator and Opera are available. To find specific sites on the Web, you enter a URL in your Web browser.  \n  "
        },
        {
            "word": "Web of Trust",
            "def": " A term describing a relationship-based extension of the concept of trust, popularized in PGP. For example, if you trust Bob and Bob says Rachel is a good auto mechanic, you'll trust Rachel to fix your car even if you have not previously met Rachel. A similar concept is used to validate encryption keys in PGP. If you know and trust Bob, and Bob gives you a text block and says it is Rachel's public key, you'll accept the text block as Rachel's key even if you don't know Rachel. If Rachel later sends a message encrypted with or signed by her private key, you'll be ready to decrypt it or verify the signature because you have her public key. You can then pass Rachel's public key to someone who trusts you, thus extending the Web of Trust by another node.  \n  "
        },
        {
            "word": "Web page",
            "def": " A single HTML-formatted file posted where it can be accessed via the World Wide Web.  \n  "
        },
        {
            "word": "Web site",
            "def": " A collection of affiliated Web pages.  \n  "
        },
        {
            "word": "WEP (Wired Equivalent Privacy)",
            "def": " The security aspects of 802.11b, a standard that enables wireless devices such as PDAs and laptop computers to access a network via radio frequencies instead of physical wiring. WEP has three tasks: 1) to authenticate clients to access points; 2) to encrypt the data exchanged between the clients and access points; and 3) to include an integrity check with every packet exchanged. The initial implementation of WEP provides weak security. While it is not completely useless, it is best used as another layer of security in conjunction with stronger measures.  \n  "
        },
        {
            "word": "WFS (WatchGuard Firebox System)",
            "def": " Software used for managing WatchGuard's Firebox model firewalls. WFS consists of multiple components, some used on a PC you designate as a Management Station, and some loaded into the Firebox's memory. WFS enables such features as configuring the policies of the Firebox, setting up and customizing services, logging, monitoring, and reporting.  \n  "
        },
        {
            "word": "whaling",
            "def": " A type of spear-phishing attack specifically targeted at high-ranking executives in an organization.  \n  "
        },
        {
            "word": "white hat",
            "def": " A person who investigates flaws in network security measures in order to strengthen them and to prevent computer networks from being invaded. When such a researcher discovers new security flaws, he or she reports them to the appropriate vendor to be fixed, rather than using the knowledge illicitly. See black hat.  \n  "
        },
        {
            "word": "WINS (Windows Internet Name Service)",
            "def": " WINS provides name resolution for computers running Windows NT, Windows 98, and earlier versions of Microsoft operating systems. With name resolution, users access servers by name rather than needing to use IP addresses.  \n  "
        },
        {
            "word": "WIPS (Wireless Intrusion Prevention System)",
            "def": " A wireless networking device or service capable of detecting and containing a rogue access point. WIPS creates a fingerprint for wireless access points by tracking data points such as SSIDs, authentication types, and signal strength. If WIPS detects a fingerprint that does not match an authorized access point, it can take actions to block or disrupt connections to the unauthorized access point.  \n  "
        },
        {
            "word": "WLAN (Wireless Local Area Network)",
            "def": " A computer network that spans a relatively small area, generally confined to a single building or group of buildings. In a wireless network, devices connect through high-frequency radio waves using IEEE standard 802.11.  \n  "
        },
        {
            "word": "World Wide Web Consortium (W3C)",
            "def": " An international industry consortium founded in 1994 to develop common protocols for the evolution of the World Wide Web. W3C has around 450 member organizations from around the world.  \n  "
        },
        {
            "word": "WPA (WiFi Protected Access)",
            "def": " A data encryption specification for 802.11 wireless networks. Wireless networks rely on radio waves, which broadcast in all directions. Any device within range of a wireless access point could eavesdrop upon its transmissions. WPA encrypts wireless data so that an eavesdropper intercepts gibberish, while authorized endpoints receive clear, decrypted data. WPA replaces WEP, a weaker wireless encryption standard that attackers can readily break.  \n  "
        },
        {
            "word": "worm",
            "def": " A self-replicating program that seeks access into other computers by exploiting security flaws. After a worm penetrates another computer, it continues seeking access to other areas. Worms often steal or vandalize computer data. Many viruses are more accurately termed worms, and use e-mail or database systems to propagate themselves to their victims.  \n  "
        },
        {
            "word": "XOR",
            "def": " Shorthand for \"Exclusive-or,\" a mathematical operation used to represent the differences between two values.  \n  "
        },
        {
            "word": "X.509v3",
            "def": " An ITU-T digital certificate that is an internationally recognized electronic document used to prove identity and public key ownership over a communication network. It contains the issuer's name, the user's identifying information, and the issuer's digital signature.  \n  "
        }
    ]
